Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libadditional.po
Languages: it

source: The selected month (and/or year) changed.
it: Il mese (e/o l'anno) selezionato è cambiato.

source: The selected day changed.
it: Il giorno selezionato è cambiato.

source: The selected month changed.
it: Il mese selezionato è cambiato.

source: The selected year changed.
it: L'anno selezionato è cambiato.

source: User clicked on the week day header (only generic).
it: L'utente ha cliccato sull'intestazione del giorno della settimana (solo generico).

source: User clicked on the week of the year number (only generic).
it: L'utente ha cliccato sul numero della settimana dell'anno (solo generico).

source: The position of the scrollbar in scroll units.
it: La posizione della barra di scorrimento in unità di scorrimento.

source: range
it: Intervallo

source: The maximum position of the scrollbar.
it: La posizione massima della barra di scorrimento.

source: thumbsize
it: Dimensione Presa

source: The size of the thumb, or visible portion of the scrollbar, in scroll units.
it: La dimensione del pollice, o parte visibile della barra di scorrimento, in unità di scorrimento.

source: pagesize
it: Dimensione Pagina

source: This is the number of scroll units that will be scrolled when the user pages up or down.
it: Questo è il numero di unità di scorrimento che verranno fatte scorrere quando l'utente scorre verso l'alto o verso il basso.

source: Specifies a horizontal scrollbar.
it: Specifica una barra di scorrimento orizzontale.

source: Specifies a vertical scrollbar.
it: Specifica una barra di scorrimento verticale.

source: Process all scroll events.
it: Elabora tutti gli eventi di scorrimento.

source: Process wxEVT_SCROLL_TOP scroll-to-top events (minimum position).
it: Elabora eventi wxEVT_SCROLL_TOP scroll-to-top (posizione minima).

source: Process wxEVT_SCROLL_BOTTOM scroll-to-bottom events (maximum position).
it: Elabora wxEVT_SCROLL_BOTTOM eventi scroll-to-bottom (posizione massima).

source: Process wxEVT_SCROLL_LINEUP line up events.
it: Elabora wxEVT_SCROLL_LINEUP eventi di allineamento.

source: Process wxEVT_SCROLL_LINEDOWN line down events.
it: Elabora gli eventi di riga down wxEVT_SCROLL_LINEDOWN.

source: Process wxEVT_SCROLL_PAGEUP page up events.
it: Elabora eventi di pagina up wxEVT_SCROLL_PAGEUP.

source: Process wxEVT_SCROLL_PAGEDOWN page down events.
it: Elabora wxEVT_SCROLL_PAGEDOWN eventi pagina giù.

source: Process wxEVT_SCROLL_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack).
it: Elabora gli eventi di thumbtrack wxEVT_SCROLL_THUMBTRACK (eventi frequenti inviati mentre l'utente trascina la thumbtrack).

source: Process wxEVT_SCROLL_THUMBRELEASE thumb release events.
it: Elabora gli eventi di rilascio della miniatura wxEVT_SCROLL_THUMBRELEASE.

source: Process wxEVT_SCROLL_CHANGED end of scrolling events (MSW only).
it: Elabora wxEVT_SCROLL_CHANGED fine degli eventi di scorrimento (solo MSW).

source: Process all scroll events. Variant taking a window identifier.
it: Elabora tutti gli eventi di scorrimento. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_TOP scroll-to-top events (minimum position). Variant taking a window identifier.
it: Elabora eventi wxEVT_SCROLL_TOP scroll-to-top (posizione minima). Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_BOTTOM scroll-to-bottom events (maximum position). Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_BOTTOM eventi scroll-to-bottom (posizione massima). Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_LINEUP line up events. Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_LINEUP eventi di allineamento. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_LINEDOWN line down events. Variant taking a window identifier.
it: Elabora gli eventi di riga down wxEVT_SCROLL_LINEDOWN. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_PAGEUP page up events. Variant taking a window identifier.
it: Elabora eventi di pagina up wxEVT_SCROLL_PAGEUP. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_PAGEDOWN page down events. Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_PAGEDOWN eventi pagina giù. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack). Variant taking a window identifier.
it: Elabora gli eventi di thumbtrack wxEVT_SCROLL_THUMBTRACK (eventi frequenti inviati mentre l'utente trascina la thumbtrack). Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_THUMBRELEASE thumb release events. Variant taking a window identifier.
it: Elabora gli eventi di rilascio della miniatura wxEVT_SCROLL_THUMBRELEASE. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_CHANGED end of scrolling events (MSW only). Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_CHANGED fine degli eventi di scorrimento (solo MSW). Variante che prende un identificatore di finestra.

source: min
it: Minimo

source: Minimal value.
it: Valore minimo.

source: max
it: Massimo

source: Maximal value.
it: Valore massimo.

source: initial
it: Iniziale

source: Initial value.
it: Valore Iniziale.

source: The user can use arrow keys to change the value.
it: L'utente può utilizzare i tasti freccia per modificare il valore.

source: The value wraps at the minimum and maximum.
it: Il valore si avvolge al minimo e al massimo.

source: Same as wxTE_LEFT for wxTextCtrl: the text is left aligned.
it: Uguale a wxTE_LEFT per wxTextCtrl: il testo è allineato a sinistra.

source: Same as wxTE_CENTER for wxTextCtrl: the text is centered.
it: Uguale a wxTE_CENTER per wxTextCtrl: il testo è centrato.

source: Same as wxTE_RIGHT for wxTextCtrl: the text is right aligned (this is the default).
it: Uguale a wxTE_RIGHT per wxTextCtrl: il testo è allineato a destra (questa è l'impostazione predefinita).

source: Generated whenever the numeric value of the spinctrl is updated.
it: Generato ogni volta che viene aggiornato il valore numerico di spinctrl.

source: Generated whenever the user modifies the text in the edit part of the spin control directly.
it: Generato ogni volta che l'utente modifica direttamente il testo nella parte di modifica del controllo spin.

source: Respond to a wxEVT_COMMAND_TEXT_ENTER event, generated when enter is pressed in the edit part of the spin control (which must have wxTE_PROCESS_ENTER style for this event to be generated).
it: Risponde a un evento wxEVT_COMMAND_TEXT_ENTER, generato quando si preme invio nella parte di modifica del controllo spin (che deve avere lo stile wxTE_PROCESS_ENTER per generare questo evento).

source: inc
it: Incremento

source: Increment value.
it: Incrementa il valore.

source: digits
it: Cifre

source: The number of digits in the display.
it: Il numero di cifre sul display.

source: Generated whenever the numeric value of the control is updated.
it: Generato ogni volta che viene aggiornato il valore numerico del controllo.

source: Specifies a horizontal spin button (note that this style is not supported in wxGTK).
it: Specifica un pulsante di rotazione orizzontale (nota che questo stile non è supportato in wxGTK).

source: Specifies a vertical spin button.
it: Specifica un pulsante di rotazione verticale.

source: Generated whenever an arrow is pressed.
it: Generato ogni volta che viene premuta una freccia.

source: Generated when left/up arrow is pressed.
it: Generato quando si preme la freccia sinistra/su.

source: Generated when right/down arrow is pressed.
it: Generato quando si preme la freccia destra/giù.

source: label
it: Etichetta

source: Text of the hyperlink
it: Testo del collegamento ipertestuale

source: Target of the hyperlink
it: Obiettivo del collegamento ipertestuale

source: hover_color
it: Colore Passaggio Mouse

source: The colour used to print the label of the hyperlink when the mouse is over the control.
it: Il colore utilizzato per stampare l'etichetta del collegamento ipertestuale quando il mouse è sul controllo.

source: normal_color
it: Colore Normale

source: The colour used to print the label when the link has never been clicked before (i.e. the link has not been visited) and the mouse is not over the control.
it: Il colore utilizzato per stampare l'etichetta quando il collegamento non è mai stato cliccato prima (cioè il collegamento non è stato visitato) e il mouse non è sopra il controllo.

source: visited_color
it: Colore Visitato

source: The colour used to print the label when the mouse is not over the control and the link has already been clicked before (i.e. the link has been visited).
it: Il colore utilizzato per stampare l'etichetta quando il mouse non è sopra il controllo e il collegamento è già stato cliccato in precedenza (ovvero il collegamento è stato visitato).

source: Align the text to the left.
it: Allinea il testo a sinistra.

source: Align the text to the right.
it: Allinea il testo a destra.

source: Center the text (horizontally).
it: Centra il testo (orizzontalmente).

source: Pop up a context menu when the hyperlink is right-clicked. The context menu contains a &quot;Copy URL&quot; menu item which is automatically handled by the hyperlink and which just copies in the clipboard the URL (not the label) of the control.
it: Apri un menu di scelta rapida quando si fa clic con il pulsante destro del mouse sul collegamento ipertestuale. Il menu di scelta rapida contiene un &quot;Copia URL&quot; voce di menu che viene gestita automaticamente dal collegamento ipertestuale e che copia negli appunti solo l'URL (non l'etichetta) del controllo.

source: The default style for wxHyperlinkCtrl: wxNO_BORDER|wxHL_CONTEXTMENU|wxHL_ALIGN_CENTRE.
it: Lo stile predefinito per wxHyperlinkCtrl: wxNO_BORDER|wxHL_CONTEXTMENU|wxHL_ALIGN_CENTRE.

source: The hyperlink was (left) clicked. If this event is not handled in user's code (or it's skipped; see wxEvent::Skip), then a call to wxLaunchDefaultBrowser is done with the hyperlink's URL.
it: Il collegamento ipertestuale è stato (a sinistra) cliccato. Se questo evento non viene gestito nel codice dell'utente (o viene saltato; vedi wxEvent::Skip), allora viene eseguita una chiamata a wxLaunchDefaultBrowser con l'URL del collegamento ipertestuale.

source: defaultfolder
it: Cartella Predefinita

source: Initial Directory.
it: Directory iniziale.

source: filter
it: Filtro

source: A filter string, using the same syntax as that for wxFileDialog. This may be empty if filters are not being used. Example: &quot;All files (*.*)|*.*|JPEG files (*.jpg)|*.jpg&quot;.
it: Una stringa di filtro, utilizzando la stessa sintassi di quella di wxFileDialog. Questo può essere vuoto se non vengono utilizzati i filtri. Esempio: &quot;Tutti i file (*.*)|*.*|File JPEG (*.jpg)|*.jpg&quot;.

source: defaultfilter
it: Filtro Predefinito

source: The zero-indexed default filter setting.
it: L'impostazione del filtro di default con indicizzazione zero.

source: show_hidden
it: Mostra Nascosti

source: Show hidden files
it: Mostra file nascosti

source: Only show directories, and not files.
it: Mostra solo le directory e non i file.

source: Use 3D borders for internal controls.
it: Usa i bordi 3D per i controlli interni.

source: When setting the default path, select the first file in the directory.
it: Quando si imposta il percorso predefinito, selezionare il primo file nella directory.

source: Show the drop-down filter list.
it: Mostra l'elenco a discesa dei filtri.

source: Allow the folder and file labels to be editable.
it: Consente la modifica delle etichette delle cartelle e dei file.

source: Allows multiple files and folders to be selected simultaneously
it: Consente di selezionare più file e cartelle contemporaneamente

source: Selected directory has changed. Processes a wxEVT_DIRCTRL_SELECTIONCHANGED event type. Notice that this event is generated even for the changes done by the program itself and not only those done by the user. Available since wxWidgets 2.9.5.
it: La directory selezionata è cambiata. Elabora un tipo di evento wxEVT_DIRCTRL_SELECTIONCHANGED. Si noti che questo evento viene generato anche per le modifiche apportate dal programma stesso e non solo dall'utente. Disponibile a partire da wxWidgets 2.9.5.

source: The user activated a file by double-clicking or pressing Enter. Available since wxWidgets 2.9.5.
it: L'utente ha attivato un file facendo doppio clic o premendo Invio. Disponibile a partire da wxWidgets 2.9.5.

source: The path to media file.
it: Il percorso del file multimediale.

source: Play the media file.
it: Riproduci il file multimediale.

source: playback_rate
it: Velocità Riproduzione

source: Sets the playback rate, or speed of the media, to that referred by dRate. 1.0 represents normal speed, while 2.0 represents twice the normal speed of the media, for example. Not supported on the GStreamer (Unix) backend.
it: Imposta la velocità di riproduzione, o velocità del supporto, a quella indicata da dRate. 1.0 rappresenta la velocità normale, mentre 2.0 rappresenta il doppio della velocità normale del supporto, ad esempio. Non supportato sul backend GStreamer (Unix).

source: Sets the volume of the media from a 0.0 to 1.0 range to that referred by dVolume. 1.0 represents full volume, while 0.5 represents half (50 percent) volume, for example. Note that this may not be exact due to conversion and rounding errors, although setting the volume to full or none is always exact.
it: Imposta il volume del supporto da un intervallo da 0,0 a 1,0 a quello riferito da dVolume. 1.0 rappresenta il volume completo, mentre 0,5 rappresenta la metà (50 percento) del volume, ad esempio. Si noti che ciò potrebbe non essere esatto a causa di errori di conversione e di arrotondamento, sebbene l'impostazione del volume su pieno o nessuno sia sempre esatta.

source: player_controls
it: Controlli Riproduzione

source: wxMEDIACTRLPLAYERCONTROLS_STEP, Step controls like fastfoward, step one frame etc.
it: wxMEDIACTRLPLAYERCONTROLS_STEP, controlli Step come fastforward, step one frame ecc.

source: wxMEDIACTRLPLAYERCONTROLS_VOLUME, Volume controls like the speaker icon, volume slider, etc.
it: wxMEDIACTRLPLAYERCONTROLS_VOLUME, Controlli del volume come l'icona dell'altoparlante, il cursore del volume, ecc.

source: wxMEDIACTRLPLAYERCONTROLS_DEFAULT, Default controls for the toolkit. Currently a typedef for wxMEDIACTRLPLAYERCONTROLS_STEP and wxMEDIACTRLPLAYERCONTROLS_VOLUME.
it: wxMEDIACTRLPLAYERCONTROLS_DEFAULT, Controlli predefiniti per il toolkit. Attualmente un typedef per wxMEDIACTRLPLAYERCONTROLS_STEP e wxMEDIACTRLPLAYERCONTROLS_VOLUME.

source: wxMEDIACTRLPLAYERCONTROLS_NONE, No controls. return wxMediaCtrl to it's default state.
it: wxMEDIACTRLPLAYERCONTROLS_NONE, Nessun controllo. riporta wxMediaCtrl al suo stato predefinito.

source: The control is added to a sizer using this name.
it: Il controllo viene aggiunto a un sizer utilizzando questo nome.

source: class
it: Classe

source: The control is generated to XRC with this class.
it: Il controllo viene generato in XRC con questa classe.

source: declaration
it: Dichiarazione

source: Code to generate for the declaration of this control.
it: Codice da generare per la dichiarazione di questo controllo.

source: construction
it: Costruzione

source: Code to generate for the construction of this control.
it: Codice da generare per la costruzione di questo controllo.

source: include
it: Intestazione

source: Code to generate for the include statements for this control.
it: Codice da generare per le istruzioni di inclusione per questo controllo.

source: settings
it: Impostazioni

source: Code to generate for the settings of this control.
it: Codice da generare per le impostazioni di questo controllo.

source: wxTimer object name.
it: Nome dell'oggetto wxTimer.

source: Timer identifier.
it: Identificatore del timer.

source: period
it: Periodo

source: Timer period in milliseconds.
it: Periodo del timer in millisecondi.

source: enabled
it: Abilitato

source: Enable timer on startup.
it: Abilita timer all'avvio.

source: oneshot
it: Singolo

source: Produce timer event just once.
it: Produce l'evento timer solo una volta.

source: Process a wxEVT_TIMER event, when the timer ticks.
it: Elabora un evento wxEVT_TIMER, quando il timer ticchetta.

source: Data
it: Dati

source: Data manipulation controls
it: Controlli per la manipolazione di dati

source: Use this style if you wish the user to be able to edit labels in the tree control.
it: Utilizzare questo stile se si desidera che l'utente sia in grado di modificare le etichette nel controllo ad albero.

source: For convenience to document that no buttons are to be drawn.
it: Documenta per convenienza che non devono essere disegnati pulsanti.

source: Use this style to show + and - buttons to the left of parent items.
it: Usa questo stile per mostrare i pulsanti + e - a sinistra degli elementi principali.

source: Selects alternative style of +/- buttons and shows rotating (&quot;twisting&quot;) arrows instead. Currently this style is only implemented under Microsoft Windows Vista and later Windows versions and is ignored under the other platforms. Notice that under Vista this style results in the same appearance as used by the tree control in Explorer and other built-in programs and so using it may be preferable to the default style.
it: Seleziona lo stile alternativo dei pulsanti +/- e mostra invece le frecce rotanti (&quot;twisting&quot;). Attualmente questo stile è implementato solo in Microsoft Windows Vista e versioni successive di Windows e viene ignorato nelle altre piattaforme. Si noti che in Vista questo stile ha lo stesso aspetto utilizzato dal controllo ad albero in Explorer e altri programmi integrati e quindi utilizzarlo potrebbe essere preferibile allo stile predefinito.

source: Use this style to hide vertical level connectors.
it: Utilizzare questo stile per nascondere i connettori di livello verticale.

source: Use this style to have the background colour and the selection highlight extend over the entire horizontal row of the tree control window. (This flag is ignored under Windows unless you specify wxTR_NO_LINES as well.)
it: Utilizzare questo stile per far sì che il colore di sfondo e l'evidenziazione della selezione si estendano sull'intera riga orizzontale della finestra di controllo della struttura. (Questo flag viene ignorato in Windows a meno che non si specifichi anche wxTR_NO_LINES.)

source: Use this style to show lines between root nodes. Only applicable if wxTR_HIDE_ROOT is set and wxTR_NO_LINES is not set.
it: Utilizzare questo stile per mostrare le linee tra i nodi radice. Applicabile solo se wxTR_HIDE_ROOT è impostato e wxTR_NO_LINES non è impostato.

source: Use this style to suppress the display of the root node, effectively causing the first-level nodes to appear as a series of root nodes.
it: Utilizzare questo stile per sopprimere la visualizzazione del nodo radice, facendo sì che i nodi di primo livello vengano visualizzati come una serie di nodi radice.

source: Use this style to draw a contrasting border between displayed rows.
it: Utilizzare questo stile per disegnare un bordo contrastante tra le righe visualizzate.

source: Use this style to cause row heights to be just big enough to fit the content. If not set, all rows use the largest row height. The default is that this flag is unset. Generic only.
it: Utilizzare questo stile per fare in modo che l'altezza delle righe sia abbastanza grande da adattarsi al contenuto. Se non è impostato, tutte le righe utilizzano l'altezza di riga maggiore. L'impostazione predefinita è che questo flag non è impostato. Solo generico.

source: For convenience to document that only one item may be selected at a time. Selecting another item causes the current selection, if any, to be deselected. This is the default.
it: Documenta per comodità che è possibile selezionare solo un elemento alla volta. Selezionando un altro elemento, la selezione corrente, se presente, viene deselezionata. Questa è l'impostazione predefinita.

source: Use this style to allow a range of items to be selected. If a second range is selected, the current range, if any, is deselected.
it: Utilizzare questo stile per consentire la selezione di una serie di elementi. Se viene selezionato un secondo intervallo, l'intervallo corrente, se presente, viene deselezionato.

source: The set of flags that are closest to the defaults for the native control for a particular toolkit.
it: L'insieme di flag più vicini ai valori predefiniti per il controllo nativo per un particolare toolkit.

source: Request information from the application.
it: Richiedi informazioni dall'applicazione.

source: Information is being supplied.
it: Le informazioni vengono fornite.

source: The opportunity to set the item tooltip is being given to the application (call wxTreeEvent::SetToolTip). Windows only.
it: L'opportunità di impostare il tooltip dell'elemento viene data all'applicazione (chiamare wxTreeEvent::SetToolTip). Solo Windows.

source: The state image has been clicked. Windows only.
it: L'immagine dello stato è stata cliccata. Solo Windows.

source: Grid
it: Griglia

source: rows
it: Righe

source: Number of Rows.
it: Numero di righe

source: cols
it: Colonne

source: Number of Columns.
it: Numero di colonne.

source: editing
it: Modificabile

source: Allow editing grid contents.
it: Permette la modifica del contenuto della griglia.

source: grid_lines
it: Linee Griglia

source: Show grid lines.
it: Visualizza le linee della griglia.

source: grid_line_color
it: Colore Linee Griglia

source: The colour used to draw grid lines.
it: Il colore utilizzato per disegnare le linee della griglia.

source: drag_grid_size
it: Ridimensiona Griglia

source: Allow sizing rows and columns by dragging gridlines.
it: Consenti il ​​ridimensionamento di righe e colonne trascinando le linee della griglia.

source: margin_width
it: Larghezza Margine

source: A grid may occupy more space than needed for its columns. This function allows to set how big this extra space is.
it: Una griglia può occupare più spazio del necessario per le sue colonne. Questa funzione permette di impostare quanto è grande questo spazio extra.

source: margin_height
it: Altezza Margine

source: A grid may occupy more space than needed for its rows. This function allows to set how big this extra space is.
it: Una griglia può occupare più spazio del necessario per le sue righe. Questa funzione permette di impostare quanto è grande questo spazio extra.

source: Columns
it: Colonne

source: column_sizes
it: Dimensioni Colonne

source: Comma separated list of column sizes. Note: wxGrid sets up arrays to store individual row and column sizes when non-default sizes are used. The memory requirements for this could become prohibitive if your grid is very large.
it: Elenco separato da virgole delle dimensioni delle colonne. Nota: wxGrid imposta gli array per memorizzare le dimensioni di singole righe e colonne quando vengono utilizzate dimensioni non predefinite. I requisiti di memoria per questo potrebbero diventare proibitivi se la tua griglia è molto grande.

source: autosize_cols
it: Dimensione Colonne Auto
