Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libadditional.po
Languages: it

source: Causes a (de)minimise button to be shown in the panel's chrome (if the bar in which it is contained has the wxRIBBON_BAR_SHOW_PANEL_MINIMISE_BUTTONS style set). This flag is typically combined with wxRIBBON_PANEL_NO_AUTO_MINIMISE to make a panel which the user always has manual control over when it minimises.
it: Fa in modo che un pulsante (de)minimizzi venga mostrato nel chrome del pannello (se la barra in cui è contenuto ha lo stile wxRIBBON_BAR_SHOW_PANEL_MINIMISE_BUTTONS). Questo flag è tipicamente combinato con wxRIBBON_PANEL_NO_AUTO_MINIMISE per creare un pannello su cui l'utente ha sempre il controllo manuale quando viene minimizzato.

source: Stretches a single panel to fit the parent page.
it: Allunga un singolo pannello per adattarlo alla pagina principale.

source: Allows the panel to size in both directions; currently only useful when a single wxRibbonToolBar is the child of the panel, particularly in vertical orientation where the number of rows is dependent on the amount of horizontal space available. Set the minimum and maximum toolbar rows to take full advantage of this wrapping behaviour.
it: Consente di dimensionare il pannello in entrambi i direzioni; attualmente utile solo quando un singolo wxRibbonToolBar è figlio del pannello, in particolare nell'orientamento verticale dove il numero di righe dipende dalla quantità di spazio orizzontale disponibile. Imposta le righe minime e massime della barra degli strumenti per trarre il massimo vantaggio da questo comportamento di wrapping.

source: Triggered when the user activate the panel extension button.
it: Attivato quando l'utente attiva il pulsante di estensione del pannello.

source: Triggered when the normal (non-dropdown) region of a button on the button bar is clicked.
it: Attivato quando si fa clic sulla regione normale (non a discesa) di un pulsante sulla barra dei pulsanti.

source: Triggered when the dropdown region of a button on the button bar is clicked. wxRibbonButtonBarEvent::PopupMenu() should be called by the event handler if it wants to display a popup menu (which is what most dropdown buttons should be doing).
it: Attivato quando si fa clic sull'area a discesa di un pulsante sulla barra dei pulsanti. wxRibbonButtonBarEvent::PopupMenu() dovrebbe essere chiamato dal gestore di eventi se vuole visualizzare un menu a comparsa (che è ciò che dovrebbe fare la maggior parte dei pulsanti a discesa).

source: Triggered when the normal (non-dropdown) region of a tool on the tool bar is clicked.
it: Attivato quando si fa clic sulla regione normale (non a discesa) di uno strumento sulla barra degli strumenti.

source: Triggered when the dropdown region of a tool on the tool bar is clicked. wxRibbonToolBarEvent::PopupMenu() should be called by the event handler if it wants to display a popup menu (which is what most dropdown tools should be doing).
it: Attivato quando si fa clic sull'area a discesa di uno strumento sulla barra degli strumenti. wxRibbonToolBarEvent::PopupMenu() dovrebbe essere chiamato dal gestore di eventi se vuole visualizzare un menu a comparsa (che è ciò che dovrebbe fare la maggior parte degli strumenti a discesa).

source: Triggered when the user selects an item from the gallery.
it: Attivato quando l'utente seleziona un elemento dalla galleria.

source: Similar to EVT_RIBBONGALLERY_SELECTED but triggered every time a gallery item is clicked, even if it is already selected.
it: Simile a EVT_RIBBONGALLERY_SELECTED ma attivato ogni volta che si fa clic su un elemento della galleria, anche se è già selezionato.

source: Triggered when the item being hovered over by the user changes. The item in the event will be the new item being hovered, or nullptr if there is no longer an item being hovered.
it: Attivato quando l'elemento su cui l'utente passa con il mouse cambia. L'oggetto nell'evento sarà il nuovo oggetto al passaggio del mouse o nullptr se non è più presente un oggetto al passaggio del mouse.

source: Triggered when the extension button of the gallery is pressed.
it: Attivato quando viene premuto il pulsante di estensione della galleria.

source: First Page
it: Prima Pagina

source: Sample Category
it: Categoria Esempio

source: Label
it: Etichetta

source: Initial Value
it: Valore Iniziale

source: A string property
it: Una proprietà stringa

source: Herbivore
it: Erbivoro

source: Carnivore
it: Carnivoro

source: Omnivore
it: Onnivoro

source: Low Priority Properties
it: Proprietà Bassa Priorità

source: This is much longer string than the
it: Questa è una stringa più lunga della

source: first one. Edit it by clicking the button.
it: prima. Modificala premendo il pulsante.
