Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libadditional.po
Languages: it

source: Process a wxEVT_DATAVIEW_ITEM_ACTIVATED event. This event is triggered by double clicking an item or pressing some special key (usually 'Enter') when it is focused.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_ACTIVATED. Questo evento viene attivato facendo doppio clic su un elemento o premendo un tasto speciale (di solito "Invio") quando è attivo.

source: Process a wxEVT_DATAVIEW_ITEM_START_EDITING event. This event can be vetoed in order to prevent editing on an item by item basis.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_START_EDITING. Questo evento può essere posto il veto per evitare modifiche articolo per articolo.

source: Process a wxEVT_DATAVIEW_ITEM_EDITING_STARTED event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_EDITING_STARTED.

source: Process a wxEVT_DATAVIEW_ITEM_EDITING_DONE event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_EDITING_DONE.

source: Process a wxEVT_DATAVIEW_ITEM_COLLAPSING event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_COLLAPSING.

source: Process a wxEVT_DATAVIEW_ITEM_COLLAPSED event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_COLLAPSED.

source: Process a wxEVT_DATAVIEW_ITEM_EXPANDING event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_EXPANDING.

source: Process a wxEVT_DATAVIEW_ITEM_EXPANDED event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_EXPANDED.

source: Process a wxEVT_DATAVIEW_ITEM_VALUE_CHANGED event
it: Elabora un evento wxEVT_DATAVIEW_ITEM_VALUE_CHANGED

source: Process a wxEVT_DATAVIEW_ITEM_CONTEXT_MENU event generated when the user right clicks inside the control. Notice that this menu is generated even if the click didn't occur on any valid item, in this case wxDataViewEvent::GetItem() simply returns an invalid item.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_CONTEXT_MENU generato quando l'utente fa clic con il pulsante destro del mouse all'interno del controllo. Si noti che questo menu viene generato anche se il clic non è avvenuto su alcun elemento valido, in questo caso wxDataViewEvent::GetItem() restituisce semplicemente un elemento non valido.

source: Process a wxEVT_DATAVIEW_COLUMN_HEADER_CLICK event.
it: Elabora un evento wxEVT_DATAVIEW_COLUMN_HEADER_CLICK.

source: Process a wxEVT_DATAVIEW_COLUMN_HEADER_RIGHT_CLICK event. Notice that currently this event is not generated in the native OS X versions of the control.
it: Elabora un evento wxEVT_DATAVIEW_COLUMN_HEADER_RIGHT_CLICK. Si noti che attualmente questo evento non viene generato nelle versioni OS X native del controllo.

source: Process a wxEVT_DATAVIEW_COLUMN_SORTED event.
it: Elabora un evento wxEVT_DATAVIEW_COLUMN_SORTED.

source: Process a wxEVT_DATAVIEW_COLUMN_REORDERED event.
it: Elabora un evento wxEVT_DATAVIEW_COLUMN_REORDERED.

source: Process a wxEVT_DATAVIEW_ITEM_BEGIN_DRAG event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_BEGIN_DRAG.

source: Process a wxEVT_DATAVIEW_ITEM_DROP_POSSIBLE event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_DROP_POSSIBLE.

source: Process a wxEVT_DATAVIEW_ITEM_DROP event.
it: Elabora un evento wxEVT_DATAVIEW_ITEM_DROP.

source: model_column
it: Modello Colonna

source: type
it: Tipo

source: Text
it: Testo

source: Appends a text column to the control and the store.
it: Aggiunge una colonna di testo al controllo e all'archivio.

source: Appends a column for rendering a bitmap.
it: Aggiunge una colonna per il rendering di una bitmap.

source: Date
it: Data

source: Appends a column for rendering a date.
it: Aggiunge una colonna per il rendering di una data.

source: Toggle
it: Commutazione

source: Appends a toggle column to the control and the store.
it: Aggiunge una colonna di commutazione al controllo e all'archivio.

source: Progress
it: Avanzamento

source: Appends a progress column to the control and the store.
it: Aggiunge una colonna di avanzamento al controllo e all'archivio.

source: IconText
it: Icona Testo

source: Appends an icon-and-text column to the control and the store.
it: Aggiunge una colonna icona e testo al controllo e all'archivio.

source: mode
it: Modalità

source: The cell only displays information and cannot be manipulated or otherwise interacted with in any way.
it: La cella visualizza solo informazioni e non può essere manipolata o altrimenti interagita in alcun modo.

source: Indicates that the cell can be activated by clicking it or using keyboard.
it: Indica che la cella può essere attivata facendo clic su di essa o utilizzando la tastiera.

source: Indicates that the user can edit the data in-place in an inline editor control that will show up when the user wants to edit the cell.
it: Indica che l'utente può modificare i dati sul posto in un controllo editor in linea che verrà visualizzato quando l'utente desidera modificare la cella.

source: align
it: Allineamento

source: Align the item to the top.
it: Allinea l'elemento in alto.

source: Align the item to the bottom.
it: Allinea l'elemento in basso.

source: Align the item to the horizontal center.
it: Allinea l'elemento al centro orizzontale.

source: Align the item to the vertical.
it: Allinea l'elemento in verticale.

source: flags
it: Flag

source: Column can be resized.
it: La colonna può essere ridimensionata.

source: Column can be dragged to change its order.
it: La colonna può essere trascinata per cambiarne l'ordine.

source: ellipsize
it: Ellissi

source: Don't ellipsize the text at all.
it: Non inserire ellissi nel testo.

source: Put the ellipsis at the start of the string, if the string needs ellipsization.
it: Metti i puntini di sospensione all'inizio della stringa, se la stringa ha bisogno di ellissi.

source: Put the ellipsis in the middle of the string, if the string needs ellipsization.
it: Metti i puntini di sospensione al centro della stringa, se la stringa ha bisogno di ellissi.

source: Put the ellipsis at the end of the string, if the string needs ellipsization.
it: Metti i puntini di sospensione alla fine della stringa, se la stringa ha bisogno di ellissi.

source: This is the bitmap shown in the default state, it must be always valid while all the other bitmaps are optional and don't have to be set.
it: Questa è la bitmap mostrata nello stato di default, deve essere sempre valida mentre tutte le altre bitmap sono opzionali e non devono essere impostate.

source: This will cause Sort() automatically after an item is added. When inserting a lot of items in this mode, it may make sense to use Freeze() before operations and Thaw() afterwards to increase performance.
it: Ciò causerà Sort() automaticamente dopo l'aggiunta di un elemento. Quando si inseriscono molti elementi in questa modalità, può avere senso utilizzare Freeze() prima delle operazioni e Thaw() in seguito per aumentare le prestazioni.

source: Categories are not initially shown (even if added).
it: Le categorie non vengono inizialmente mostrate (anche se aggiunte).

source: This style combines non-categoric mode and automatic sorting.
it: Questo stile combina la modalità non categorica e l'ordinamento automatico.

source: Modified values are shown in bold font.
it: I valori modificati sono mostrati in grassetto.

source: When wxPropertyGrid is resized, splitter moves to the center. This behaviour stops once the user manually moves the splitter.
it: Quando wxPropertyGrid viene ridimensionato, lo splitter si sposta al centro. Questo comportamento si interrompe quando l'utente sposta manualmente lo splitter.

source: Display tooltips for cell text that cannot be shown completely. If wxUSE_TOOLTIPS is 0, then this doesn't have any effect.
it: Visualizza i suggerimenti per il testo della cella che non può essere mostrato completamente. Se wxUSE_TOOLTIPS è 0, questo non ha alcun effetto.

source: Disables margin and hides all expand/collapse buttons that would appear outside the margin (for sub-properties). Toggling this style automatically expands all collapsed items.
it: Disabilita il margine e nasconde tutti i pulsanti di espansione/compressione che apparirebbero al di fuori del margine (per le sottoproprietà). L'attivazione di questo stile espande automaticamente tutti gli elementi compressi.

source: This style prevents user from moving the splitter.
it: Questo stile impedisce all'utente di spostare lo splitter.

source: Combination of other styles that make it impossible for user to modify the layout.
it: Combinazione di altri stili che rendono impossibile per l'utente modificare il layout.

source: Disables wxTextCtrl based editors for properties which can be edited in another way.
it: Disabilita gli editor basati su wxTextCtrl per le proprietà che possono essere modificate in un altro modo.

source: Combines various styles.
it: Combina vari stili.

source: wxTAB_TRAVERSAL allows using Tab/Shift-Tab to travel between properties in grid. Travelling forwards from last property will navigate to the next control, and backwards from first will navigate to the previous one.
it: wxTAB_TRAVERSAL consente di utilizzare Tab/Shift-Tab per viaggiare tra le proprietà nella griglia. Viaggiando in avanti dall'ultima proprietà si passerà al controllo successivo e all'indietro dal primo si passerà a quello precedente.

source: extra_style
it: Stile Extra

source: Speeds up switching to wxPG_HIDE_CATEGORIES mode. Initially, if wxPG_HIDE_CATEGORIES is not defined, the non-categorized data storage is not activated, and switching the mode first time becomes somewhat slower. wxPG_EX_INIT_NOCAT activates the non-categorized data storage right away. IMPORTANT NOTE: If you do plan not switching to non-categoric mode, or if you don't plan to use categories at all, then using this style will result in waste of resources.
it: Velocizza il passaggio alla modalità wxPG_HIDE_CATEGORIES. Inizialmente, se wxPG_HIDE_CATEGORIES non è definito, l'archiviazione dei dati non classificati non viene attivata e il passaggio alla modalità la prima volta diventa un po' più lento. wxPG_EX_INIT_NOCAT attiva immediatamente l'archiviazione dei dati non classificati. NOTA IMPORTANTE: se si prevede di non passare alla modalità non categorica o se non si prevede di utilizzare affatto le categorie, l'utilizzo di questo stile comporterà uno spreco di risorse.

source: Show property help strings as tool tips instead as text on the status bar.
it: Mostra le stringhe della guida delle proprietà come suggerimenti anziché come testo sulla barra di stato.Consente di fare affidamento sul doppio buffering nativo.

source: Allows relying on native double-buffering.
it: Consente di fare affidamento sul doppio buffering nativo.

source: Set this style to let user have ability to set values of properties to unspecified state. Same as setting wxPG_PROP_AUTO_UNSPECIFIED for all properties.
it: Imposta questo stile per consentire all'utente di impostare i valori delle proprietà su uno stato non specificato. Uguale all'impostazione di wxPG_PROP_AUTO_UNSPECIFIED per tutte le proprietà.

source: If this style is used, built-in attributes (such as wxPG_FLOAT_PRECISION and wxPG_STRING_PASSWORD) are not stored into property's attribute storage (thus they are not readable). Note that this option is global, and applies to all wxPG property containers.
it: Se viene utilizzato questo stile, gli attributi incorporati (come wxPG_FLOAT_PRECISION e wxPG_STRING_PASSWORD) non vengono memorizzati nella memoria degli attributi della proprietà (quindi non sono leggibili). Nota che questa opzione è globale e si applica a tutti i contenitori di proprietà wxPG.

source: Allows multiple properties to be selected by user (by pressing SHIFT when clicking on a property, or by dragging with left mouse button down).
it: Consente all'utente di selezionare più proprietà (premendo MAIUSC quando si fa clic su una proprietà o trascinando con il pulsante sinistro del mouse verso il basso).

source: This enables top-level window tracking which allows wxPropertyGrid to notify the application of last-minute property value changes by user. This style is not enabled by default because it may cause crashes when wxPropertyGrid is used in with wxAUI or similar system. If you are not in fact using any system that may change wxPropertyGrid's top-level parent window on its own, then you are recommended to enable this style.
it: Ciò consente il livello più altomonitoraggio della finestra che consente a wxPropertyGrid di notificare all'applicazione le modifiche del valore della proprietà dell'ultimo minuto da parte dell'utente. Questo stile non è abilitato per impostazione predefinita perché potrebbe causare arresti anomali quando wxPropertyGrid viene utilizzato con wxAUI o un sistema simile. Se in effetti non stai utilizzando alcun sistema che possa modificare da solo la finestra principale di livello superiore di wxPropertyGrid, ti consigliamo di abilitare questo stile.

source: include_advanced
it: Includi Avanzate

source: Include Advanced Properties
it: Includi proprietà avanzate

source: Property value is about to be changed. Use wxPropertyGridEvent::GetValue() to take a peek at the pending value, and wxPropertyGridEvent::Veto() to prevent change from taking place, if necessary.
it: Il valore della proprietà sta per essere modificato. Usa wxPropertyGridEvent::GetValue() per dare un'occhiata al valore in sospeso e wxPropertyGridEvent::Veto() per impedire che avvenga il cambiamento, se necessario.

source: Property value is modified.
it: Il valore della proprietà viene modificato.

source: Show compactor button that toggles hidden state of low-priority properties.
it: Mostra il pulsante del compattatore che attiva o disattiva lo stato nascosto delle proprietà a bassa priorità.

source: Show adjustable text box showing description or help text, if available, for currently selected property.
it: Mostra casella di testo regolabile che mostra la descrizione o il testo della guida, se disponibile, per la proprietà attualmente selezionata.

source: Show toolbar for mode and page selection.
it: Mostra la barra degli strumenti per la selezione della modalità e della pagina.

source: Don't show an internal border around the property grid. Recommended if you use a header.
it: Non mostrare un bordo interno attorno alla griglia delle proprietà. Consigliato se si utilizza un'intestazione.

source: Extended window style that sets wxPropertyGridManager toolbar to not use flat style.
it: Stile della finestra esteso che imposta la barra degli strumenti wxPropertyGridManager in modo che non utilizzi lo stile piatto.

source: Shows alphabetic/categoric mode buttons from toolbar.
it: Mostra i pulsanti della modalità alfabetica/categorica dalla barra degli strumenti.

source: Hides page selection buttons from tool bar.
it: Nasconde i pulsanti di selezione della pagina dalla barra degli strumenti.

source: Don't show divider above toolbar, on Windows.
it: Non mostrare il divisore sopra la barra degli strumenti, su Windows.

source: Show a separator below the toolbar.
it: Mostra un separatore sotto la barra degli strumenti.

source: Instance name.
it: Nome dell'istanza.

source: Label shown as a tooltip of the manager's tool button.
it: Etichetta mostrata come descrizione comando del pulsante degli strumenti del manager.

source: Bitmap shown in the property manager's header.
it: Bitmap mostrato nell'intestazione del gestore di proprietà.

source: Instance name and an internal name of the property item.
it: Nome dell'istanza e un nome interno dell'elemento della proprietà.

source: Label shown in parent property grid/page.
it: Etichetta mostrata nella griglia/pagina della proprietà principale.

source: Type of the property item.
it: Tipo dell'elemento della proprietà.

source: Category
it: Categoria

source: Append properties category.
it: Aggiungi categoria proprietà.

source: Append Boolean property to the parent property grid (page).
it: Aggiungi la proprietà Booleana alla griglia delle proprietà padre (pagina).

source: Colour
it: Colore

source: Append Colour property to the parent property grid (page).
it: Aggiungi la proprietà Colore alla griglia delle proprietà padre (pagina).

source: Cursor
it: Cursore

source: Append Cursor property to the parent property grid (page).
it: Aggiungi la proprietà Cursor alla griglia delle proprietà padre (pagina).

source: Append Date property to the parent property grid (page).
it: Aggiungi la proprietà Date alla griglia delle proprietà padre (pagina).

source: Append Dir property to the parent property grid (page).
it: Aggiungi la proprietà Dir alla griglia delle proprietà padre (pagina).

source: EditEnum
it: Modifica Enum

source: Append EditEnum property to the parent property grid (page).
it: Aggiungi la proprietà EditEnum alla griglia delle proprietà padre (pagina).

source: Append Enum property to the parent property grid (page).
it: Aggiungi la proprietà Enum alla griglia delle proprietà padre (pagina).

source: Append File property to the parent property grid (page).
it: Aggiungi la proprietà File alla griglia delle proprietà padre (pagina).

source: Append Flags property to the parent property grid (page).
it: Aggiungi la proprietà Flags alla griglia delle proprietà padre (pagina).

source: Append Float property to the parent property grid (page).
it: Aggiungi la proprietà Float alla griglia delle proprietà padre (pagina).

source: Append Font property to the parent property grid (page).
it: Aggiungi la proprietà Font alla griglia delle proprietà padre (pagina).

source: Append ImageFile property to the parent property grid (page).
it: Aggiungi la proprietà ImageFile alla griglia delle proprietà padre (pagina).

source: Append Int property to the parent property grid (page).
it: Aggiungi la proprietà Int alla griglia delle proprietà padre (pagina).

source: Append LongString property to the parent property grid (page).
it: Aggiungi la proprietà LongString alla griglia delle proprietà padre (pagina).

source: Append MultiChoice property to the parent property grid (page).
it: Aggiungi la proprietà MultiChoice alla griglia delle proprietà padre (pagina).

source: Append String property to the parent property grid (page).
it: Aggiungi la proprietà String alla griglia delle proprietà padre (pagina).Aggiungi la proprietà SystemColour alla griglia delle proprietà padre (pagina).

source: Append SystemColour property to the parent property grid (page).
it: Aggiungi la proprietà SystemColour alla griglia delle proprietà padre (pagina).

source: Append UInt property to the parent property grid (page).
it: Aggiungi la proprietà UInt alla griglia delle proprietà padre (pagina).

source: help
it: Guida

source: Property item's name.
it: Nome dell'elemento della proprietà.

source: Defined as wxRIBBON_BAR_FLOW_HORIZONTAL | wxRIBBON_BAR_SHOW_PAGE_LABELS | wxRIBBON_BAR_SHOW_PANEL_EXT_BUTTONS | wxRIBBON_BAR_SHOW_TOGGLE_BUTTON | wxRIBBON_BAR_SHOW_HELP_BUTTON.
it: Definito come wxRIBBON_BAR_FLOW_HORIZONTAL | wxRIBBON_BAR_SHOW_PAGE_LABELS | wxRIBBON_BAR_SHOW_PANEL_EXT_BUTTONS | wxRIBBON_BAR_SHOW_TOGGLE_BUTTON | wxRIBBON_BAR_SHOW_HELP_BUTTON.

source: Defined as wxRIBBON_BAR_FLOW_VERTICAL | wxRIBBON_BAR_SHOW_PAGE_ICONS | wxRIBBON_BAR_SHOW_PANEL_EXT_BUTTONS | wxRIBBON_BAR_SHOW_PANEL_MINIMISE_BUTTONS.
it: Definito come wxRIBBON_BAR_FLOW_VERTICAL | wxRIBBON_BAR_SHOW_PAGE_ICONS | wxRIBBON_BAR_SHOW_PANEL_EXT_BUTTONS | wxRIBBON_BAR_SHOW_PANEL_MINIMISE_BUTTONS.

source: Causes labels to be shown on the tabs in the ribbon bar.
it: Fa in modo che le etichette vengano visualizzate sulle schede della barra multifunzione.

source: Causes icons to be shown on the tabs in the ribbon bar.
it: Fa in modo che le icone vengano visualizzate nelle schede della barra multifunzione.

source: Causes panels within pages to stack horizontally.
it: Fa sì che i pannelli all'interno delle pagine vengano impilati orizzontalmente.

source: Causes panels within pages to stack vertically.
it: Fa sì che i pannelli all'interno delle pagine vengano impilati verticalmente.

source: Causes extension buttons to be shown on panels (where the panel has such a button).
it: Fa in modo che i pulsanti di estensione vengano visualizzati sui pannelli (dove il pannello ha tale pulsante).

source: Causes minimise buttons to be shown on panels (where the panel has such a button).
it: Fa in modo che i pulsanti di riduzione a icona vengano visualizzati sui pannelli (dove il pannello ha un tale pulsante).

source: Causes a toggle button to appear on the ribbon bar at top-right corner.
it: Fa apparire un pulsante di attivazione/disattivazione sulla barra multifunzione nell'angolo in alto a destra.

source: Causes a help button to appear on the ribbon bar at the top-right corner.
it: Fa apparire un pulsante di aiuto sulla barra multifunzione nell'angolo in alto a destra.

source: theme
it: Tema

source: Select the RibbonBar theme.
it: Seleziona il tema della barra multifunzione.

source: Default
it: Predefinito

source: Use Default theme.
it: Usa il tema predefinito.

source: Generic
it: Generico

source: Use Generic theme.
it: Usa il tema generico.

source: Use MSW theme.
it: Usa il tema MSW.

source: Triggered after the transition from one page being active to a different page being active.
it: Attivato dopo la transizione da una pagina attiva a un'altra pagina attiva.

source: Triggered prior to the transition from one page being active to a different page being active, and can veto the change.
it: Attivato prima del passaggio da una pagina attiva a un'altra pagina attiva e può porre il veto alla modifica.

source: Triggered when the middle mouse button is pressed on a tab.
it: Attivato quando si preme il pulsante centrale del mouse su una scheda.

source: Triggered when the middle mouse button is released on a tab.
it: Attivato quando si rilascia il pulsante centrale del mouse su una scheda.

source: Triggered when the right mouse button is pressed on a tab.
it: Attivato quando si preme il pulsante destro del mouse su una scheda.

source: Triggered when the right mouse button is released on a tab.
it: Attivato quando viene rilasciato il pulsante destro del mouse su una scheda.

source: Triggered when the left mouse button is double clicked on a tab.
it: Attivato quando si fa doppio clic con il pulsante sinistro del mouse su una scheda.

source: Triggered when the button triggering the ribbon bar is clicked.
it: Attivato quando si fa clic sul pulsante che attiva la barra multifunzione.

source: Triggered when the help button is clicked.
it: Attivato quando si fa clic sul pulsante della guida.

source: select
it: Seleziona

source: Select this ribbon page when adding.
it: Seleziona questa pagina della barra multifunzione durante l'aggiunta.

source: Defined as no other flags set.
it: Definito come nessun altro flag impostato.

source: Prevents the panel from automatically minimising to conserve screen space.
it: Impedisce al pannello di ridurre automaticamente a icona per risparmiare spazio sullo schermo.

source: Causes an extension button to be shown in the panel's chrome (if the bar in which it is contained has wxRIBBON_BAR_SHOW_PANEL_EXT_BUTTONS set). The behaviour of this button is application controlled, but typically will show an extended drop-down menu relating to the panel.
it: Fa sì che un pulsante di estensione venga mostrato nel chrome del pannello (se la barra in cui è contenuto ha wxRIBBON_BAR_SHOW_PANEL_EXT_BUTTONS impostato). Il comportamento di questo pulsante è controllato dall'applicazione, ma in genere mostrerà un menu a discesa esteso relativo al pannello.
