Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libadditional.po
Languages: it

source: Automatically sizes all columns to fit their contents. wxGrid sets up arrays to store individual row and column sizes when non-default sizes are used. The memory requirements for this could become prohibitive if your grid is very large.
it: Ridimensiona automaticamente tutte le colonne per adattarle al loro contenuto. wxGrid imposta gli array per memorizzare le dimensioni di singole righe e colonne quando vengono utilizzate dimensioni non predefinite. I requisiti di memoria per questo potrebbero diventare proibitivi se la tua griglia è molto grande.

source: drag_col_move
it: Sposta Colonne

source: Allow moving columns by dragging.
it: Consenti lo spostamento delle colonne trascinandole.

source: drag_col_size
it: Ridimensiona Colonne

source: Allow sizing columns by dragging.
it: Consenti il ​​ridimensionamento delle colonne trascinando il bordo.

source: col_label_size
it: Altezza Etichette Colonne

source: Height of column labels
it: Altezza delle etichette delle colonne

source: If height equals to wxGRID_AUTOSIZE then height is calculated automatically so that no label is truncated. Note that this could be slow for a large table.
it: Se l'altezza è uguale a wxGRID_AUTOSIZE, l'altezza viene calcolata automaticamente in modo che nessuna etichetta venga troncata. Nota che questo potrebbe essere lento per un tavolo grande.

source: col_label_values
it: Valori Etichette Colonne

source: List of column labels.
it: Elenco delle etichette delle colonne.

source: col_label_horiz_alignment
it: Allinea Etichette Col. Orizz.

source: Horizontal alignment of column label text.
it: Allineamento orizzontale del testo dell'etichetta di colonna.

source: Align labels left.
it: Allinea le etichette a sinistra.

source: Align labels centered.
it: Allinea le etichette al centro.

source: Align labels right.
it: Allinea le etichette a destra.

source: col_label_vert_alignment
it: Allinea Etichette Col. Vert.

source: Vertical alignment of column label text.
it: Allineamento verticale del testo dell'etichetta di colonna.

source: Align labels top.
it: Allineare le etichette in alto.

source: Align labels bottom.
it: Allineare le etichette in basso.

source: Rows
it: Righe

source: row_sizes
it: Dimensione Righe

source: Comma separated list of row sizes. Note: wxGrid sets up arrays to store individual row and column sizes when non-default sizes are used. The memory requirements for this could become prohibitive if your grid is very large.
it: Elenco separato da virgole delle dimensioni delle righe. Nota: wxGrid imposta gli array per memorizzare le dimensioni di singole righe e colonne quando vengono utilizzate dimensioni non predefinite. I requisiti di memoria per questo potrebbero diventare proibitivi se la tua griglia è molto grande.

source: autosize_rows
it: Dimensione Righe Auto

source: Automatically sizes all rows to fit their contents. wxGrid sets up arrays to store individual row and column sizes when non-default sizes are used. The memory requirements for this could become prohibitive if your grid is very large.
it: Ridimensiona automaticamente tutte le righe per adattarle al loro contenuto. wxGrid imposta gli array per memorizzare le dimensioni di singole righe e colonne quando vengono utilizzate dimensioni non predefinite. I requisiti di memoria per questo potrebbero diventare proibitivi se la tua griglia è molto grande.

source: drag_row_size
it: Ridimensiona Righe

source: Allow sizing rows by dragging.
it: Consenti il ​​ridimensionamento delle righe trascinandole.

source: row_label_size
it: Larghezza Etichette Riga

source: Width of row labels
it: Larghezza delle etichette di riga

source: If height equals to wxGRID_AUTOSIZE then width is calculated automatically so that no label is truncated. Note that this could be slow for a large table.
it: Se l'altezza è uguale a wxGRID_AUTOSIZE, la larghezza viene calcolata automaticamente in modo che nessuna etichetta venga troncata. Nota che questo potrebbe essere lento per un tavolo grande.

source: row_label_values
it: Valori Etichette Righe

source: List of row labels.
it: Elenco delle etichette di riga.

source: row_label_horiz_alignment
it: Allinea Etichette Righe Orizz.

source: Horizontal alignment of row label text.
it: Allineamento orizzontale del testo dell'etichetta di riga.

source: row_label_vert_alignment
it: Allinea Etichette Righe Vert.

source: Vertical alignment of row label text.
it: Allineamento verticale del testo dell'etichetta di riga.

source: Label Appearance
it: Aspetto Etichette

source: label_bg
it: Etichetta Sfondo

source: Background color for row and column labels.
it: Colore di sfondo per le etichette di righe e colonne.

source: label_font
it: Carattere Etichette

source: Font for row and column labels.
it: Carattere per etichette di righe e colonne.

source: label_text
it: Carattere Testo

source: Colour for row and column label text.
it: Colore per il testo dell'etichetta di riga e colonna.

source: Cell Defaults
it: Impostazioni Cella Predefinite

source: cell_bg
it: Colore Sfondo Celle

source: Default cell background color.
it: Colore di sfondo della cella predefinito.

source: cell_font
it: Carattere Cella

source: Default cell font.
it: Carattere di cella predefinito.

source: cell_text
it: Colore Testo Cella

source: Default cell text color.
it: Colore del testo della cella predefinito.

source: cell_horiz_alignment
it: Allinea Celle Orizzontalmente

source: Default horizontal alignment of cell values.
it: Allineamento orizzontale predefinito dei valori delle celle.

source: Align left.
it: Allineare a sinistra.

source: Align centered.
it: Allinea al centro.

source: Align right.
it: Allinea a destra.

source: cell_vert_alignment
it: Allinea Celle Verticalmente

source: Default vertical alignment of cell values.
it: Allineamento verticale predefinito dei valori delle celle.

source: Align top.
it: Allinea in alto.

source: Align bottom.
it: Allinea in basso.

source: The user clicked a cell with the left mouse button. Processes a wxEVT_GRID_CELL_LEFT_CLICK.
it: L'utente ha fatto clic su una cella con il tasto sinistro del mouse. Elabora un wxEVT_GRID_CELL_LEFT_CLICK.

source: The user clicked a cell with the right mouse button. Processes a wxEVT_GRID_CELL_RIGHT_CLICK.
it: L'utente ha fatto clic su una cella con il tasto destro del mouse. Elabora un wxEVT_GRID_CELL_RIGHT_CLICK.

source: The user double-clicked a cell with the left mouse button. Processes a wxEVT_GRID_CELL_LEFT_DCLICK.
it: L'utente ha fatto doppio clic su una cella con il tasto sinistro del mouse. Elabora un wxEVT_GRID_CELL_LEFT_DCLICK.

source: The user double-clicked a cell with the right mouse button. Processes a wxEVT_GRID_CELL_RIGHT_DCLICK.
it: L'utente ha fatto doppio clic su una cella con il tasto destro del mouse. Elabora un wxEVT_GRID_CELL_RIGHT_DCLICK.

source: The user clicked a label with the left mouse button. Processes a wxEVT_GRID_LABEL_LEFT_CLICK.
it: L'utente ha fatto clic su un'etichetta con il tasto sinistro del mouse. Elabora un wxEVT_GRID_LABEL_LEFT_CLICK.

source: The user clicked a label with the right mouse button. Processes a wxEVT_GRID_LABEL_RIGHT_CLICK.
it: L'utente ha fatto clic su un'etichetta con il tasto destro del mouse. Elabora un wxEVT_GRID_LABEL_RIGHT_CLICK.

source: The user double-clicked a label with the left mouse button. Processes a wxEVT_GRID_LABEL_LEFT_DCLICK.
it: L'utente ha fatto doppio clic su un'etichetta con il tasto sinistro del mouse. Elabora un wxEVT_GRID_LABEL_LEFT_DCLICK.

source: The user double-clicked a label with the right mouse button. Processes a wxEVT_GRID_LABEL_RIGHT_DCLICK.
it: L'utente ha fatto doppio clic su un'etichetta con il tasto destro del mouse. Elabora un wxEVT_GRID_LABEL_RIGHT_DCLICK.

source: The user changed the data in a cell. Processes a wxEVT_GRID_CELL_CHANGED.
it: L'utente ha modificato i dati in una cella. Elabora un wxEVT_GRID_CELL_CHANGED.

source: The user moved to, and selected a cell. Processes a wxEVT_GRID_SELECT_CELL.
it: L'utente si è spostato e ha selezionato una cella. Elabora un wxEVT_GRID_SELECT_CELL.

source: The editor for a cell was hidden. Processes a wxEVT_GRID_EDITOR_HIDDEN.
it: L'editor di una cella era nascosto. Elabora un wxEVT_GRID_EDITOR_HIDDEN.

source: The editor for a cell was shown. Processes a wxEVT_GRID_EDITOR_SHOWN.
it: È stato mostrato l'editor per una cella. Elabora un wxEVT_GRID_EDITOR_SHOWN.

source: The user clicked a cell with the left mouse button; variant taking a window identifier. Processes a wxEVT_GRID_CELL_LEFT_CLICK.
it: L'utente ha cliccato su una cella con il tasto sinistro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_CELL_LEFT_CLICK.

source: The user clicked a cell with the right mouse button; variant taking a window identifier. Processes a wxEVT_GRID_CELL_RIGHT_CLICK.
it: L'utente ha cliccato su una cella con il tasto destro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_CELL_RIGHT_CLICK.

source: The user double-clicked a cell with the left mouse button; variant taking a window identifier. Processes a wxEVT_GRID_CELL_LEFT_DCLICK.
it: L'utente ha fatto doppio clic su una cella con il tasto sinistro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_CELL_LEFT_DCLICK.

source: The user double-clicked a cell with the right mouse button; variant taking a window identifier. Processes a wxEVT_GRID_CELL_RIGHT_DCLICK.
it: L'utente ha fatto doppio clic su una cella con il tasto destro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_CELL_RIGHT_DCLICK.

source: The user clicked a label with the left mouse button; variant taking a window identifier. Processes a wxEVT_GRID_LABEL_LEFT_CLICK
it: L'utente ha cliccato su un'etichetta con il tasto sinistro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_LABEL_LEFT_CLICK

source: The user clicked a label with the right mouse button; variant taking a window identifier. Processes a wxEVT_GRID_LABEL_RIGHT_CLICK.
it: L'utente ha cliccato un'etichetta con il tasto destro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_LABEL_RIGHT_CLICK.

source: The user double-clicked a label with the left mouse button; variant taking a window identifier. Processes a wxEVT_GRID_LABEL_LEFT_DCLICK.
it: L'utente ha fatto doppio clic su un'etichetta con il tasto sinistro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_LABEL_LEFT_DCLICK.

source: The user double-clicked a label with the right mouse button; variant taking a window identifier. Processes a wxEVT_GRID_LABEL_RIGHT_DCLICK.
it: L'utente ha fatto doppio clic su un'etichetta con il tasto destro del mouse; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_LABEL_RIGHT_DCLICK.

source: The user changed the data in a cell; variant taking a window identifier. Processes a wxEVT_GRID_CELL_CHANGED.
it: L'utente ha modificato i dati in una cella; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_CELL_CHANGED.

source: The user moved to, and selected a cell; variant taking a window identifier. Processes a wxEVT_GRID_SELECT_CELL.
it: L'utente si è spostato e ha selezionato una cella; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_SELECT_CELL.

source: The editor for a cell was hidden; variant taking a window identifier. Processes a wxEVT_GRID_EDITOR_HIDDEN.
it: L'editor di una cella era nascosto; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_EDITOR_HIDDEN.

source: The editor for a cell was shown; variant taking a window identifier. Processes a wxEVT_GRID_EDITOR_SHOWN.
it: È stato mostrato l'editor per una cella; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_EDITOR_SHOWN.

source: The user resized a column by dragging it. Processes a wxEVT_GRID_COL_SIZE.
it: L'utente ha ridimensionato una colonna trascinandola. Elabora un wxEVT_GRID_COL_SIZE.

source: The user resized a row by dragging it. Processes a wxEVT_GRID_ROW_SIZE.
it: L'utente ha ridimensionato una riga trascinandola. Elabora un wxEVT_GRID_ROW_SIZE.

source: The user resized a column by dragging it; variant taking a window identifier. Processes a wxEVT_GRID_COL_SIZE.
it: L'utente ha ridimensionato una colonna trascinandola; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_COL_SIZE.

source: The user resized a row by dragging it; variant taking a window identifier. Processes a wxEVT_GRID_ROW_SIZE.
it: L'utente ha ridimensionato una riga trascinandola; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_ROW_SIZE.

source: The user selected a group of contiguous cells. Processes a wxEVT_GRID_RANGE_SELECT.
it: L'utente ha selezionato un gruppo di celle contigue. Elabora un wxEVT_GRID_RANGE_SELECT.

source: The user selected a group of contiguous cells; variant taking a window identifier. Processes a wxEVT_GRID_RANGE_SELECT.
it: L'utente ha selezionato un gruppo di celle contigue; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_RANGE_SELECT.

source: The editor for a cell was created. Processes a wxEVT_GRID_EDITOR_CREATED.
it: L'editor per una cella è stato creato. Elabora un wxEVT_GRID_EDITOR_CREATED.

source: The editor for a cell was created; variant taking a window identifier. Processes a wxEVT_GRID_EDITOR_CREATED.
it: È stato creato l'editor per una cella; variante che prende un identificatore di finestra. Elabora un wxEVT_GRID_EDITOR_CREATED.

source: Single-selection list.
it: Elenco a selezione singola.

source: Multiple-selection list: the user can toggle multiple items on and off.
it: Elenco a selezione multipla: l'utente può attivare e disattivare più elementi.

source: Extended-selection list: the user can select multiple items using the SHIFT key and the mouse or special key combinations.
it: Elenco di selezione esteso: l'utente può selezionare più elementi utilizzando il tasto SHIFT e il mouse o combinazioni di tasti speciali.

source: Create horizontal scrollbar if contents are too wide (Windows only).
it: Crea una barra di scorrimento orizzontale se i contenuti sono troppo larghi (solo Windows).

source: Always show a vertical scrollbar.
it: Mostra sempre una barra di scorrimento verticale.

source: Only create a vertical scrollbar if needed.
it: Crea una barra di scorrimento verticale solo se necessario.

source: Don't create vertical scrollbar (wxMSW only).
it: Non creare una barra di scorrimento verticale (solo wxMSW).

source: The listbox contents are sorted in alphabetical order.
it: I contenuti della casella di riepilogo sono ordinati in ordine alfabetico.

source: choices
it: Scelte

source: List of default values.
it: Elenco dei valori predefiniti.

source: Process a wxEVT_COMMAND_CHECKLISTBOX_TOGGLED event, when an item in the check list box is checked or unchecked.
it: Elabora un evento wxEVT_COMMAND_CHECKLISTBOX_TOGGLED, quando un elemento nella casella della lista di controllo è selezionato o deselezionato.

source: Process a wxEVT_COMMAND_LISTBOX_SELECTED event, when an item on the list is selected.
it: Elabora un evento wxEVT_COMMAND_LISTBOX_SELECTED, quando viene selezionato un elemento nell'elenco.

source: Process a wxEVT_COMMAND_LISTBOX_DOUBLECLICKED event, when the listbox is double-clicked.
it: Elabora un evento wxEVT_COMMAND_LISTBOX_DOUBLECLICKED, quando si fa doppio clic sulla casella di riepilogo.

source: Single selection, this is the default.
it: Selezione singola, questa è l'impostazione predefinita.

source: Allow multiple selection.
it: Consenti selezione multipla.

source: Show the usual, 2 state, checkboxes for the items in the first column.
it: Mostra le solite caselle di controllo a 2 stati per gli elementi nella prima colonna.

source: Show the checkboxes that can possibly be set by the program, but not the user, to a third, undetermined, state, for the items in the first column. Implies wxTL_CHECKBOX.
it: Mostra le caselle di controllo che possono essere eventualmente impostate dal programma, ma non dall'utente, a un terzo stato, indeterminato, per gli elementi nella prima colonna. Implica wxTL_CHECKBOX.

source: Same as wxTL_3STATE but the user can also set the checkboxes to the undetermined state. Implies wxTL_3STATE.
it: Uguale a wxTL_3STATE ma l'utente può anche impostare le caselle di controllo sullo stato indeterminato. Implica wxTL_3STATE.

source: Style used by the control by default, just wxTL_SINGLE currently.
it: Stile utilizzato dal controllo per impostazione predefinita, attualmente solo wxTL_SINGLE.

source: Process wxEVT_TREELIST_SELECTION_CHANGED event and notifies about the selection change in the control. In the single selection case the item indicated by the event has been selected and previously selected item, if any, was deselected. In multiple selection case, the selection of this item has just changed (it may have been either selected or deselected) but notice that the selection of other items could have changed as well, use wxTreeListCtrl::GetSelections() to retrieve the new selection if necessary.
it: Elabora l'evento wxEVT_TREELIST_SELECTION_CHANGED e notifica la modifica della selezione nel controllo. Nel caso di selezione singola è stato selezionato l'elemento indicato dall'evento e l'eventuale elemento precedentemente selezionato è stato deselezionato. In caso di selezione multipla, la selezione di questo elemento è appena cambiata (potrebbe essere stata selezionata o deselezionata) ma nota che anche la selezione di altri elementi potrebbe essere cambiata, usa wxTreeListCtrl::GetSelections() per recuperare la nuova selezione se necessario.

source: Process wxEVT_TREELIST_ITEM_EXPANDING event notifying about the given branch being expanded. This event is sent before the expansion occurs and can be vetoed to prevent it from happening.
it: Elabora l'evento wxEVT_TREELIST_ITEM_EXPANDING che notifica l'espansione del ramo specificato. Questo evento viene inviato prima che si verifichi l'espansione e può essere posto il veto per evitare che si verifichi.

source: Process wxEVT_TREELIST_ITEM_EXPANDED event notifying about the expansion of the given branch. This event is sent after the expansion occurs and can't be vetoed.
it: Elabora l'evento wxEVT_TREELIST_ITEM_EXPANDED che notifica l'espansione del ramo dato. Questo evento viene inviato dopo l'espansione e non può essere posto il veto.

source: Process wxEVT_TREELIST_ITEM_CHECKED event notifying about the user checking or unchecking the item. You can use wxTreeListCtrl::GetCheckedState() to retrieve the new item state and wxTreeListEvent::GetOldCheckedState() to get the previous one.
it: Elabora l'evento wxEVT_TREELIST_ITEM_CHECKED che notifica all'utente che sta controllando o deselezionando l'elemento. Puoi usare wxTreeListCtrl::GetCheckedState() per recuperare il nuovo stato dell'elemento e wxTreeListEvent::GetOldCheckedState() per ottenere quello precedente.

source: Process wxEVT_TREELIST_ITEM_ACTIVATED event notifying about the user double clicking the item or activating it from keyboard.
it: Elabora l'evento wxEVT_TREELIST_ITEM_ACTIVATED che notifica all'utente che fa doppio clic sull'elemento o lo attiva dalla tastiera.

source: Process wxEVT_TREELIST_ITEM_CONTEXT_MENU event indicating that the popup menu for the given item should be displayed.
it: Elabora l'evento wxEVT_TREELIST_ITEM_CONTEXT_MENU che indica che il menu a comparsa per l'elemento dato dovrebbe essere visualizzato.

source: Process wxEVT_TREELIST_COLUMN_SORTED event indicating that the control contents has just been resorted using the specified column. The event doesn't carry the sort direction, use GetSortColumn() method if you need to know it.
it: Elabora l'evento wxEVT_TREELIST_COLUMN_SORTED che indica che il contenuto del controllo è stato appena riorganizzato utilizzando la colonna specificata. L'evento non porta la direzione di ordinamento, usa il metodo GetSortColumn() se hai bisogno di saperlo.

source: The column label.
it: L'etichetta della colonna.

source: width
it: Larghezza

source: The width of the column in pixels or the special wxCOL_WIDTH_AUTOSIZE value indicating that the column should adjust to its contents. Notice that the first column is special and will be always resized to fill all the space not taken by the other columns, i.e. the width specified here is ignored for it.
it: La larghezza della colonna in pixel o il valore speciale wxCOL_WIDTH_AUTOSIZE che indica che la colonna deve adattarsi al suo contenuto. Si noti che la prima colonna è speciale e verrà sempre ridimensionata per riempire tutto lo spazio non occupato dalle altre colonne, ovvero la larghezza specificata qui viene ignorata.

source: Special value used for column width meaning unspecified or default.
it: Valore speciale utilizzato per la larghezza della colonna che significa non specificato o predefinito.

source: Size the column automatically to fit all values. Note: On OS X, this style is only implemented in the Cocoa build on OS X &gt;= 10.5; it behaves identically to wxCOL_WIDTH_DEFAULT otherwise.
it: Ridimensiona automaticamente la colonna per adattarla a tutti i valori. Nota: su OS X, questo stile è implementato solo nella build Cocoa su OS X &gt;= 10.5; altrimenti si comporta in modo identico a wxCOL_WIDTH_DEFAULT.

source: alignment
it: Allineamento

source: Alignment of both the column header and its items.
it: Allineamento sia dell'intestazione di colonna che dei suoi elementi.

source: Align the item to the left.
it: Allinea l'elemento a sinistra.

source: Align the item to the right.
it: Allinea l'elemento a destra.

source: Align the item to the center.
it: Allinea l'oggetto al centro.

source: Column can be resized (included in default flags).
it: La colonna può essere ridimensionata (inclusa nei flag predefiniti).

source: Column can be clicked to toggle the sort order by its contents.
it: È possibile fare clic sulla colonna per alternare l'ordinamento in base al suo contenuto.

source: Column can be dragged to change its order (included in default).
it: La colonna può essere trascinata per cambiarne l'ordine (incluso per predefinizione).

source: Column is not shown at all.
it: La colonna non viene mostrata affatto.

source: Single selection mode. This is the default.
it: Modalità di selezione singola. Questa è l'impostazione predefinita.

source: Multiple selection mode.
it: Modalità di selezione multipla.

source: Use alternating colours for rows if supported by platform and theme. Currently only supported by the native GTK and OS X implementations but not by the generic one.
it: Usa colori alternati per le righe se supportato dalla piattaforma e dal tema. Attualmente supportato solo dalle implementazioni native GTK e OS X ma non da quella generica.

source: Display the separator lines between rows
it: Visualizza le linee di separazione tra le righe

source: Display the separator lines between columns.
it: Visualizza le linee di separazione tra le colonne.

source: Allow variable line heights. This can be inefficient when displaying large number of items.
it: Consenti altezze di linea variabili. Questo può essere inefficiente quando si visualizza un numero elevato di elementi.

source: Do not show column headers (which are shown by default).
it: Non mostrare le intestazioni di colonna (che sono mostrate per impostazione predefinita).

source: Process a wxEVT_DATAVIEW_SELECTION_CHANGED event.
it: Elabora un evento wxEVT_DATAVIEW_SELECTION_CHANGED.
