Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libadditional.po
Languages: it

source: Additional
it: Aggiuntivi

source: wxWidgets additional controls
it: Controlli aggiuntivi

source: name
it: Nome

source: style
it: Stile

source: Never display scrollbars, not even when the page is larger than the window.
it: Non visualizzare mai le barre di scorrimento, nemmeno quando la pagina è più larga della finestra.

source: Display scrollbars only if page's size exceeds window's size.
it: Visualizza le barre di scorrimento solo se la dimensione della pagina supera la dimensione della finestra.

source: Don't allow the user to select text.
it: Impedisce la selezione del testo.

source: A wxHtmlCell was clicked.
it: Una wxHtmlCell è stata cliccata.

source: The mouse passed over a wxHtmlCell.
it: Il mouse è passato su una wxHtmlCell.

source: A wxHtmlCell which contains an hyperlink was clicked.
it: Una wxHtmlCell contenente un collegamento ipertestuale è stata cliccata.

source: window_style
it: Stile

source: The control will generate the event wxEVT_COMMAND_TEXT_ENTER (otherwise pressing Enter key is either processed internally by the control or used for navigation between dialog controls).
it: Il controllo genererà l'evento wxEVT_COMMAND_TEXT_ENTER (altrimenti la pressione del tasto Invio viene elaborata internamente dal controllo o utilizzata per la navigazione tra i controlli di dialogo).

source: The control will receive wxEVT_CHAR events for TAB pressed - normally, TAB is used for passing to the next control in a dialog instead. For the control created with this style, you can still use Ctrl-Enter to pass to the next control from the keyboard.
it: Il controllo riceverà eventi wxEVT_CHAR per TAB premuto - normalmente, TAB viene invece utilizzato per passare al controllo successivo in una finestra di dialogo. Per il controllo creato con questo stile, puoi comunque usare Ctrl-Invio per passare al controllo successivo dalla tastiera.

source: The text will not be user-editable.
it: Il testo non sarà modificabile dall'utente.

source: Highlight the URLs and generate the wxTextUrl events when mouse events occur over them.
it: Evidenzia gli URL e genera gli eventi wxTextUrl quando si verificano eventi del mouse su di essi.

source: value
it: Valore

source: Respond to a wxEVT_COMMAND_TEXT_UPDATED event, generated when the text changes. Notice that this event will always be sent when the text controls contents changes - whether this is due to user input or comes from the program itself (for example, if SetValue() is called)
it: Rispondi a un evento wxEVT_COMMAND_TEXT_UPDATED, generato quando il testo cambia. Nota che questo evento verrà sempre inviato quando il testo controlla le modifiche al contenuto, sia che ciò sia dovuto all'input dell'utente o provenga dal programma stesso (ad esempio, se viene chiamato SetValue())

source: Respond to a wxEVT_COMMAND_TEXT_ENTER event, generated when enter is pressed in a text control (which must have wxTE_PROCESS_ENTER style for this event to be generated).
it: Risponde a un evento wxEVT_COMMAND_TEXT_ENTER, generato quando si preme invio in un controllo di testo (che deve avere lo stile wxTE_PROCESS_ENTER per generare questo evento).

source: A mouse event occurred over an URL in the text control (wxMSW and wxGTK2 only)
it: Si è verificato un evento del mouse su un URL nel controllo di testo (solo wxMSW e wxGTK2)

source: User tried to enter more text into the control than the limit set by SetMaxLength.
it: L'utente ha tentato di immettere più testo nel controllo rispetto al limite impostato da SetMaxLength.

source: Process a wxEVT_COMMAND_RICHTEXT_CHARACTER event, generated when the user presses a character key. Valid event functions: GetFlags, GetPosition, GetCharacter.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_CHARACTER, generato quando l'utente preme un tasto carattere. Funzioni evento valide: GetFlags, GetPosition, GetCharacter.

source: Process a wxEVT_COMMAND_RICHTEXT_DELETE event, generated when the user presses the backspace or delete key. Valid event functions: GetFlags, GetPosition.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_DELETE, generato quando l'utente preme il tasto backspace o cancella. Funzioni evento valide: GetFlags, GetPosition.

source: Process a wxEVT_COMMAND_RICHTEXT_RETURN event, generated when the user presses the return key. Valid event functions: GetFlags, GetPosition.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_RETURN, generato quando l'utente preme il tasto Invio. Funzioni evento valide: GetFlags, GetPosition.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLE_CHANGED event, generated when styling has been applied to the control. Valid event functions: GetPosition, GetRange.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_STYLE_CHANGED, generato quando lo stile è stato applicato al controllo. Funzioni evento valide: GetPosition, GetRange.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_CHANGING event, generated when the control's stylesheet has changed, for example the user added, edited or deleted a style. Valid event functions: GetRange, GetPosition.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_STYLESHEET_CHANGING, generato quando il foglio di stile del controllo è cambiato, per esempio l'utente ha aggiunto, modificato o cancellato uno stile. Funzioni evento valide: GetRange, GetPosition.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACING event, generated when the control's stylesheet is about to be replaced, for example when a file is loaded into the control. Valid event functions: Veto, GetOldStyleSheet, GetNewStyleSheet.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACING, generato quando il foglio di stile del controllo sta per essere sostituito, ad esempio quando un file viene caricato nel controllo. Funzioni evento valide: Veto, GetOldStyleSheet, GetNewStyleSheet.

source: Process a wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACED event, generated when the control's stylesheet has been replaced, for example when a file is loaded into the control. Valid event functions: GetOldStyleSheet, GetNewStyleSheet.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_STYLESHEET_REPLACED, generato quando il foglio di stile del controllo è stato sostituito, ad esempio quando un file viene caricato nel controllo. Funzioni evento valide: GetOldStyleSheet, GetNewStyleSheet.

source: Process a wxEVT_COMMAND_RICHTEXT_CONTENT_INSERTED event, generated when content has been inserted into the control. Valid event functions: GetPosition, GetRange.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_CONTENT_INSERTED, generato quando il contenuto è stato inserito nel controllo. Funzioni evento valide: GetPosition, GetRange.

source: Process a wxEVT_COMMAND_RICHTEXT_CONTENT_DELETED event, generated when content has been deleted from the control. Valid event functions: GetPosition, GetRange.
it: Elabora un evento wxEVT_COMMAND_RICHTEXT_CONTENT_DELETED, generato quando il contenuto è stato eliminato dal controllo. Funzioni evento valide: GetPosition, GetRange.

source: folding
it: Piegatura

source: Enable folding.
it: Abilita piegatura.

source: line_numbers
it: Numeri Riga.

source: Show line numbers.
it: Mostra i numeri di riga.

source: indentation_guides
it: Guide Rientro

source: Show indentation guides.
it: Mostra le guide al rientro.

source: tab_indents
it: Tab Rientra

source: The tab key always indents, use tabs or spaces, instead of always inserting a tab character.
it: Il tasto TAB rientra sempre, usa tabulazioni o spazi, invece di inserire sempre un carattere di tabulazione.

source: backspace_unindents
it: Backspace Annulla Rientro

source: The backspace key unindents, instead of just deleting one space.
it: Il tasto backspace annulla il rientro, invece di eliminare solo uno spazio.

source: view_eol
it: Visualizza EOL

source: Show end of line characters.
it: Mostra caratteri di fine riga.

source: view_whitespace
it: Visualizza Spazi Bianchi

source: Show whitespace characters.
it: Mostra caratteri spazi bianchi.

source: use_tabs
it: Usa Tabulazioni

source: Use tabs for indenting, instead of spaces.
it: Usa le tabulazioni per il rientro, invece degli spazi.

source: tab_width
it: Larghezza Tabulazione

source: The number of spaces per tab character.
it: Il numero di spazi per carattere di tabulazione.

source: read_only
it: Sola Lettura

source: Set ReadOnly Mode. Disable editing.
it: Imposta la modalità di sola lettura. Disabilita la modifica.

source: Handles a wxEVT_TOGGLEBUTTON event.
it: Gestisce un evento wxEVT_TOGGLEBUTTON.

source: By default, the Windows text control doesn't show the selection when it doesn't have focus - use this style to force it to always show it. It doesn't do anything under other platforms.
it: Per impostazione predefinita, il controllo di testo di Windows non mostra la selezione quando non ha lo stato attivo: usa questo stile per forzarlo a mostrarlo sempre. Non fa nulla su altre piattaforme.

source: The text in the control will be left-justified (default).
it: Il testo nel controllo sarà giustificato a sinistra (impostazione predefinita).

source: The text in the control will be centered (currently wxMSW and wxGTK2 only).
it: Il testo nel controllo sarà centrato (attualmente solo wxMSW e wxGTK2).

source: The text in the control will be right-justified (currently wxMSW and wxGTK2 only).
it: Il testo nel controllo sarà giustificato a destra (attualmente solo wxMSW e wxGTK2).

source: On PocketPC and Smartphone, causes the first letter to be capitalized.
it: Su PocketPC e Smartphone, fa sì che la prima lettera sia maiuscola.

source: search_button
it: Pulsante Cerca

source: Shows or hides the search button.
it: Mostra o nasconde il pulsante di ricerca.

source: cancel_button
it: Pulsante Annulla

source: Shows or hides the cancel button.
it: Mostra o nasconde il pulsante Annulla.

source: Respond to a wxEVT_SEARCHCTRL_SEARCH_BTN event, generated when the search button is clicked. Note that this does not initiate a search on its own, you need to perform the appropriate action in your event handler. You may use event.GetString() to retrieve the string to search for in the event handler code.
it: Rispondi a un evento wxEVT_SEARCHCTRL_SEARCH_BTN, generato quando si fa clic sul pulsante di ricerca. Nota che questo non avvia una ricerca da solo, devi eseguire l'azione appropriata nel tuo gestore di eventi. Puoi usare event.GetString() per recuperare la stringa da cercare nel codice del gestore eventi.

source: Respond to a wxEVT_SEARCHCTRL_CANCEL_BTN event, generated when the cancel button is clicked.
it: Risponde a un evento wxEVT_SEARCHCTRL_CANCEL_BTN, generato quando si fa clic sul pulsante Annulla.

source: The default style: 0.
it: Lo stile predefinito: 0.

source: Creates a text control to the left of the picker button which is completely managed by the wxColourPickerCtrl and which can be used by the user to specify a colour. The text control is automatically synchronized with button's value. Use functions defined in wxPickerBase to modify the text control.
it: Crea un controllo di testo a sinistra del pulsante di selezione che è completamente gestito da wxColourPickerCtrl e che può essere utilizzato dall'utente per specificare un colore. Il controllo del testo viene sincronizzato automaticamente con il valore del pulsante. Usa le funzioni definite in wxPickerBase per modificare il controllo del testo.

source: Shows the colour in HTML form (AABBCC) as colour button label (instead of no label at all).
it: Mostra il colore in formato HTML (AABBCC) come etichetta del pulsante colore (anziché nessuna etichetta).

source: colour
it: Colore

source: The user changed the colour selected in the control either using the button or using text control (see wxCLRP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, i.e. recognizable).
it: L'utente ha cambiato il colore selezionato nel controllo usando il pulsante o usando il controllo di testo (vedi wxCLRP_USE_TEXTCTRL; nota che in questo caso l'evento viene generato solo se l'input dell'utente è valido, cioè riconoscibile).

source: The default style: wxFNTP_FONTDESC_AS_LABEL | wxFNTP_USEFONT_FOR_LABEL.
it: Lo stile predefinito: wxFNTP_FONTDESC_AS_LABEL | wxFNTP_USEFONT_FOR_LABEL.

source: Creates a text control to the left of the picker button which is completely managed by the wxFontPickerCtrl and which can be used by the user to specify a font (see SetSelectedFont). The text control is automatically synchronized with button's value. Use functions defined in wxPickerBase to modify the text control.
it: Crea un controllo di testo a sinistra del pulsante di selezione che è completamente gestito da wxFontPickerCtrl e che può essere utilizzato da user per specificare un carattere (vedere SetSelectedFont). Il controllo del testo viene sincronizzato automaticamente con il valore del pulsante. Usa le funzioni definite in wxPickerBase per modificare il controllo del testo.

source: Keeps the label of the button updated with the fontface name and the font size. E.g. choosing &quot;Times New Roman bold, italic with size 10&quot; from the fontdialog, will update the label (overwriting any previous label) with the &quot;Times New Roman, 10&quot; text.
it: Mantiene l'etichetta del pulsante aggiornata con il nome del carattere e la dimensione del carattere. Per esempio. scegliendo &quot;Times New Roman grassetto, corsivo con taglia 10&quot; dal fontdialog, aggiornerà l'etichetta (sovrascrivendo qualsiasi etichetta precedente) con il &quot;Times New Roman, 10&quot; testo.

source: Uses the currently selected font to draw the label of the button.
it: Utilizza il carattere attualmente selezionato per disegnare l'etichetta del pulsante.

source: max_point_size
it: Misura Massima

source: Sets the maximum point size value allowed for the user-chosen font. The default value is 100. Note that big fonts can require a lot of memory and CPU time both for creation and for rendering; thus, specially because the user has the option to specify the fontsize through a text control (see wxFNTP_USE_TEXTCTRL), it's a good idea to put a limit to the maximum font size when huge fonts do not make much sense.
it: Imposta il valore massimo della dimensione in punti consentito per il carattere scelto dall'utente. Il valore predefinito è 100. Nota che i caratteri grandi possono richiedere molta memoria e tempo di CPU sia per la creazione che per il rendering; quindi, specialmente perché l'utente ha la possibilità di specificare la dimensione del carattere attraverso un controllo di testo (vedi wxFNTP_USE_TEXTCTRL), è una buona idea porre un limite alla dimensione massima del carattere quando caratteri grandi non hanno molto senso.

source: The user changed the font selected in the control either using the button or using text control (see wxFNTP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, i.e. recognizable).
it: L'utente ha modificato il carattere selezionato nel controllo utilizzando il pulsante o utilizzando il controllo di testo (vedere wxFNTP_USE_TEXTCTRL; notare che in questo caso l'evento viene generato solo se l'input dell'utente è valido, ovvero riconoscibile).

source: The default style: includes wxFLP_OPEN | wxFLP_FILE_MUST_EXIST and, under wxMSW only, wxFLP_USE_TEXTCTRL.
it: Lo stile predefinito: include wxFLP_OPEN | wxFLP_FILE_MUST_EXIST e, solo in wxMSW, wxFLP_USE_TEXTCTRL.

source: Creates a text control to the left of the picker button which is completely managed by the wxFilePickerCtrl and which can be used by the user to specify a path (see SetPath). The text control is automatically synchronized with button's value. Use functions defined in wxPickerBase to modify the text control.
it: Crea un controllo di testo a sinistra del pulsante di selezione che è completamente gestito da wxFilePickerCtrl e che può essere utilizzato dall'utente per specificare un percorso (vedi SetPath). Il controllo del testo viene sincronizzato automaticamente con il valore del pulsante. Usa le funzioni definite in wxPickerBase per modificare il controllo del testo.

source: Creates a picker which allows the user to select a file to open.
it: Crea un selettore che consente all'utente di selezionare un file da aprire.

source: Creates a picker which allows the user to select a file to save.
it: Crea un selettore che consente all'utente di selezionare un file da salvare.

source: Can be combined with wxFLP_SAVE only: ask confirmation to the user before selecting a file.
it: Combinabile solo con wxFLP_SAVE: chiedi conferma all'utente prima di selezionare un file.

source: Can be combined with wxFLP_OPEN only: the selected file must be an existing file.
it: Può essere combinato solo con wxFLP_OPEN: il file selezionato deve essere un file esistente.

source: Change current working directory on each user file selection change.
it: Modifica la directory di lavoro corrente a ogni modifica della selezione del file utente.

source: Use smaller version of the control with a small &quot;...&quot; button instead of the normal &quot;Browse&quot; one. This flag is new since wxWidgets 2.9.3.
it: Utilizza una versione più piccola del controllo con un piccolo &quot;...&quot; al posto del normale pulsante &quot;Sfoglia&quot; uno. Questo flag è nuovo da wxWidgets 2.9.3.

source: message
it: Messaggio

source: wildcard
it: Caratteri Jolly

source: The user changed the file selected in the control either using the button or using text control (see wxFLP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, e.g. an existing file path if wxFLP_FILE_MUST_EXIST was given).
it: L'utente ha modificato il file selezionato nel controllo utilizzando il pulsante o utilizzando il controllo di testo (vedere wxFLP_USE_TEXTCTRL; notare che in questo caso l'evento viene attivato solo se l'input dell'utente è valido, ad esempio un percorso file esistente se è stato fornito wxFLP_FILE_MUST_EXIST).

source: The default style: includes wxDIRP_DIR_MUST_EXIST and, under wxMSW only, wxDIRP_USE_TEXTCTRL.
it: Lo stile predefinito: include wxDIRP_DIR_MUST_EXIST e, solo in wxMSW, wxDIRP_USE_TEXTCTRL.

source: Creates a text control to the left of the picker button which is completely managed by the wxDirPickerCtrl and which can be used by the user to specify a path (see SetPath). The text control is automatically synchronized with button's value. Use functions defined in wxPickerBase to modify the text control.
it: Crea un controllo di testo a sinistra del pulsante di selezione che è completamente gestito da wxDirPickerCtrl e che può essere utilizzato dall'utente per specificare un percorso (vedi SetPath). Il controllo del testo viene sincronizzato automaticamente con il valore del pulsante. Usa le funzioni definite in wxPickerBase per modificare il controllo del testo.

source: Creates a picker which allows to select only existing directories. wxGTK control always adds this flag internally as it does not support its absence.
it: Crea un selettore che consente di selezionare solo le directory esistenti. Il controllo wxGTK aggiunge sempre questo flag internamente in quanto non supporta la sua assenza.

source: Change current working directory on each user directory selection change.
it: Modifica la directory di lavoro corrente a ogni modifica della selezione della directory utente.

source: The user changed the directory selected in the control either using the button or using text control (see wxDIRP_USE_TEXTCTRL; note that in this case the event is fired only if the user's input is valid, e.g. an existing directory path).
it: L'utente ha cambiato la directory selezionata nel controllo utilizzando il pulsante o utilizzando il controllo di testo (vedere wxDIRP_USE_TEXTCTRL; notare che in questo caso l'evento viene generato solo se l'input dell'utente è valido, ad esempio un percorso di directory esistente).

source: Creates a control without a month calendar drop down but with spin-control-like arrows to change individual date components. This style is not supported by the generic version.
it: Crea un controllo senza un menu a discesa del calendario mensile ma con frecce simili a controlli rotanti per modificare i singoli componenti della data. Questo stile non è supportato dalla versione generica.

source: Creates a control with a month calendar drop-down part from which the user can select a date. This style is not supported in OSX/Cocoa native version.
it: Crea un controllo con una parte a discesa del calendario mensile da cui l'utente può selezionare una data. Questo stile non è supportato nella versione nativa di OSX/Cocoa.

source: Forces display of the century in the default date format. Without this style the century could be displayed, or not, depending on the default date representation in the system. This style is not supported in OSX/Cocoa native version currently.
it: Forza la visualizzazione del secolo nel formato di data predefinito. Senza questo stile il secolo potrebbe essere visualizzato o meno, a seconda della rappresentazione della data predefinita nel sistema. Questo stile non è attualmente supportato nella versione nativa di OSX/Cocoa.

source: With this style, the control allows the user to not enter any valid date at all. Without it - the default - the control always has some valid date. This style is not supported in OSX/Cocoa native version.
it: Con questo stile, il controllo consente all'utente di non inserire alcuna data valida. Senza di essa - l'impostazione predefinita - il controllo ha sempre una data valida. Questo stile non è supportato nella versione nativa di OSX/Cocoa.

source: Creates a control with the style that is best supported for the current platform (currently wxDP_SPIN under Windows and OSX/Cocoa and wxDP_DROPDOWN elsewhere).
it: Crea un controllo con lo stile meglio supportato per la piattaforma corrente (attualmente wxDP_SPIN sotto Windows e OSX/Cocoa e wxDP_DROPDOWN altrove).

source: This event fires when the user changes the current selection in the control.
it: Questo evento viene generato quando l'utente modifica la selezione corrente nel controllo.

source: Creates a control with the style that is best supported for the current platform (currently wxDP_SPIN under Windows and wxDP_DROPDOWN elsewhere).
it: Crea un controllo con lo stile meglio supportato per la piattaforma corrente (attualmente wxDP_SPIN sotto Windows e wxDP_DROPDOWN altrove).

source: Show Sunday as the first day in the week (not in wxGTK)
it: Mostra la domenica come primo giorno della settimana (non in wxGTK)

source: Show Monday as the first day in the week (not in wxGTK)
it: Mostra lunedì come primo giorno della settimana (non in wxGTK)

source: Highlight holidays in the calendar (only generic)
it: Evidenzia le festività nel calendario (solo generico)

source: Disable the year changing (deprecated, only generic)
it: Disabilita la modifica dell'anno (obsoleto, solo generico)

source: Disable the month (and, implicitly, the year) changing
it: Disabilita la modifica del mese (e, implicitamente, dell'anno)

source: Show the neighbouring weeks in the previous and next months (only generic, always on for the native controls)
it: Mostra le settimane vicine nei mesi precedenti e successivi (solo generico, sempre attivo per i controlli nativi)

source: Use alternative, more compact, style for the month and year selection controls (only generic)
it: Usa uno stile alternativo, più compatto, per i controlli di selezione del mese e dell'anno (solo generici)

source: Show week numbers on the left side of the calendar (not in generic)
it: Mostra i numeri delle settimane sul lato sinistro del calendario (non in generico)

source: A day was double clicked in the calendar.
it: Un giorno è stato cliccato due volte nel calendario.

source: The selected date changed.
it: La data selezionata è cambiata.
