Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libcommon.po
Languages: it

source: Help string used in the tooltip.
it: Stringa di aiuto utilizzata nella descrizione comando.

source: statusbar
it: Barra Stato

source: This string is shown in the statusbar (if any) of the parent frame when the mouse pointer is inside the tool.
it: Questa stringa è mostrata nella barra di stato (se presente) del frame genitore quando il puntatore del mouse è all'interno dello strumento.

source: Process a wxEVT_COMMAND_TOOL_CLICKED event (a synonym for wxEVT_COMMAND_MENU_SELECTED). Pass the id of the tool.
it: Elabora un evento wxEVT_COMMAND_TOOL_CLICKED (un sinonimo di wxEVT_COMMAND_MENU_SELECTED). Passa l'id dello strumento.

source: The same as OnToolClicked. (EVT_TOOL)
it: Lo stesso di OnToolClicked. (EVT_TOOL)

source: Process a wxEVT_COMMAND_TOOL_RCLICKED event.
it: Elabora un evento wxEVT_COMMAND_TOOL_RCLICKED.

source: Process a wxEVT_COMMAND_TOOL_ENTER event. This uses the tools parent ID, the ToolBar, so be sure you set it to something that is not the default. The value of wxCommandEvent::GetSelection is the tool id, or -1 if the mouse cursor has moved off a tool.
it: Elabora un evento wxEVT_COMMAND_TOOL_ENTER. Questo utilizza l'ID genitore degli strumenti, la barra degli strumenti, quindi assicurati di impostarlo su qualcosa che non sia l'impostazione predefinita. Il valore di wxCommandEvent::GetSelection è l'id dello strumento, o -1 se il cursore del mouse si è spostato da uno strumento.

source: Process a wxEVT_COMMAND_AUITOOLBAR_TOOL_DROPDOWN event.
it: Elabora un evento wxEVT_COMMAND_AUITOOLBAR_TOOL_DROPDOWN.

source: Process a wxEVT_COMMAND_AUITOOLBAR_OVERFLOW_CLICK event.
it: Elabora un evento wxEVT_COMMAND_AUITOOLBAR_OVERFLOW_CLICK.

source: Process a wxEVT_COMMAND_AUITOOLBAR_RIGHT_CLICK event.
it: Elabora un evento wxEVT_COMMAND_AUITOOLBAR_RIGHT_CLICK.

source: Process a wxEVT_COMMAND_AUITOOLBAR_MIDDLE_CLICK event.
it: Elabora un evento wxEVT_COMMAND_AUITOOLBAR_MIDDLE_CLICK.

source: Process a wxEVT_COMMAND_AUITOOLBAR_BEGIN_DRAG event.
it: Elabora un evento wxEVT_COMMAND_AUITOOLBAR_BEGIN_DRAG.

source: show_effect
it: Visualizza Effetto

source: Set the effects to use when showing the bar.
it: Imposta gli effetti da utilizzare quando mostri la barra.

source: No effect, equivalent to normal wxWindow::Show() or Hide() call.
it: Nessun effetto, equivalente alla normale chiamata wxWindow::Show() o Hide().

source: Roll window to the left.
it: Avvolge la finestra a sinistra.

source: Roll window to the right.
it: Avvolge la finestra a destra.

source: Roll window to the top.
it: Avvolge la finestra verso l'alto.

source: Roll window to the bottom.
it: Avvolge la finestra verso il basso.

source: Slide window to the left.
it: Scorre la finestra a sinistra.

source: Slide window to the right.
it: Scorre la finestra a destra.

source: Slide window to the top.
it: Scorre la finestra verso l'alto.

source: Slide window to the bottom.
it: Scorre la finestra verso il basso.

source: Fade in or out effect.
it: Effetto dissolvenza in entrata o in uscita.

source: Expanding or collapsing effect.
it: Effetto di espansione o collasso.

source: hide_effect
it: Nascondi Effetto

source: Set the effects to use when hiding the bar.
it: Imposta gli effetti da usare quando nascondi la barra.

source: duration
it: Durata

source: Set the duration of the animation (in milliseconds) used when showing or hiding the bar.
it: Imposta la durata dell'animazione (in millisecondi) utilizzato quando si mostra o si nasconde la barra.

source: Message ...
it: Messaggio ...
