Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libcontainers.po
Languages: it

source: Containers
it: Contenitori

source: wxWidgets container controls
it: Controlli Contenitori Di wxWidgets

source: window_style
it: Stile

source: name
it: Nome

source: label
it: Etichetta

source: collapsed
it: Contratto

source: style
it: Stile

source: The default style. It includes wxTAB_TRAVERSAL and wxBORDER_NONE.
it: Lo stile predefinito. Include wxTAB_TRAVERSAL e wxBORDER_NONE.

source: By default wxCollapsiblePane resizes the top level window containing it when its own size changes. This allows to easily implement dialogs containing an optionally shown part, for example, and so is the default behaviour but can be inconvenient in some specific cases – use this flag to disable this automatic parent resizing then.
it: Per impostazione predefinita, wxCollapsiblePane ridimensiona la finestra di livello superiore che la contiene quando le sue dimensioni cambiano. Ciò consente di implementare facilmente finestre di dialogo contenenti una parte mostrata facoltativamente, ad esempio, e quindi è il comportamento predefinito, ma può essere scomodo in alcuni casi specifici: utilizzare questo flag per disabilitare il ridimensionamento automatico del genitore.

source: The user expanded or collapsed the collapsible pane.
it: L'utente ha espanso o compresso il riquadro comprimibile.

source: Draws a 3D effect border and sash.
it: Disegna un bordo e una fascia con effetto 3D.

source: Draws a 3D effect sash (part of default style).
it: Disegna una fascia effetto 3D (parte dello stile predefinito).

source: Synonym for wxSP_BORDER.
it: Sinonimo di wxSP_BORDER.

source: Draws a standard border.
it: Disegna un bordo standard.

source: No border (default).
it: Nessun bordo (impostazione predefinita).

source: Sets the sash to be invisible, even when the window is split. This prevents the user to resize the windows.
it: Imposta l'anta in modo che sia invisibile, anche quando la finestra è divisa. Ciò impedisce all'utente di ridimensionare le finestre.

source: Draws a thin sash.
it: Disegna una fascia sottile.

source: Under Windows XP, switches off the attempt to draw the splitter using Windows XP theming, so the borders and sash will take on the pre-XP look.
it: In Windows XP, disattiva il tentativo di disegnare lo splitter utilizzando i temi di Windows XP, quindi i bordi e la fascia assumeranno l'aspetto pre-XP.

source: Always allow to unsplit, even with the minimum pane size other than zero. Note: The designer prevents un-splitting.
it: Consenti sempre di non dividere, anche con la dimensione minima del riquadro diversa da zero. Nota: il designer impedisce la divisione.

source: Don't draw XOR line but resize the child windows immediately.
it: Non disegnare una linea XOR ma ridimensiona immediatamente le finestre figlio.

source: splitmode
it: Modalità Divisione

source: Specifies a vertical split window.
it: Specifica una finestra divisa in verticale.

source: Specifies a horizontal split window.
it: Specifica una finestra divisa orizzontalmente.

source: sashpos
it: Posizione Fascia

source: The initial sash position.
it: La posizione iniziale dell'anta.

source: sashsize
it: Dimensione Fascia

source: Overrides platform metrics if greater than -1
it: Sostituisce le metriche della piattaforma se maggiore di -1

source: sashgravity
it: Gravità Fascia

source: Sets the sash gravity. Remarks: Gravity is real factor which controls position of sash while resizing wxSplitterWindow. Gravity tells wxSplitterWindow how much will left/top window grow while resizing.
it: Imposta la gravità dell'anta. Note: La gravità è un fattore reale che controlla la posizione dell'anta durante il ridimensionamento di wxSplitterWindow. Gravity dice a wxSplitterWindow quanto crescerà la finestra sinistra/superiore durante il ridimensionamento.

source: min_pane_size
it: Dimensione Minima Riquadro

source: Minimum size for the panes. A minimum less than 1 is not allowed in the designer, because the designer prevents un-splitting.
it: Dimensioni minime per i riquadri. Un minimo inferiore a 1 non è consentito nel progettista, perché il progettista impedisce la non scissione.

source: The sash position is in the process of being changed. May be used to modify the position of the tracking bar to properly reflect the position that would be set if the drag were to be completed at this point. Processes a wxEVT_COMMAND_SPLITTER_SASH_POS_CHANGING event.
it: La posizione dell'anta è in fase di modifica. Può essere utilizzato per modificare la posizione della barra di tracciamento in modo che rifletta correttamente la posizione che verrebbe impostata se il trascinamento dovesse essere completato a questo punto. Elabora un evento wxEVT_COMMAND_SPLITTER_SASH_POS_CHANGING.

source: The sash position was changed. May be used to modify the sash position before it is set, or to prevent the change from taking place. Processes a wxEVT_COMMAND_SPLITTER_SASH_POS_CHANGED event.
it: La posizione della fascia è stata cambiata. Può essere utilizzato per modificare la posizione dell'anta prima che venga impostata o per impedire che avvenga il cambiamento. Elabora un evento wxEVT_COMMAND_SPLITTER_SASH_POS_CHANGED.

source: The splitter has been just unsplit. Processes a wxEVT_COMMAND_SPLITTER_UNSPLIT event.
it: Lo splitter è stato semplicemente non diviso. Elabora un evento wxEVT_COMMAND_SPLITTER_UNSPLIT.

source: The sash was double clicked. The default behaviour is to unsplit the window when this happens (unless the minimum pane size has been set to a value greater than zero). Processes a wxEVT_COMMAND_SPLITTER_DOUBLECLICKED event.
it: La fascia è stata cliccata due volte. Il comportamento predefinito consiste nel separare la finestra quando ciò accade (a meno che la dimensione minima del riquadro non sia stata impostata su un valore maggiore di zero). Elabora un evento wxEVT_COMMAND_SPLITTER_DOUBLECLICKED.

source: scroll_rate_x
it: Velocità Scorrimento X

source: Set the horizontal scrolling increment.
it: Imposta l'incremento di scorrimento orizzontale.

source: scroll_rate_y
it: Velocità Scorrimento Y

source: Set the vertical scrolling increment.
it: Imposta l'incremento di scorrimento verticale.

source: bitmapsize
it: Dimensione Bitmap

source: Size of page images
it: Dimensione delle immagini della pagina

source: Place tabs on the top side.
it: Posiziona le linguette sul lato superiore.

source: Place tabs on the left side.
it: Posiziona le schede sul lato sinistro.

source: Place tabs on the right side.
it: Posiziona le linguette sul lato destro.

source: Place tabs under instead of above the notebook pages.
it: Posiziona le schede sotto anziché sopra le pagine del notebook.

source: All tabs will have same width. (Windows only)
it: Tutte le schede avranno la stessa larghezza. (solo Windows)

source: There can be several rows of tabs. (Windows only)
it: Possono essere presenti diverse righe di schede. (Solo Windows)

source: Display a solid colour on notebook pages, and not a gradient, which can reduce performance. (Windows only)
it: Visualizza un colore a tinta unita sulle pagine del notebook e non una sfumatura, che può ridurre le prestazioni. (solo Windows)

source: The page selection was changed. Processes a wxEVT_COMMAND_NOTEBOOK_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_COMMAND_NOTEBOOK_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_COMMAND_NOTEBOOK_PAGE_CHANGING event. This event can be vetoed.
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_COMMAND_NOTEBOOK_PAGE_CHANGING. Questo evento può essere posto il veto.

source: Page Image
it: Immagine della pagina

source: image
it: Indice Immagine

source: wxImageList Index
it: Indice dell'immagine nella wxImageList

source: select
it: Selezionato

source: Select Page when Adding
it: Seleziona la pagina durante l'aggiunta

source: Defined as wxAUI_NB_TOP | wxAUI_NB_TAB_SPLIT | wxAUI_NB_TAB_MOVE | wxAUI_NB_SCROLL_BUTTONS | wxAUI_NB_CLOSE_ON_ACTIVE_TAB | wxAUI_NB_MIDDLE_CLICK_CLOSE.
it: Definito come wxAUI_NB_TOP | wxAUI_NB_TAB_SPLIT | wxAUI_NB_TAB_MOVE | wxAUI_NB_SCROLL_BUTTONS | wxAUI_NB_CLOSE_ON_ACTIVE_TAB | wxAUI_NB_MIDDLE_CLICK_CLOSE.

source: Allows the tab control to be split by dragging a tab.
it: Consente di dividere il controllo struttura a schede trascinando una scheda.

source: Allows a tab to be moved horizontally by dragging.
it: Consente di spostare orizzontalmente una scheda trascinandola.

source: Allows a tab to be moved to another tab control.
it: Consente di spostare una scheda in un altro controllo struttura a schede.

source: With this style, all tabs have the same width.
it: Con questo stile, tutte le schede hanno la stessa larghezza.

source: With this style, left and right scroll buttons are displayed.
it: Con questo stile vengono visualizzati i pulsanti di scorrimento sinistro e destro.

source: With this style, a drop-down list of windows is available.
it: Con questo stile è disponibile un elenco a discesa di finestre.

source: With this style, a close button is available on the tab bar.
it: Con questo stile, è disponibile un pulsante di chiusura sulla barra delle schede.

source: With this style, the close button is visible on the active tab.
it: Con questo stile, il pulsante di chiusura è visibile nella scheda attiva.

source: With this style, the close button is visible on all tabs.
it: Con questo stile, il pulsante di chiusura è visibile su tutte le schede.

source: With this style, middle click on a tab closes the tab.
it: Con questo stile, il clic centrale su una scheda chiude la scheda.

source: With this style, tabs are drawn along the top of the notebook.
it: Con questo stile, le schede vengono disegnate lungo la parte superiore del notebook.

source: With this style, tabs are drawn along the bottom of the notebook.
it: Con questo stile, le schede vengono disegnate lungo la parte inferiore del notebook.

source: tab_ctrl_height
it: Altezza Scheda

source: Sets the tab height. By default, the tab control height is calculated by measuring the text height and bitmap sizes on the tab captions. Calling this method will override that calculation and set the tab control to the specified height parameter. A call to this method will override any call to SetUniformBitmapSize(). Specifying -1 as the height will return the control to its default auto-sizing behaviour.
it: Imposta l'altezza della scheda. Per impostazione predefinita, l'altezza del controllo struttura a schede viene calcolata misurando l'altezza del testo e le dimensioni della bitmap nelle didascalie delle schede. La chiamata a questo metodo sovrascriverà tale calcolo e imposterà il controllo struttura a schede sul parametro di altezza specificato. Una chiamata a questo metodo sovrascriverà qualsiasi chiamata a SetUniformBitmapSize(). Specificando -1 come altezza, il controllo tornerà al suo comportamento di ridimensionamento automatico predefinito.

source: SetUniformBitmapSize() ensures that all tabs will have the same height, even if some tabs don't have bitmaps. Passing wxDefaultSize to this function will instruct the control to use dynamic tab height, which is the default behaviour. Under the default behaviour, when a tab with a large bitmap is added, the tab control's height will automatically increase to accommodate the larger bitmap.
it: SetUniformBitmapSize() garantisce che tutte le schede abbiano la stessa altezza, anche se alcune schede non hanno bitmap. Il passaggio di wxDefaultSize a questa funzione indicherà al controllo di utilizzare l'altezza di tabulazione dinamica, che è il comportamento predefinito. Con il comportamento predefinito, quando viene aggiunta una scheda con una bitmap grande, l'altezza del controllo struttura a schede aumenterà automaticamente per adattarsi alla bitmap più grande.

source: A page is about to be closed. Processes a wxEVT_AUINOTEBOOK_PAGE_CLOSE event.
it: Una pagina sta per essere chiusa. Elabora un evento wxEVT_AUINOTEBOOK_PAGE_CLOSE.

source: A page has been closed. Processes a wxEVT_AUINOTEBOOK_PAGE_CLOSED event.
it: Una pagina è stata chiusa. Elabora un evento wxEVT_AUINOTEBOOK_PAGE_CLOSED.

source: The page selection was changed. Processes a wxEVT_AUINOTEBOOK_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_AUINOTEBOOK_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_AUINOTEBOOK_PAGE_CHANGING event. This event can be vetoed.
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_AUINOTEBOOK_PAGE_CHANGING. Questo evento può essere posto il veto.

source: The window list button has been pressed. Processes a wxEVT_AUINOTEBOOK_BUTTON event.
it: Il pulsante dell'elenco delle finestre è stato premuto. Elabora un evento wxEVT_AUINOTEBOOK_BUTTON.

source: Dragging is about to begin. Processes a wxEVT_AUINOTEBOOK_BEGIN_DRAG event.
it: Il trascinamento sta per iniziare. Elabora un evento wxEVT_AUINOTEBOOK_BEGIN_DRAG.

source: Dragging has ended. Processes a wxEVT_AUINOTEBOOK_END_DRAG event.
it: Il trascinamento è terminato. Elabora un evento wxEVT_AUINOTEBOOK_END_DRAG.

source: Emitted during a drag and drop operation. Processes a wxEVT_AUINOTEBOOK_DRAG_MOTION event.
it: Emesso durante un'operazione di trascinamento della selezione. Elabora un evento wxEVT_AUINOTEBOOK_DRAG_MOTION.

source: Whether to allow a tab to be dropped. Processes a wxEVT_AUINOTEBOOK_ALLOW_DND event. This event must be specially allowed.
it: Se consentire l'eliminazione di una scheda. Elabora un evento wxEVT_AUINOTEBOOK_ALLOW_DND. Questo evento deve essere appositamente consentito.

source: Notify that the tab has been dragged. Processes a wxEVT_AUINOTEBOOK_DRAG_DONE event.
it: Notifica che la scheda è stata trascinata. Elabora un evento wxEVT_AUINOTEBOOK_DRAG_DONE.

source: The middle mouse button is pressed on a tab. Processes a wxEVT_AUINOTEBOOK_TAB_MIDDLE_DOWN event.
it: Il pulsante centrale del mouse viene premuto su una scheda. Elabora un evento wxEVT_AUINOTEBOOK_TAB_MIDDLE_DOWN.

source: The middle mouse button is released on a tab. Processes a wxEVT_AUINOTEBOOK_TAB_MIDDLE_UP event.
it: Il pulsante centrale del mouse viene rilasciato su una scheda. Elabora un evento wxEVT_AUINOTEBOOK_TAB_MIDDLE_UP.

source: The right mouse button is pressed on a tab. Processes a wxEVT_AUINOTEBOOK_TAB_RIGHT_DOWN event.
it: Il pulsante destro del mouse viene premuto su una scheda. Elabora un evento wxEVT_AUINOTEBOOK_TAB_RIGHT_DOWN.

source: The right mouse button is released on a tab. Processes a wxEVT_AUINOTEBOOK_TAB_RIGHT_UP event.
it: Il pulsante destro del mouse viene rilasciato su una scheda. Elabora un evento wxEVT_AUINOTEBOOK_TAB_RIGHT_UP.

source: Double clicked on the tabs background area. Processes a wxEVT_AUINOTEBOOK_BG_DCLICK event.
it: Fare doppio clic sull'area di sfondo delle schede. Elabora un evento wxEVT_AUINOTEBOOK_BG_DCLICK.

source: Choose the default location for the labels depending on the current platform (left everywhere except Mac where it is top).
it: Scegli la posizione predefinita per le etichette in base alla piattaforma corrente (a sinistra ovunque tranne che nel Mac dove è in alto).

source: Place labels above the page area.
it: Posiziona le etichette sopra l'area della pagina.

source: Place labels on the left side.
it: Posiziona le etichette sul lato sinistro.

source: Place labels on the right side.
it: Posiziona le etichette sul lato destro.

source: Place labels below the page area.
it: Posiziona le etichette sotto l'area della pagina.

source: The page selection was changed. Processes a wxEVT_COMMAND_LISTBOOK_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_COMMAND_LISTBOOK_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_COMMAND_LISTBOOK_PAGE_CHANGING event. This event can be vetoed.
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_COMMAND_LISTBOOK_PAGE_CHANGING. Questo evento può essere posto il veto.

source: Choose the default location for the toolbar depending on the current platform
it: Scegli la posizione predefinita per la barra degli strumenti a seconda della piattaforma corrente

source: The page selection was changed. Processes a wxEVT_COMMAND_TOOLBOOK_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_COMMAND_TOOLBOOK_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_COMMAND_TOOLBOOK_PAGE_CHANGING event. This event can be vetoed.
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_COMMAND_TOOLBOOK_PAGE_CHANGING. Questo evento può essere posto il veto.

source: Choose the default location for the tree depending on the current platform
it: Scegli la posizione predefinita per l'albero a seconda della piattaforma corrente

source: The page selection was changed. Processes a wxEVT_COMMAND_TREEBOOK_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_COMMAND_TREEBOOK_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_COMMAND_TREEBOOK_PAGE_CHANGING event. This event can be vetoed.
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_COMMAND_TREEBOOK_PAGE_CHANGING. Questo evento può essere posto il veto.

source: The page node is going to be collapsed. Processes a wxEVT_COMMAND_TREEBOOK_NODE_COLLAPSED event.
it: Il nodo della pagina verrà compresso. Elabora un evento wxEVT_COMMAND_TREEBOOK_NODE_COLLAPSED.

source: The page node is going to be expanded. Processes a wxEVT_COMMAND_TREEBOOK_NODE_EXPANDED event.
it: Il nodo della pagina verrà espanso. Elabora un evento wxEVT_COMMAND_TREEBOOK_NODE_EXPANDED.

source: depth
it: Profondità

source: Adds a new child-page to the last top-level page
it: Aggiunge una nuova pagina figlio all'ultima pagina di primo livello

source: expanded
it: Espanso

source: Expands the current treebookpage node
it: Espande il nodo treebookpage corrente

source: The page selection was changed. Processes a wxEVT_CHOICEBOOK_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_CHOICEBOOK_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_CHOICEBOOK_PAGE_CHANGING event. This event can be vetoed (using wxNotifyEvent::Veto()).
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_CHOICEBOOK_PAGE_CHANGING. Questo evento può essere posto il veto (usando wxNotifyEvent::Veto()).

source: The page selection was changed. Processes a wxEVT_BOOKCTRL_PAGE_CHANGED event.
it: La selezione della pagina è stata modificata. Elabora un evento wxEVT_BOOKCTRL_PAGE_CHANGED.

source: The page selection is about to be changed. Processes a wxEVT_BOOKCTRL_PAGE_CHANGING event. This event can be vetoed.
it: La selezione della pagina sta per essere modificata. Elabora un evento wxEVT_BOOKCTRL_PAGE_CHANGING. Questo evento può essere posto il veto.
