Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libcommon.po
Languages: it

source: Finish editing a label. This can be prevented by calling Veto().
it: Termina la modifica di un'etichetta. Questo può essere evitato chiamando Veto().

source: Delete an item.
it: Elimina un elemento.

source: Delete all items.
it: Elimina tutti gli elementi.

source: The item has been selected.
it: L'elemento è stato selezionato.

source: The item has been deselected.
it: L'elemento è stato deselezionato.

source: The item has been activated (ENTER or double click).
it: L'elemento è stato attivato (INVIO o doppio clic).

source: The currently focused item has changed.
it: L'elemento attualmente focalizzato è cambiato.

source: The middle mouse button has been clicked on an item.
it: Il pulsante centrale del mouse è stato cliccato su un elemento.

source: The right mouse button has been clicked on an item.
it: Il tasto destro del mouse è stato cliccato su un elemento.

source: A key has been pressed.
it: È stato premuto un tasto.

source: An item has been inserted.
it: È stato inserito un elemento.

source: A column (m_col) has been left-clicked.
it: È stato fatto clic con il pulsante sinistro del mouse su una colonna (m_col).

source: A column (m_col) has been right-clicked.
it: È stato fatto clic con il pulsante destro del mouse su una colonna (m_col).

source: The user started resizing a column - can be vetoed.
it: L'utente ha iniziato a ridimensionare una colonna - può essere posto il veto.

source: The divider between columns is being dragged.
it: Il divisore tra le colonne viene trascinato.

source: A column has been resized by the user.
it: Una colonna è stata ridimensionata dall'utente.

source: Prepare cache for a virtual list control.
it: Preparare la cache per un controllo elenco virtuale.

source: The item has been checked.
it: L'articolo è stato controllato.

source: The item has been unchecked.
it: L'elemento è stato deselezionato.

source: Create a 2-state checkbox. This is the default.
it: Crea una casella di controllo a 2 stati. Questa è l'impostazione predefinita.

source: Create a 3-state checkbox. Not implemented in wxOS2 and wxGTK built against GTK+ 1.2.
it: Crea una casella di controllo a 3 stati. Non implementato in wxOS2 e wxGTK compilato contro GTK 1.2.

source: By default a user can't set a 3-state checkbox to the third state. It can only be done from code. Using this flags allows the user to set the checkbox to the third state by clicking.
it: Per impostazione predefinita, un utente non può impostare una casella di controllo a 3 stati sul terzo stato. Si può fare solo da codice. L'utilizzo di questi flag consente all'utente di impostare la casella di controllo sul terzo stato facendo clic.

source: Makes the text appear on the left of the checkbox.
it: Fa apparire il testo a sinistra della casella di controllo.

source: checked
it: Spuntato

source: Process a wxEVT_COMMAND_CHECKBOX_CLICKED event, when the checkbox is clicked.
it: Elabora un evento wxEVT_COMMAND_CHECKBOX_CLICKED, quando si fa clic sulla casella di controllo.

source: Contents of the Radio Box.
it: Contenuto della Radio Box.

source: Zero-based position of the selected button.
it: Posizione in base zero del pulsante selezionato.

source: majorDimension
it: Dimensione Massima

source: Specifies the maximum number of rows (if style contains wxRA_SPECIFY_ROWS) or columns (if style contains wxRA_SPECIFY_COLS) for a two-dimensional radiobox.
it: Specifica il numero massimo di righe (se style contiene wxRA_SPECIFY_ROWS) o colonne (se style contiene wxRA_SPECIFY_COLS) per un radiobox bidimensionale.

source: The major dimension parameter refers to the maximum number of rows.
it: Il parametro della dimensione principale si riferisce al numero massimo di righe.

source: The major dimension parameter refers to the maximum number of columns.
it: Il parametro della dimensione principale si riferisce al numero massimo di colonne.

source: Process a wxEVT_COMMAND_RADIOBOX_SELECTED event, when a radiobutton is clicked.
it: Elabora un evento wxEVT_COMMAND_RADIOBOX_SELECTED, quando si fa clic su un radiobutton.

source: Marks the beginning of a new group of radio buttons.
it: Segna l'inizio di un nuovo gruppo di pulsanti di opzione.

source: In some circumstances, radio buttons that are not consecutive siblings trigger a hang bug in Windows (only). If this happens, add this style to mark the button as not belonging to a group, and implement the mutually-exclusive group behaviour yourself.
it: In alcune circostanze, i pulsanti di opzione che non sono fratelli consecutivi attivano un bug di blocco in Windows (solamente). Se ciò accade, aggiungi questo stile per contrassegnare il pulsante come non appartenente a un gruppo e implementa tu stesso il comportamento del gruppo che si esclude a vicenda.

source: Handles a toggle button click event.
it: Gestisce un evento clic del pulsante di attivazione/disattivazione.

source: Creates a horizontal line.
it: Crea una linea orizzontale.

source: Creates a vertical line.
it: Crea una linea verticale.

source: Initial position for the slider.
it: Posizione iniziale per il cursore.

source: minValue
it: Valore Minimo

source: Minimum slider position.
it: Posizione minima del cursore.

source: maxValue
it: Valore Massimo

source: Maximum slider position.
it: Posizione massima del cursore.

source: Displays the slider horizontally (this is the default).
it: Visualizza il cursore orizzontalmente (questa è l'impostazione predefinita).

source: Displays the slider vertically.
it: Visualizza il dispositivo di scorrimento verticalmente.

source: Displays tick marks.
it: Visualizza i segni di graduazione.

source: Displays minimum, maximum labels (new since wxWidgets 2.9.1).
it: Visualizza le etichette minime e massime (nuovo da wxWidgets 2.9.1).

source: Displays value label (new since wxWidgets 2.9.1).
it: Visualizza l'etichetta del valore (nuovo da wxWidgets 2.9.1).

source: Displays minimum, maximum and value labels (same as wxSL_VALUE_LABEL and wxSL_MIN_MAX_LABELS together).
it: Visualizza le etichette minimo, massimo e valore (uguale a wxSL_VALUE_LABEL e wxSL_MIN_MAX_LABELS insieme).

source: Displays ticks on the left and forces the slider to be vertical.
it: Visualizza i segni di spunta a sinistra e forza la posizione verticale del dispositivo di scorrimento.

source: Displays ticks on the right and forces the slider to be vertical.
it: Visualizza i segni di spunta a destra e forza la posizione verticale del dispositivo di scorrimento.

source: Displays ticks on the top.
it: Visualizza i segni di spunta in alto.

source: Displays ticks on the bottom (this is the default).
it: Visualizza i segni di spunta in basso (questa è l'impostazione predefinita).

source: Displays ticks on both sides.
it: Visualizza segni di spunta su entrambi i lati.

source: Allows the user to select a range on the slider. Windows only.
it: Consente all'utente di selezionare un intervallo sul dispositivo di scorrimento. Solo Windows.

source: Inverses the mininum and maximum endpoints on the slider. Not compatible with wxSL_SELRANGE.
it: Inverte gli estremi minimo e massimo sullo slider. Non compatibile con wxSL_SELRANGE.

source: Process all scroll events.
it: Elabora tutti gli eventi di scorrimento.

source: Process wxEVT_SCROLL_TOP scroll-to-top events (minimum position).
it: Elabora eventi wxEVT_SCROLL_TOP scroll-to-top (posizione minima).

source: Process wxEVT_SCROLL_BOTTOM scroll-to-bottom events (maximum position).
it: Elabora wxEVT_SCROLL_BOTTOM eventi scroll-to-bottom (posizione massima).

source: Process wxEVT_SCROLL_LINEUP line up events.
it: Elabora wxEVT_SCROLL_LINEUP eventi di allineamento.

source: Process wxEVT_SCROLL_LINEDOWN line down events.
it: Elabora gli eventi di riga down wxEVT_SCROLL_LINEDOWN.

source: Process wxEVT_SCROLL_PAGEUP page up events.
it: Elabora eventi di pagina up wxEVT_SCROLL_PAGEUP.

source: Process wxEVT_SCROLL_PAGEDOWN page down events.
it: Elabora wxEVT_SCROLL_PAGEDOWN eventi pagina giù.

source: Process wxEVT_SCROLL_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack).
it: Elabora gli eventi di thumbtrack wxEVT_SCROLL_THUMBTRACK (eventi frequenti inviati mentre l'utente trascina la thumbtrack).

source: Process wxEVT_SCROLL_THUMBRELEASE thumb release events.
it: Elabora gli eventi di rilascio della miniatura wxEVT_SCROLL_THUMBRELEASE.

source: Process wxEVT_SCROLL_CHANGED end of scrolling events (MSW only).
it: Elabora wxEVT_SCROLL_CHANGED fine degli eventi di scorrimento (solo MSW).

source: Process all scroll events. Variant taking a window identifier.
it: Elabora tutti gli eventi di scorrimento. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_TOP scroll-to-top events (minimum position). Variant taking a window identifier.
it: Elabora eventi wxEVT_SCROLL_TOP scroll-to-top (posizione minima). Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_BOTTOM scroll-to-bottom events (maximum position). Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_BOTTOM eventi scroll-to-bottom (posizione massima). Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_LINEUP line up events. Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_LINEUP eventi di allineamento. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_LINEDOWN line down events. Variant taking a window identifier.
it: Elabora gli eventi di riga down wxEVT_SCROLL_LINEDOWN. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_PAGEUP page up events. Variant taking a window identifier.
it: Elabora eventi di pagina up wxEVT_SCROLL_PAGEUP. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_PAGEDOWN page down events. Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_PAGEDOWN eventi pagina giù. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_THUMBTRACK thumbtrack events (frequent events sent as the user drags the thumbtrack). Variant taking a window identifier.
it: Elabora gli eventi di thumbtrack wxEVT_SCROLL_THUMBTRACK (eventi frequenti inviati mentre l'utente trascina la thumbtrack). Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_THUMBRELEASE thumb release events. Variant taking a window identifier.
it: Elabora gli eventi di rilascio della miniatura wxEVT_SCROLL_THUMBRELEASE. Variante che prende un identificatore di finestra.

source: Process wxEVT_SCROLL_CHANGED end of scrolling events (MSW only). Variant taking a window identifier.
it: Elabora wxEVT_SCROLL_CHANGED fine degli eventi di scorrimento (solo MSW). Variante che prende un identificatore di finestra.

source: Process wxEVT_SLIDER which is generated after any change of wxSlider position in addition to one of the events above. Notice that the handler of this event receives a wxCommandEvent as argument and not wxScrollEvent, as all the other handlers.
it: Processo wxEVT_SLIDER che viene generato dopo ogni modifica della posizione di wxSlider oltre a uno degli eventi sopra. Nota che il gestore di questo evento riceve un wxCommandEvent come argomento e non wxScrollEvent, come tutti gli altri gestori.

source: range
it: Intervallo

source: Integer range (maximum value) of the gauge.
it: Intervallo intero (valore massimo) dell'indicatore.

source: Initial position for the gauge.
it: Posizione iniziale per l'indicatore.

source: Creates a horizontal gauge.
it: Crea un misuratore orizzontale.

source: Creates a vertical gauge.
it: Crea un misuratore verticale.

source: Creates smooth progress bar with one pixel wide update step (not supported by all platforms).
it: Crea una barra di avanzamento uniforme con un passaggio di aggiornamento largo un pixel (non supportato da tutte le piattaforme).

source: size
it: Dimensione

source: The size of the images in the list (default: the size of the first bitmap).
it: La dimensione delle immagini nell'elenco (impostazione predefinita: la dimensione della prima bitmap).

source: mask
it: Maschera

source: If masks should be created for all images (default: true).
it: Se le maschere devono essere create per tutte le immagini (impostazione predefinita: true).

source: type
it: Tipo

source: Sets the image list associated with the control and takes ownership of it (i.e. the control will, unlike when using SetImageList, delete the list when destroyed). which is one of wxIMAGE_LIST_NORMAL, wxIMAGE_LIST_SMALL, wxIMAGE_LIST_STATE (the last is unimplemented).
it: Imposta l'elenco di immagini associato al controllo e ne assume la proprietà (ovvero il controllo, a differenza di quando si utilizza SetImageList, elimina l'elenco quando viene distrutto) che è uno tra wxIMAGE_LIST_NORMAL, wxIMAGE_LIST_SMALL, wxIMAGE_LIST_STATE (l'ultimo non è implementato).

source: The normal (large icon) image list.
it: L'elenco delle immagini normali (icona grande).

source: The small icon image list.
it: Lista immagini piccola.

source: Adds a new image by keeping its optional mask bitmap.
it: Aggiunge una nuova immagine mantenendo la bitmap della maschera facoltativa.

source: Bars
it: Barre

source: wxWidgets Bar Controls
it: Controlli A Barra wxWidgets

source: fields
it: Campi

source: Number of fields in the statusbar.
it: Numero di campi nella barra di stato.

source: Displays a gripper at the right-hand side of the status bar which can be used to resize the parent window.
it: Visualizza un gripper sul lato destro della barra di stato che può essere utilizzato per ridimensionare la finestra padre.

source: Displays tooltips for those panes whose status text has been ellipsized/truncated because the status text doesn't fit the pane width. Note that this style has effect only on wxGTK (with GTK+ &gt;= 2.12) currently.
it: Visualizza le descrizioni comandi per quei riquadri il cui testo di stato è stato ellisse/troncato perché il testo di stato non si adatta alla larghezza del riquadro. Nota che questo stile ha effetto solo su wxGTK (con GTK+ &gt;= 2.12).

source: Replace the beginning of the status texts with an ellipsis when the status text widths exceed the status bar pane's widths (uses wxControl::Ellipsize).
it: Sostituisci l'inizio dei testi di stato con un'ellissi quando le larghezze del testo di stato superano le larghezze del riquadro della barra di stato (usa wxControl::Ellipsize).

source: Replace the middle of the status texts with an ellipsis when the status text widths exceed the status bar pane's widths (uses wxControl::Ellipsize).
it: Sostituisci la parte centrale dei testi di stato con un'ellissi quando le larghezze del testo di stato superano le larghezze del riquadro della barra di stato (usa wxControl::Ellipsize).

source: Replace the end of the status texts with an ellipsis when the status text widths exceed the status bar pane's widths (uses wxControl::Ellipsize).
it: Sostituisci la fine dei testi di stato con un'ellissi quando le larghezze del testo di stato superano le larghezze del riquadro della barra di stato (usa wxControl::Ellipsize).

source: The default style: includes wxSTB_SIZEGRIP|wxSTB_SHOW_TIPS|wxSTB_ELLIPSIZE_END|wxFULL_REPAINT_ON_RESIZE
it: Lo stile predefinito: include wxSTB_SIZEGRIP|wxSTB_SHOW_TIPS|wxSTB_ELLIPSIZE_END|wxFULL_REPAINT_ON_RESIZE

source: Allows the menu bar to be detached (wxGTK only).
it: Consente di scollegare la barra dei menu (solo wxGTK).

source: Bitmap for the menu item. (Windows, GTK+, and OSX only) This doubles as the checked bitmap is the menu item is wxITEM_CHECK.
it: Bitmap per la voce di menu. (Solo Windows, GTK+ e OSX) Questo raddoppia poiché la bitmap selezionata è la voce di menu è wxITEM_CHECK.

source: Text for the menu item, as shown on the menu. An accelerator key can be specified using the ampersand &quot;&amp;&quot; character.
it: Testo per la voce di menu, come mostrato nel menu. È possibile specificare un tasto di scelta rapida utilizzando la e commerciale &quot;&amp;&quot; personaggio.

source: shortcut
it: Scorciatoia

source: Optional shortcut keyboard shortcut. Remarks: The general syntax is any combination of &quot;CTRL&quot;, &quot;ALT&quot; and &quot;SHIFT&quot; strings (case doesn't matter) separated by either '-' or '+' characters and followed by the accelerator itself. The accelerator may be any alphanumeric character, any function key (from F1 to F12)
it: Scorciatoia da tastiera opzionale. Note: la sintassi generale è qualsiasi combinazione di &quot;CTRL&quot;, &quot;ALT&quot; e &quot;MAIUSC&quot; stringhe (le maiuscole non hanno importanza) separate da caratteri '-' o '+' e seguite dall'acceleratore stesso. L'acceleratore può essere qualsiasi carattere alfanumerico, qualsiasi tasto funzione (da F1 a F12)

source: help
it: Guida

source: Optional help string that will be shown on the status bar.
it: Stringa di aiuto facoltativa che verrà mostrata sulla barra di stato.

source: unchecked_bitmap
it: Bitmap Deselezionato

source: Unchecked bitmap for the menu item. This will be shown if the menu item is wxITEM_CHECK and it is currently unchecked. (Windows only)
it: Bitmap non selezionata per la voce di menu. Questo verrà mostrato se la voce di menu è wxITEM_CHECK ed è attualmente deselezionata. (Solo Windows)

source: enabled
it: Abilitato

source: kind
it: Tipo

source: Creates a normal menu item.
it: Crea una normale voce di menu.

source: Creates a checkable menu item.
it: Crea una voce di menu verificabile.

source: radio item to the end of the menu. All consequent radio items form a group and when an item in the group is checked, all the others are automatically unchecked. (Only on Windows and GTK)
it: Elemento radio alla fine del menu. Tutti gli elementi radio conseguenti formano un gruppo e quando un elemento nel gruppo è selezionato, tutti gli altri vengono automaticamente deselezionati. (Solo su Windows e GTK)

source: Process a menu selection event.
it: Elabora un evento di selezione del menu.

source: Process a wxEVT_UPDATE_UI event.
it: Elabora un evento wxEVT_SCROLL_PAGEUP.

source: bitmapsize
it: Dimensioni Bitmap

source: Default size of each tool bitmap. The default bitmap size is 16 by 15 pixels.
it: Dimensione predefinita di ogni bitmap dello strumento. La dimensione della bitmap predefinita è 16 per 15 pixel.

source: margins
it: Margini

source: Values to be used as margins for the toolbar.
it: Valori da utilizzare come margini per la barra degli strumenti.

source: packing
it: Imballaggio

source: Value used for spacing tools. Remarks: The packing is used for spacing in the vertical direction if the toolbar is horizontal, and for spacing in the horizontal direction if the toolbar is vertical.
it: Valore utilizzato per gli strumenti di spaziatura. Note: La spaziatura viene utilizzata per la spaziatura in direzione verticale se la barra degli strumenti è orizzontale e per la spaziatura in direzione orizzontale se la barra degli strumenti è verticale.

source: separation
it: Separazione

source: The default separator size. Remarks: This is the size between each toolbar tool.
it: La dimensione del separatore predefinita. Note: Questa è la dimensione tra ogni strumento della barra degli strumenti.

source: Gives the toolbar a flat look (Windows and GTK only).
it: Conferisce alla barra degli strumenti un aspetto piatto (solo Windows e GTK).

source: Makes the toolbar floatable and dockable (GTK only).
it: Rende la barra degli strumenti mobile e agganciabile (solo GTK).

source: Specifies horizontal layout (default).
it: Specifica il layout orizzontale (predefinito).

source: Specifies vertical layout.
it: Specifica il layout verticale.

source: Shows the text in the toolbar buttons; by default only icons are shown.
it: Mostra il testo nei pulsanti della barra degli strumenti; per impostazione predefinita vengono visualizzate solo le icone.

source: Specifies no icons in the toolbar buttons; by default they are shown.
it: Non specifica alcuna icona nei pulsanti della barra degli strumenti; per impostazione predefinita sono mostrati.

source: Specifies no divider (border) above the toolbar (Windows only).
it: Non specifica alcun divisore (bordo) sopra la barra degli strumenti (solo Windows).

source: Specifies no alignment with the parent window (Windows only, not very useful).
it: Non specifica l'allineamento con la finestra principale (solo Windows, non molto utile).

source: Shows the text and the icons alongside, not vertically stacked (Windows and GTK 2 only). This style must be used with wxTB_TEXT.
it: Mostra il testo e le icone a fianco, non impilate verticalmente (solo Windows e GTK 2). Questo stile deve essere utilizzato con wxTB_TEXT.

source: Combination of wxTB_HORZ_LAYOUT and wxTB_TEXT.
it: Combinazione di wxTB_HORZ_LAYOUT e wxTB_TEXT.

source: Don't show the short help tooltips for the tools when the mouse hovers over them.
it: Non mostrare i brevi suggerimenti di aiuto per gli strumenti quando il mouse passa sopra di essi.

source: Align the toolbar at the bottom of parent window.
it: Allinea la barra degli strumenti nella parte inferiore della finestra principale.

source: Align the toolbar at the right side of parent window.
it: Allinea la barra degli strumenti sul lato destro della finestra principale.

source: Combination of wxTB_HORIZONTAL and wxTB_FLAT. This style is new since wxWidgets 2.9.5.
it: Combinazione di wxTB_HORIZONTAL e wxTB_FLAT. Questo stile è nuovo da wxWidgets 2.9.5.

source: Using this style forces the toolbar to be vertical and be only dockable to the left or right sides of the window whereas by default it can be horizontal or vertical and be docked anywhere.
it: L'utilizzo di questo stile impone alla barra degli strumenti di essere verticale e di essere ancorata solo ai lati sinistro o destro della finestra, mentre per impostazione predefinita può essere orizzontale o verticale ed essere ancorata ovunque.

source: Analogous to wxAUI_TB_VERTICAL, but forces the toolbar to be horizontal.
it: Analogo a wxAUI_TB_VERTICAL, ma forza l'orizzontalità della barra degli strumenti.

source: Draw a plain background (based on parent) instead of the default gradient background.
it: Disegna uno sfondo semplice (basato sul genitore) invece dello sfondo sfumato predefinito.

source: Equivalent to wxAUI_TB_HORZ_LAYOUT | wxAUI_TB_TEXT
it: Equivalente a wxAUI_TB_HORZ_LAYOUT | wxAUI_TB_TEXT

source: The default is to have no styles.
it: L'impostazione predefinita è non avere stili.

source: label_visible
it: Etichetta Visibile

source: toolbar_label
it: Etichetta Barra Strumenti

source: use_explicit_ids
it: Usa ID Espliciti

source: Use user-specified tool IDs instead of automatically assigned ones (needed for old wxAuiToolBar implementation).
it: Utilizzare gli ID strumento specificati dall'utente invece di quelli assegnati automaticamente (necessari per la vecchia implementazione di wxAuiToolBar).

source: The primary tool bitmap.
it: La bitmap dello strumento principale.

source: A normal toolbar button.
it: Un normale pulsante della barra degli strumenti.

source: A checkable tool (stays pressed after it has been toggled).
it: Uno strumento verificabile (rimane premuto dopo che è stato attivato).

source: A checkable tool which makes part of a radio group of tools each of which is automatically unchecked whenever another button in the group is checked.
it: Uno strumento verificabile che fa parte di un gruppo radio di strumenti, ognuno dei quali viene automaticamente deselezionato ogni volta che viene selezionato un altro pulsante nel gruppo.

source: context_menu
it: Menu Contestuale

source: Specifies that a drop-down menu button will appear next to the tool button. Used only with wxAuiToolBar.
it: Specifica che verrà visualizzato un pulsante del menu a discesa accanto al pulsante dello strumento. Utilizzato solo con wxAuiToolBar.

source: tooltip
it: Descrizione
