Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libcommon.po
Languages: it

source: Common
it: Comuni

source: wxWidgets common controls
it: Controlli wxWidgets Comuni

source: name
it: Nome

source: style
it: Stile

source: Left-justifies the label. Windows and GTK+ only.
it: Giustifica a sinistra l'etichetta. Solo Windows e GTK.

source: Aligns the label to the top of the button. Windows and GTK+ only.
it: Allinea l'etichetta alla parte superiore del pulsante. Solo Windows e GTK.

source: Right-justifies the bitmap label. Windows and GTK+ only.
it: Giustifica a destra l'etichetta bitmap. Solo Windows e GTK.

source: Aligns the label to the bottom of the button. Windows and GTK+ only.
it: Allinea l'etichetta alla parte inferiore del pulsante. Solo Windows e GTK.

source: By default, all buttons are made of at least the standard button size, even if their contents is small enough to fit into a smaller size. This is done for consistency as most platforms use buttons of the same size in the native dialogs, but can be overridden by specifying this flag. If it is given, the button will be made just big enough for its contents. Notice that under MSW the button will still have at least the standard height, even with this style, if it has a non-empty label.
it: Per impostazione predefinita, tutti i pulsanti hanno almeno le dimensioni standard dei pulsanti, anche se il loro contenuto è sufficientemente piccolo da adattarsi a una dimensione più piccola. Questo viene fatto per coerenza poiché la maggior parte delle piattaforme utilizza pulsanti della stessa dimensione nelle finestre di dialogo native, ma può essere sovrascritto specificando questo flag. Se viene fornito, il pulsante sarà reso abbastanza grande per il suo contenuto. Nota che sotto MSW il pulsante avrà ancora almeno l'altezza standard, anche con questo stile, se ha un'etichetta non vuota.

source: Disables the display of the text label in the button even if it has one or its id is one of the standard stock ids with an associated label: without using this style a button which is only supposed to show a bitmap but uses a standard id would display a label too.
it: Disabilita la visualizzazione dell'etichetta di testo nel pulsante anche se ne ha uno o il suo id è uno degli id ​​stock standard con un'etichetta associata: senza usare questo stile un pulsante che dovrebbe mostrare solo una bitmap ma usa un id standard sarebbe visualizzare anche un'etichetta.

source: Creates a button without border. This is currently implemented in MSW, GTK2 and OSX/Cocoa and OSX/Carbon ports but in the latter only applies to buttons with bitmaps and using bitmap of one of the standard sizes only, namely 128*128, 48*48, 24*24 or 16*16. In all the other cases wxBORDER_NONE is ignored under OSX/Carbon (these restrictions don't exist in OSX/Cocoa however).
it: Crea un pulsante senza bordo. Questo è attualmente implementato nelle porte MSW, GTK2 e OSX/Cocoa e OSX/Carbon ma in quest'ultimo si applica solo ai pulsanti con bitmap e utilizzando bitmap di una sola delle dimensioni standard, ovvero 128*128, 48*48, 24*24 o 16*16. In tutti gli altri casi wxBORDER_NONE viene ignorato sotto OSX/Carbon (queste restrizioni non esistono comunque in OSX/Cocoa).

source: default
it: Predefinito

source: auth_needed
it: Richiesta Autorizzazione

source: Sets whether an authentication needed symbol should be displayed on the button. This method doesn't do anything if the platform is not Windows Vista or newer.
it: Imposta se sul pulsante deve essere visualizzato un simbolo di autenticazione necessaria. Questo metodo non fa nulla se la piattaforma non è Windows Vista o più recente.

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, quando si fa clic sul pulsante

source: Left-justifies the bitmap label.
it: Giustifica a sinistra l'etichetta bitmap.

source: Aligns the bitmap label to the top of the button.
it: Allinea l'etichetta bitmap alla parte superiore del pulsante.

source: Right-justifies the bitmap label.
it: Giustifica a destra l'etichetta bitmap.

source: Aligns the bitmap label to the bottom of the button.
it: Allinea l'etichetta bitmap alla parte inferiore del pulsante.

source: Align the text to the left.
it: Allinea il testo a sinistra.

source: Align the text to the right.
it: Allinea il testo a destra.

source: Center the text (horizontally).
it: Centra il testo (orizzontalmente).

source: By default, the control will adjust its size to exactly fit to the size of the text when SetLabel() is called. If this style flag is given, the control will not change its size (this style is especially useful with controls which also have the wxALIGN_RIGHT or the wxALIGN_CENTER_HORIZONTAL style because otherwise they won't make sense any longer after a call to SetLabel()).
it: Per impostazione predefinita, il controllo regolerà la sua dimensione per adattarsi esattamente alla dimensione del testo quando viene chiamato SetLabel(). Se viene dato questo flag di stile, il controllo non cambierà la sua dimensione (questo stile è particolarmente utile con i controlli che hanno anche lo stile wxALIGN_RIGHT o wxALIGN_CENTER_HORIZONTAL perché altrimenti non avranno più senso dopo una chiamata a SetLabel()).

source: If the labeltext width exceeds the control width, replace the beginning of the label with an ellipsis; uses wxControl::Ellipsize.
it: Se la larghezza del testo dell'etichetta supera la larghezza del controllo, sostituire l'inizio dell'etichetta con i puntini di sospensione; usa wxControl::Ellipsize.

source: If the label text width exceeds the control width, replace the middle of the label with an ellipsis; uses wxControl::Ellipsize.
it: Se la larghezza del testo dell'etichetta supera la larghezza del controllo, sostituire il centro dell'etichetta con i puntini di sospensione; usa wxControl::Ellipsize.

source: If the label text width exceeds the control width, replace the end of the label with an ellipsis; uses wxControl::Ellipsize.
it: Se la larghezza del testo dell'etichetta supera la larghezza del controllo, sostituire la fine dell'etichetta con i puntini di sospensione; usa wxControl::Ellipsize.

source: label
it: Etichetta

source: Simple markup can be used to apply different fonts or colours to different parts of the control label when supported. If markup is not supported by the control or platform, it is simply stripped and SetLabel() is used with the resulting string. Since 2.9.2.
it: Il markup semplice può essere utilizzato per applicare caratteri o colori diversi a parti diverse dell'etichetta di controllo, se supportato. Se il markup non è supportato dal controllo o dalla piattaforma, viene semplicemente rimosso e viene utilizzato SetLabel() con la stringa risultante. Dalla versione 2.9.2.

source: wrap
it: A Capo Automatico

source: Wraps the control's label so that each of its lines becomes at most this many pixels wide if possible (the lines are broken at words boundaries so it might not be the case if words are too long). If width is negative, no wrapping is done.
it: Avvolge l'etichetta del controllo in modo che ciascuna delle sue linee diventi al massimo questa larghezza di pixel, se possibile (le linee sono interrotte ai bordi delle parole, quindi potrebbe non essere il caso se le parole sono troppo lunghe). Se la larghezza è negativa, non viene eseguito alcun avvolgimento.

source: The control will generate the event wxEVT_COMMAND_TEXT_ENTER (otherwise pressing Enter key is either processed internally by the control or used for navigation between dialog controls).
it: Il controllo genererà l'evento wxEVT_COMMAND_TEXT_ENTER (altrimenti la pressione del tasto Invio viene elaborata internamente dal controllo o utilizzata per la navigazione tra i controlli di dialogo).

source: The control will receive wxEVT_CHAR events for TAB pressed - normally, TAB is used for passing to the next control in a dialog instead. For the control created with this style, you can still use Ctrl-Enter to pass to the next control from the keyboard.
it: Il controllo riceverà eventi wxEVT_CHAR per TAB premuto - normalmente, TAB viene invece utilizzato per passare al controllo successivo in una finestra di dialogo. Per il controllo creato con questo stile, puoi comunque usare Ctrl-Invio per passare al controllo successivo dalla tastiera.

source: The text control allows multiple lines.
it: Il controllo di testo consente più righe.

source: The text will be echoed as asterisks.
it: Il testo verrà echeggiato come asterischi.

source: The text will not be user-editable.
it: Il testo non sarà modificabile dall'utente.

source: Use rich text control under Windows, this allows to have more than 64KB of text in the control even under Win9x. This style is ignored under other platforms.
it: Usa il controllo rich text sotto Windows, questo permette di avere più di 64KB di testo nel controllo anche sotto Win9x. Questo stile viene ignorato su altre piattaforme.

source: Use rich text control version 2.0 or 3.0 under Windows, this style is ignored under other platforms.
it: Usa il controllo RTF versione 2.0 o 3.0 in Windows, questo stile viene ignorato in altre piattaforme.

source: Highlight the URLs and generate the wxTextUrlEvents when mouse events occur over them. This style is only supported for wxTE_RICH Win32 and multi-line wxGTK2 text controls.
it: Evidenzia gli URL e genera i wxTextUrlEvents quando si verificano eventi del mouse su di essi. Questo stile è supportato solo per i controlli di testo wxTE_RICH Win32 e multilinea wxGTK2.

source: By default, the Windows text control doesn't show the selection when it doesn't have focus - use this style to force it to always show it. It doesn't do anything under other platforms.
it: Per impostazione predefinita, il controllo di testo di Windows non mostra la selezione quando non ha lo stato attivo: usa questo stile per forzarlo a mostrarlo sempre. Non fa nulla su altre piattaforme.

source: A horizontal scrollbar will be created and used, so that text won't be wrapped. No effect under wxGTK1.
it: Verrà creata e utilizzata una barra di scorrimento orizzontale, in modo che il testo non venga avvolto. Nessun effetto sotto wxGTK1.

source: For multiline controls only: vertical scrollbar will never be created. This limits the amount of text which can be entered into the control to what can be displayed in it under MSW but not under GTK2. Currently not implemented for the other platforms.
it: Solo per i controlli multilinea: la barra di scorrimento verticale non verrà mai creata. Ciò limita la quantità di testo che può essere immessa nel controllo a ciò che può essere visualizzato in MSW ma non in GTK2. Attualmente non implementato per le altre piattaforme.

source: The text in the control will be left-justified (default).
it: Il testo nel controllo sarà giustificato a sinistra (impostazione predefinita).

source: The text in the control will be centered (currently wxMSW and wxGTK2 only).
it: Il testo nel controllo sarà centrato (attualmente solo wxMSW e wxGTK2).

source: The text in the control will be right-justified (currently wxMSW and wxGTK2 only).
it: Il testo nel controllo sarà giustificato a destra (attualmente solo wxMSW e wxGTK2).

source: Same as wxHSCROLL style: don't wrap at all, show horizontal scrollbar instead.
it: Uguale allo stile wxHSCROLL: non avvolgere affatto, mostra invece la barra di scorrimento orizzontale.

source: Wrap the lines too long to be shown entirely at any position (wxUniv and wxGTK2 only).
it: Avvolge le righe troppo lunghe per essere mostrate interamente in qualsiasi posizione (solo wxUniv e wxGTK2).

source: Wrap the lines too long to be shown entirely at word boundaries (wxUniv and wxGTK2 only).
it: Avvolge le righe troppo lunghe per essere mostrate interamente ai limiti delle parole (solo wxUniv e wxGTK2).

source: Wrap the lines at word boundaries or at any other character if there are words longer than the window width (this is the default).
it: Avvolge le righe ai limiti delle parole o a qualsiasi altro carattere se ci sono parole più lunghe della larghezza della finestra (questa è l'impostazione predefinita).

source: On PocketPC and Smartphone, causes the first letter to be capitalized.
it: Su PocketPC e Smartphone, fa sì che la prima lettera sia maiuscola.

source: value
it: Valore

source: maxlength
it: Lunghezza Massima

source: The maximum length of user-entered text. 0 means no limit. Note that in wxGTK this function may only be used with single line text controls.
it: La lunghezza massima del testo inserito dall'utente. 0 significa nessun limite. Nota che in wxGTK questa funzione può essere utilizzata solo con controlli di testo a riga singola.

source: Respond to a wxEVT_COMMAND_TEXT_UPDATED event, generated when the text changes. Notice that this event will always be sent when the text controls contents changes - whether this is due to user input or comes from the program itself (for example, if SetValue() is called.)
it: Risponde a un evento wxEVT_COMMAND_TEXT_UPDATED, generato quando il testo cambia. Si noti che questo evento verrà sempre inviato quando il testo controlla le modifiche al contenuto, sia che ciò sia dovuto all'input dell'utente o provenga dal programma stesso (ad esempio, se viene chiamato SetValue()).

source: Respond to a wxEVT_COMMAND_TEXT_ENTER event, generated when enter is pressed in a text control (which must have wxTE_PROCESS_ENTER style for this event to be generated).
it: Risponde a un evento wxEVT_COMMAND_TEXT_ENTER, generato quando si preme invio in un controllo di testo (che deve avere lo stile wxTE_PROCESS_ENTER per generare questo evento).

source: A mouse event occurred over an URL in the text control (wxMSW and wxGTK2 only)
it: Si è verificato un evento del mouse su un URL nel controllo di testo (solo wxMSW e wxGTK2)

source: User tried to enter more text into the control than the limit set by SetMaxLength.
it: L'utente ha tentato di immettere più testo nel controllo rispetto al limite impostato da SetMaxLength.

source: The default style: wxNO_BORDER.
it: Lo stile predefinito: wxNO_BORDER.

source: By default, the control will adjust its size to exactly fit to the size of the animation when SetAnimation is called. If this style flag is given, the control will not change its size.
it: Per impostazione predefinita, il controllo regolerà le sue dimensioni per adattarsi esattamente alla dimensione dell'animazione quando viene chiamato SetAnimation. Se viene dato questo flag di stile, il controllo non cambierà le sue dimensioni.

source: animation
it: Animazione

source: Full file path (only *.gif and *.ani files are supported).
it: Percorso file completo (sono supportati solo i file *.gif e *.ani).

source: inactive_bitmap
it: Bitmap Inattivo

source: play
it: Riproduzione

source: choices
it: Scelte

source: Contents of the Combo Box
it: Contenuto della Combo Box

source: selection
it: Selezione

source: Zero-based position of the selected choice.
it: Posizione in base zero della scelta selezionata.

source: Creates a combobox with a permanently displayed list. Windows only.
it: Crea una casella combinata con un elenco visualizzato in modo permanente. Solo Windows.

source: Creates a combobox with a drop-down list. MSW and Motif only.
it: Crea una casella combinata con un elenco a discesa. Solo MSW e Motif.

source: A combobox with this style behaves like a wxChoice (and may look in the same way as well, although this is platform-dependent), i.e. it allows the user to choose from the list of options but doesn't allow to enter a value not present in the list.
it: Una casella combinata con questo stile si comporta come una wxChoice (e può anche avere lo stesso aspetto, sebbene ciò dipenda dalla piattaforma), cioè consente all'utente di scegliere dall'elenco di opzioni ma non consente di inserire un valore non presente nell'elenco.

source: Sorts the entries in the list alphabetically.
it: Ordina le voci nell'elenco in ordine alfabetico.

source: Process a wxEVT_COMMAND_COMBOBOX_SELECTED event, when an item on the list is selected. Note that calling GetValue returns the new value of selection.
it: Elabora un evento wxEVT_COMMAND_COMBOBOX_SELECTED, quando viene selezionato un elemento nell'elenco. Si noti che la chiamata a GetValue restituisce il nuovo valore di selezione.

source: Process a wxEVT_COMMAND_TEXT_UPDATED event, when the combobox text changes.
it: Elabora un evento wxEVT_COMMAND_TEXT_UPDATED, quando il testo della casella combinata cambia.

source: Process a wxEVT_COMMAND_TEXT_ENTER event, when &lt;RETURN&gt; is pressed in the combobox.
it: Elabora un evento wxEVT_COMMAND_TEXT_ENTER, quando &lt;RETURN&gt; viene premuto nella casella combinata.

source: Process a wxEVT_COMBOBOX_DROPDOWN event, which is generated when the list box part of the combo box is shown (drops down). Notice that this event is only supported by wxMSW, wxGTK with GTK+ 2.10 or later, and wxOSX/Cocoa.
it: Elabora un evento wxEVT_COMBOBOX_DROPDOWN, che viene generato quando viene mostrata la parte della casella di riepilogo della casella combinata (a discesa). Nota che questo evento è supportato solo da wxMSW, wxGTK con GTK+ 2.10 o successivo e wxOSX/Cocoa.

source: Process a wxEVT_COMBOBOX_CLOSEUP event, which is generated when the list box of the combo box disappears (closes up). This event is only generated for the same platforms as wxEVT_COMBOBOX_DROPDOWN above. Also note that only wxMSW and wxOSX/Cocoa support adding or deleting items in this event.
it: Elabora un evento wxEVT_COMBOBOX_CLOSEUP, che viene generato quando la casella di riepilogo della casella combinata scompare (si chiude). Questo evento viene generato solo per le stesse piattaforme di wxEVT_COMBOBOX_DROPDOWN sopra. Si noti inoltre che solo wxMSW e wxOSX/Cocoa supportano l'aggiunta o l'eliminazione di elementi in questo evento.

source: Contents of the Combo Box. Use format bitmap:choice
it: Contenuto della casella combinata. Usa formato bitmap:scelta

source: Creates a combobox without a text editor. On some platforms the control may appear very different when this style is used.
it: Crea una casella combinata senza un editor di testo. Su alcune piattaforme il controllo può apparire molto diverso quando viene utilizzato questo stile.

source: The control will generate the event wxEVT_TEXT_ENTER (otherwise pressing Enter key is either processed internally by the control or used for navigation between dialog controls). Windows only.
it: Il controllo genererà l'evento wxEVT_TEXT_ENTER (altrimenti premendo il tasto Invio viene elaborato internamente dal controllo o utilizzato per la navigazione tra i controlli di dialogo). Solo finestre.

source: An array of strings with which to initialise the choice control.
it: Un array di stringhe con cui inizializzare il controllo di scelta.

source: Process a wxEVT_COMMAND_CHOICE_SELECTED event, when an item on the list is selected.
it: Elabora un evento wxEVT_COMMAND_CHOICE_SELECTED, quando viene selezionato un elemento nell'elenco.

source: Contents of the List Box.
it: Contenuto della casella di riepilogo.

source: Note that wxLB_SINGLE, wxLB_MULTIPLE and wxLB_EXTENDED styles are mutually exclusive and you can specify at most one of them (single selection is the default).
it: Notare che gli stili wxLB_SINGLE, wxLB_MULTIPLE e wxLB_EXTENDED si escludono a vicenda e puoi specificarne al massimo uno (la selezione singola è l'impostazione predefinita).

source: Single-selection list.
it: Elenco a selezione singola.

source: Multiple-selection list: the user can toggle multiple items on and off. This is the same as wxLB_EXTENDED in wxGTK2 port.
it: Elenco a selezione multipla: l'utente può attivare e disattivare più elementi. Questo è lo stesso di wxLB_EXTENDED nella porta wxGTK2.

source: Extended-selection list: the user can extend the selection by using SHIFT or CTRL keys together with the cursor movement keys or the mouse.
it: Elenco di selezione esteso: l'utente può estendere la selezione utilizzando i tasti SHIFT o CTRL insieme ai tasti di spostamento del cursore o al mouse.

source: Create horizontal scrollbar if contents are too wide (Windows only).
it: Crea una barra di scorrimento orizzontale se i contenuti sono troppo larghi (solo Windows).

source: Always show a vertical scrollbar.
it: Mostra sempre una barra di scorrimento verticale.

source: Only create a vertical scrollbar if needed.
it: Crea una barra di scorrimento verticale solo se necessario.

source: Don't create vertical scrollbar (wxMSW only).
it: Non creare una barra di scorrimento verticale (solo wxMSW).

source: The listbox contents are sorted in alphabetical order.
it: I contenuti della casella di riepilogo sono ordinati in ordine alfabetico.

source: Process a wxEVT_COMMAND_LISTBOX_SELECTED event, when an item on the list is selected.
it: Elabora un evento wxEVT_COMMAND_LISTBOX_SELECTED, quando viene selezionato un elemento nell'elenco.

source: Process a wxEVT_COMMAND_LISTBOX_DOUBLECLICKED event, when the listbox is double-clicked.
it: Elabora un evento wxEVT_COMMAND_LISTBOX_DOUBLECLICKED, quando si fa doppio clic sulla casella di riepilogo.

source: Multicolumn list view, with optional small icons. Columns are computed automatically, i.e. you don't set columns as in wxLC_REPORT. In other words, the list wraps, unlike a wxListBox.
it: Visualizzazione elenco a più colonne, con piccole icone opzionali. Le colonne vengono calcolate automaticamente, ovvero non si impostano le colonne come in wxLC_REPORT. In altre parole, l'elenco va a capo, a differenza di un wxListBox.

source: Single or multicolumn report view, with optional header.
it: Visualizzazione report a una o più colonne, con intestazione facoltativa.

source: The application provides items text on demand. May only be used with wxLC_REPORT.
it: L'applicazione fornisce il testo degli articoli su richiesta. Può essere utilizzato solo con wxLC_REPORT.

source: Large icon view, with optional labels.
it: Visualizzazione a icone grandi, con etichette opzionali.

source: Small icon view, with optional labels.
it: Visualizzazione a icone piccole, con etichette opzionali.

source: Icons align to the top. Win32 default, Win32 only.
it: Le icone sono allineate in alto. Win32 predefinito, solo Win32.

source: Icons align to the left.
it: Le icone si allineano a sinistra.

source: Icons arrange themselves. Win32 only.
it: Le icone si organizzano da sole. Solo Win32.

source: Labels are editable: the application will be notified when editing starts.
it: Le etichette sono modificabili: l'applicazione riceverà una notifica all'inizio della modifica.

source: No header in report mode.
it: Nessuna intestazione in modalità report.

source: Single selection (default is multiple).
it: Selezione singola (l'impostazione predefinita è multipla).

source: Sort in ascending order. (You must still supply a comparison callback in wxListCtrl::SortItems.)
it: Ordina in ordine crescente. (Devi comunque fornire un callback di confronto in wxListCtrl::SortItems.)

source: Sort in descending order. (You must still supply a comparison callback in wxListCtrl::SortItems.)
it: Ordina in ordine decrescente. (Devi comunque fornire un callback di confronto in wxListCtrl::SortItems.)

source: Draws light horizontal rules between rows in report mode.
it: Disegna righe orizzontali chiare tra le righe in modalità report.

source: Draws light vertical rules between columns in report mode.
it: Disegna regole verticali chiare tra le colonne in modalità report.

source: Begin dragging with the left mouse button.
it: Inizia a trascinare con il tasto sinistro del mouse.

source: Begin dragging with the right mouse button.
it: Inizia a trascinare con il tasto destro del mouse.

source: Begin editing a label. This can be prevented by calling Veto().
it: Inizia a modificare un'etichetta. Questo può essere evitato chiamando Veto().
