Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/libforms.po
Languages: it

source: Process a wxEVT_ACTIVATE event.
it: Elabora un evento wxEVT_ACTIVATE.

source: Process a wxEVT_ACTIVATE_APP event.
it: Elabora un evento wxEVT_ACTIVATE_APP.

source: Process a close event.
it: Elabora un evento di chiusura.

source: Process a hibernate event, supplying the member function. This event applies to wxApp only, and only on Windows SmartPhone and PocketPC. It is generated when the system is low on memory; the application should free up as much memory as possible, and restore full working state when it receives a wxEVT_ACTIVATE or wxEVT_ACTIVATE_APP event.
it: Elabora un evento di ibernazione, fornendo la funzione membro. Questo evento si applica solo a wxApp e solo su Windows SmartPhone e PocketPC. Viene generato quando il sistema ha poca memoria; l'applicazione dovrebbe liberare quanta più memoria possibile e ripristinare lo stato di funzionamento completo quando riceve un evento wxEVT_ACTIVATE o wxEVT_ACTIVATE_APP.

source: Process a wxEVT_ICONIZE event. Only available for the wxMSW, wxGTK ports.
it: Elabora un evento wxEVT_ICONIZE. Disponibile solo per le porte wxMSW, wxGTK.

source: Process a wxEVT_ICONIZE event. Currently this event is only generated in wxMSW, wxGTK and wxOSX/Cocoa ports.
it: Elabora un evento wxEVT_ICONIZE. Attualmente questo evento viene generato solo nelle porte wxMSW, wxGTK e wxOSX/Cocoa.

source: Process a wxEVT_SHOW event. Only available for the wxMSW, wxGTK ports.
it: Elabora un evento wxEVT_SHOW. Disponibile solo per le porte wxMSW, wxGTK.

source: Process a wxEVT_MOVE event, which is generated when a window is moved.
it: Elabora un evento wxEVT_MOVE, che viene generato quando una finestra viene spostata.

source: Process a wxEVT_MOVING event, which is generated while the user is moving the window. These events are currently only generated by wxMSW port.
it: Elabora un evento wxEVT_MOVING, che viene generato mentre l'utente sposta la finestra. Questi eventi sono attualmente generati solo dalla porta wxMSW.

source: Process a wxEVT_MOVE_START event, which is generated when the user starts to move or size a window. These events are currently only generated by wxMSW port.
it: Elabora un evento wxEVT_MOVE_START, che viene generato quando l'utente inizia a spostare o ridimensionare una finestra. Questi eventi sono attualmente generati solo dalla porta wxMSW.

source: Process a wxEVT_MOVE_END event, which is generated when the user stops moving or sizing a window. These events are currently only generated by wxMSW port.
it: Elabora un evento wxEVT_MOVE_END, che viene generato quando l'utente smette di spostare o ridimensionare una finestra. Questi eventi sono attualmente generati solo dalla porta wxMSW.

source: Process a wxEVT_IDLE event.
it: Elabora un evento wxEVT_IDLE.

source: Triggered when any button is pressed for any docked panes.
it: Si attiva quando viene premuto un pulsante per qualsiasi riquadro ancorato.

source: Triggered when a docked or floating pane is closed.
it: Attivato quando viene chiuso un riquadro ancorato o mobile.

source: Triggered when a pane is maximized.
it: Attivato quando un riquadro è ingrandito.

source: Triggered when a pane is restored.
it: Attivato quando viene ripristinato un riquadro.

source: Triggered when a pane is made 'active'. This event is new since wxWidgets 2.9.4.
it: Attivato quando un riquadro viene reso 'attivo'. Questo evento è nuovo da wxWidgets 2.9.4.

source: This event can be caught to override the default renderer in order to custom draw your wxAuiManager window (not recommended).
it: Questo evento può essere catturato per sovrascrivere il renderer predefinito al fine di disegnare in modo personalizzato la finestra wxAuiManager (non consigliato).

source: Defined as wxMINIMIZE_BOX | wxMAXIMIZE_BOX | wxRESIZE_BORDER | wxSYSTEM_MENU | wxCAPTION | wxCLOSE_BOX | wxCLIP_CHILDREN
it: Definito come wxMINIMIZE_BOX | wxMAXIMIZE_BOX | wxRESIZE_BORDER | wxSYSTEM_MENU | wxCAPTION | wxCLOSE_BOX | wxCLIP_CHILDREN

source: Display the frame iconized (minimized). Windows only.
it: Solo per Windows. Visualizza la cornice iconizzata (ridotta a icona).

source: Puts a caption on the frame.
it: Mette una didascalia sulla cornice.

source: Identical to wxICONIZE. Windows only.
it: Solo per Windows. Identico a wxICONIZE.

source: Displays a minimize box on the frame.
it: Visualizza una casella di riduzione a icona sulla cornice.

source: Displays the frame maximized. Windows only.
it: Solo per Windows. Visualizza la cornice ingrandita.

source: Displays a maximize box on the frame.
it: Visualizza una casella di ingrandimento sulla cornice.

source: Displays a close box on the frame.
it: Visualizza una casella di chiusura sulla cornice.

source: Stay on top of all other windows, see also wxFRAME_FLOAT_ON_PARENT.
it: Rimane in cima a tutte le altre finestre, vedi anche wxFRAME_FLOAT_ON_PARENT.

source: Displays a system menu.
it: Visualizza un menu di sistema.

source: Displays a resizeable border around the window.
it: Visualizza un bordo ridimensionabile intorno alla finestra.

source: Causes a frame with a small titlebar to be created; the frame does not appear in the taskbar under Windows or GTK+.
it: Fa sì che venga creato un frame con una piccola barra del titolo; il frame non appare nella barra delle applicazioni in Windows o GTK.

source: Creates an otherwise normal frame but it does not appear in the taskbar under Windows or GTK+ (note that it will minimize to the desktop window under Windows which may seem strange to the users and thus it might be better to use this style only without wxMINIMIZE_BOX style). In wxGTK, the flag is respected only if GTK+ is at least version 2.2 and the window manager supports _NET_WM_STATE_SKIP_TASKBAR hint. Has no effect under other platforms.
it: Crea un frame altrimenti normale ma non appare nella barra delle applicazioni sotto Windows o GTK (nota che verràridotto a icona nella finestra del desktop sotto Windows il che potrebbe sembrare strano agli utenti e quindi potrebbe essere meglio usare questo stile solo senza lo stile wxMINIMIZE_BOX ). In wxGTK, il flag è rispettato solo se GTK è almeno la versione 2.2 e il window manager supporta l'hint _NET_WM_STATE_SKIP_TASKBAR. Non ha effetto su altre piattaforme.

source: The frame will always be on top of its parent (unlike wxSTAY_ON_TOP). A frame created with this style must have a non-nullptr parent.
it: Il frame sarà sempre sopra il genitore (a differenza di wxSTAY_ON_TOP). Una cornice creata con questo stile deve avere un genitore non nullptr.

source: Windows with this style are allowed to have their shape changed with the SetShape method.
it: Le finestre con questo stile possono modificare la loro forma con il metodo SetShape.

source: Under Windows, puts a query button on the caption. When pressed, Windows will go into a context-sensitive help mode and wxWidgets will send a wxEVT_HELP event if the user clicked on an application window. You cannot use this style together with wxMAXIMIZE_BOX or wxMINIMIZE_BOX, so you should use wxDEFAULT_FRAME_STYLE &amp; ~ (wxMINIMIZE_BOX | wxMAXIMIZE_BOX) for the frames having this style (the dialogs don't have a minimize or a maximize box by default). Note: The Project's &quot;help_provider&quot; property must be set for context-sensitive help to work.
it: In Windows, inserisce un pulsante di query sulla didascalia. Quando viene premuto, Windows entrerà in una modalità di aiuto sensibile al contesto e wxWidgets invierà un evento wxEVT_HELP se l'utente ha fatto clic su una finestra dell'applicazione. Non puoi usare questo stile insieme a wxMAXIMIZE_BOX o wxMINIMIZE_BOX, quindi dovresti usare wxDEFAULT_FRAME_STYLE &amp; ~ (wxMINIMIZE_BOX | wxMAXIMIZE_BOX) per i frame che hanno questo stile (le finestre di dialogo non hanno una casella di minimizzazione o di ingrandimento per impostazione predefinita). Nota: l' &quot;help_provider&quot; del progetto La proprietà deve essere impostata affinché la guida sensibile al contesto funzioni.

source: On Mac OS X, frames with this style will be shown with a metallic look. This is an extra style.
it: Su Mac OS X, i frame con questo stile verranno mostrati con un aspetto metallico. Questo è uno stile in più.

source: Centers the dialog box on the display in the chosen direction.
it: Centra la finestra di dialogo sul display nella direzione scelta.

source: For XRC Only. Do not generate the first sizer if there is only one child.
it: Solo per XRC. Non generare il primo misuratore se c'è un solo figlio.

source: For C++ Only. The way how to declare and implement event handlers.
it: Solo per C++. Il modo in cui dichiarare e implementare gestori di eventi.

source: Only declare event handlers as pure virtual methods.
it: Dichiarare i gestori di eventi solo come metodi virtuali puri.

source: Declare event handlers but don't generate default implementation. Implementation should be done in separate .cpp file (Not in a generated!).
it: Dichiara i gestori di eventi ma non genera l'implementazione predefinita. L'implementazione dovrebbe essere eseguita in un file .cpp separato (non in un file generato!).

source: Declare event handlers as virtual methods and generate default implementation.
it: Dichiara i gestori di eventi come metodi virtuali e genera l'implementazione predefinita.

source: Manage this frame by AUI manager.
it: Gestisce questo frame dal gestore AUI.

source: Configure AUI manager.
it: Configura il gestore AUI.

source: Default behavior, combines: wxAUI_MGR_ALLOW_FLOATING | wxAUI_MGR_TRANSPARENT_HINT | wxAUI_MGR_HINT_FADE | wxAUI_MGR_NO_VENETIAN_BLINDS_FADE.
it: Comportamento predefinito, combina: wxAUI_MGR_ALLOW_FLOATING | wxAUI_MGR_TRANSPARENT_HINT | wxAUI_MGR_HINT_FADE | wxAUI_MGR_NO_VENETIAN_BLINDS_FADE.

source: Allow a pane to be undocked to take the form of a wxMiniFrame.
it: Consentire a un riquadro di essere sganciato per assumere la forma di un wxMiniFrame.

source: Change the color of the title bar of the pane when it is activated.
it: Cambia il colore della barra del titolo del riquadro quando è attivato.

source: Make the pane transparent during its movement.
it: Rendere trasparente il pannello durante il suo movimento.

source: The possible location for docking is indicated by a translucent area.
it: La possibile posizione per l'attracco è indicata da un'area traslucida.

source: The possible location for docking is indicated by gradually appearing partially transparent hint.
it: La possibile posizione per l'attracco è indicata dalla comparsa graduale di un suggerimento parzialmente trasparente.

source: The possible location for docking is indicated by a rectangular outline.
it: La possibile posizione per l'attracco è indicata da un contorno rettangolare.

source: The translucent area where the pane could be docked appears gradually.
it: L'area traslucida in cui è possibile ancorare il riquadro viene visualizzata gradualmente.

source: Used in complement of wxAUI_MGR_VENETIAN_BLINDS_HINT to show the docking hint immediately.
it: Utilizzato in complemento di wxAUI_MGR_VENETIAN_BLINDS_HINT per mostrare immediatamente il suggerimento di aggancio.

source: When a docked pane is resized, its content is refreshed in live (instead of moving the border alone and refreshing the content at the end).
it: Quando un riquadro agganciato viene ridimensionato, il suo contenuto viene aggiornato in tempo reale (invece di spostare solo il bordo e aggiornare il contenuto alla fine).

source: Process a wxEVT_INIT_DIALOG event. A wxEVT_INIT_DIALOG is sent as a dialog or panel is being initialised.
it: Elabora un evento wxEVT_INIT_DIALOG. Viene inviato un wxEVT_INIT_DIALOG durante l'inizializzazione di una finestra di dialogo o di un pannello.

source: Manage this panel by AUI manager.
it: Gestisce questo pannello dal gestore AUI.

source: Puts a caption on the dialog box.
it: Inserisce una didascalia nella finestra di dialogo.

source: Equivalent to a combination of wxCAPTION, wxCLOSE_BOX and wxSYSTEM_MENU (the last one is not used under Unix)
it: Equivalente a una combinazione di wxCAPTION, wxCLOSE_BOX e wxSYSTEM_MENU (l'ultimo non è utilizzato in Unix)

source: Display a resizeable frame around the window.
it: Visualizza una cornice ridimensionabile intorno alla finestra.

source: Display a system menu.
it: Visualizza un menu di sistema.

source: Displays a close box on the dialog.
it: Visualizza una casella di chiusura nella finestra di dialogo.

source: Displays a maximize box on the dialog.
it: Visualizza una casella di ingrandimento nella finestra di dialogo.

source: Displays a minimize box on the dialog.
it: Visualizza una casella di riduzione a icona nella finestra di dialogo.

source: The dialog stays on top of all other windows.
it: La finestra di dialogo rimane in primo piano rispetto a tutte le altre finestre.

source: By default, a dialog created with a nullptr parent window will be given the application's top level window as parent. Use this style to prevent this from happening and create an orphan dialog. This is not recommended for modal dialogs.
it: Per impostazione predefinita, a una finestra di dialogo creata con una finestra padre nullptr verrà assegnata la finestra di livello superiore dell'applicazione come padre. Usa questo stile per evitare che ciò accada e crea una finestra di dialogo orfana. Questo non è raccomandato per le finestre di dialogo modali.

source: Under Windows, puts a query button on the caption. When pressed, Windows will go into a context-sensitive help mode and wxWidgets will send a wxEVT_HELP event if the user clicked on an application window. Note: The Project's &quot;help_provider&quot; property must be set for context-sensitive help to work.
it: In Windows, inserisce un pulsante di query sulla didascalia. Quando viene premuto, Windows entrerà in una modalità di aiuto sensibile al contesto e wxWidgets invierà un evento wxEVT_HELP se l'utente ha fatto clic su una finestra dell'applicazione. Nota: l' &quot;help_provider&quot; del progetto La proprietà deve essere impostata affinché la guida sensibile al contesto funzioni.

source: Process a wxEVT_INIT_DIALOG event. A wxEVT_INIT_DIALOG is sent as a dialog or panel is being initialized.
it: Elabora un evento wxEVT_INIT_DIALOG. Viene inviato un wxEVT_INIT_DIALOG mentre viene inizializzata una finestra di dialogo o un pannello.

source: Manage this dialog by AUI manager.
it: Gestisce questa finestra di dialogo dal gestore AUI.

source: Bitmap to display on the left side of the wizard (default: none).
it: Bitmap da visualizzare sul lato sinistro della procedura guidata (impostazione predefinita: nessuna).

source: Shows a Help button using wxID_HELP.
it: Mostra un pulsante di aiuto utilizzando wxID_HELP.

source: The page has just been changed (this event cannot be vetoed).
it: La pagina è stata appena cambiata (questo evento non può essere posto il veto).

source: The page is being changed (this event can be vetoed).
it: La pagina è in fase di modifica (questo evento può essere posto il veto).

source: Called after Next is clicked but before GetNext is called. Unlike EVT_WIZARD_CHANGING, the handler for this function can change state that might affect the return value of GetNext. This event can be vetoed.
it: Chiamato dopo che viene fatto clic su Avanti ma prima che venga chiamato GetNext. A differenza di EVT_WIZARD_CHANGING, il gestore per questa funzione può modificare lo stato che potrebbe influire sul valore restituito di GetNext. Questo evento può essere posto il veto.

source: The page was shown and laid out (this event cannot be vetoed).
it: La pagina è stata mostrata e strutturata (questo evento non può essere posto il veto).

source: The user attempted to cancel the wizard (this event may also be vetoed).
it: L'utente ha tentato di annullare la procedura guidata (anche questo evento può essere posto il veto).

source: The wizard help button was pressed.
it: È stato premuto il pulsante della guida della procedura guidata.

source: The wizard finished button was pressed.
it: È stato premuto il pulsante Fine procedura guidata.

source: Page-specific bitmap (default: none).
it: Bitmap specifica della pagina (impostazione predefinita: nessuna).

source: Allows the menu bar to be detached (wxGTK only).
it: Consente di scollegare la barra dei menu (solo wxGTK).

source: Default size of each tool bitmap. The default bitmap size is 16 by 15 pixels.
it: Dimensione predefinita di ogni bitmap dello strumento. La dimensione della bitmap predefinita è 16 per 15 pixel.

source: Values to be used as margins for the toolbar.
it: Valori da utilizzare come margini per la barra degli strumenti.

source: Value used for spacing tools. Remarks: The packing is used for spacing in the vertical direction if the toolbar is horizontal, and for spacing in the horizontal direction if the toolbar is vertical.
it: Valore utilizzato per gli strumenti di spaziatura. Note: La spaziatura viene utilizzata per la spaziatura in direzione verticale se la barra degli strumenti è orizzontale e per la spaziatura in direzione orizzontale se la barra degli strumenti è verticale.

source: The default separator size. Remarks: This is the size between each toolbar tool.
it: La dimensione del separatore predefinita. Note: Questa è la dimensione tra ogni strumento della barra degli strumenti.

source: Gives the toolbar a flat look (Windows and GTK only).
it: Conferisce alla barra degli strumenti un aspetto piatto (solo Windows e GTK).

source: Makes the toolbar floatable and dockable (GTK only).
it: Rende la barra degli strumenti mobile e agganciabile (solo GTK).

source: Specifies horizontal layout.
it: Specifica il layout orizzontale.

source: Specifies vertical layout.
it: Specifica il layout verticale.

source: Shows the text in the toolbar buttons; by default only icons are shown.
it: Mostra il testo nei pulsanti della barra degli strumenti; per impostazione predefinita vengono visualizzate solo le icone.

source: Specifies no icons in the toolbar buttons; by default they are shown.
it: Non specifica alcuna icona nei pulsanti della barra degli strumenti; per impostazione predefinita vengono visualizzati.

source: Specifies no divider (border) above the toolbar (Windows only).
it: Non specifica alcun divisore (bordo) sopra la barra degli strumenti (solo Windows).

source: Specifies no alignment with the parent window (Windows only, not very useful).
it: Non specifica l'allineamento con la finestra principale (solo Windows, non molto utile).

source: Shows the text and the icons alongside, not vertically stacked (Windows and GTK 2 only). This style must be used with wxTB_TEXT.
it: Mostra il testo e le icone a fianco, non impilate verticalmente (solo Windows e GTK 2). Questo stile deve essere utilizzato con wxTB_TEXT.

source: Combination of wxTB_HORZ_LAYOUT and wxTB_TEXT.
it: Combinazione di wxTB_HORZ_LAYOUT e wxTB_TEXT.
