Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/liblayout.po
Languages: it

source: Layout
it: Disposizione

source: wxWidgets sizer layouts
it: Disposizione di ridimensionamento per wxWidgets

source: minimum_size
it: Dimensione Minima

source: Give the sizer a minimal size. Normally, the sizer will calculate its minimal size based purely on how much space its children need. After setting the minimal size, 'GetMinSize' will return either the minimal size as requested by its children or the minimal size set here, depending on which is bigger.
it: Provvede una dimensione minima al misuratore. Normalmente, il misuratore calcolerà la sua dimensione minima basandosi esclusivamente su quanto spazio hanno bisogno i suoi bambini. Dopo aver impostato la dimensione minima, 'GetMinSize' restituirà la dimensione minima richiesta dai suoi figli o la dimensione minima impostata qui, a seconda di quale è più grande.

source: border
it: Bordo

source: Determines the border width, if the flag parameter is set to include any border flag.
it: Determina la larghezza del bordo, se il parametro flag è impostato per includere qualsiasi flag di bordo.

source: Enable all borders
it: Abilita tutti i bordi

source: Enable the left border
it: Abilita il bordo sinistro

source: Enable the right border
it: Abilita il bordo destro

source: Enable the top border
it: Abilita il bordo superiore

source: Enable the bottom border
it: Abilita il bordo inferiore

source: The item will be expanded to fill the space assigned to the item.
it: L'elemento verrà espanso per riempire lo spazio assegnato all'elemento.

source: The item will be expanded as much as possible while also maintaining its aspect ratio.
it: L'elemento verrà espanso il più possibile mantenendo anche le sue proporzioni.

source: Normally wxSizers will use GetAdjustedBestSize to determine what the minimal size of window items should be, and will use that size to calculate the layout. This allows layouts to adjust when an item changes and its best size becomes different. If you would rather have a window item stay the size it started with then use wxFIXED_MINSIZE.
it: Normalmente wxSizers utilizzerà GetAdjustedBestSize per determinare quale dovrebbe essere la dimensione minima degli elementi della finestra e utilizzerà quella dimensione per calcolare il layout. Ciò consente ai layout di adattarsi quando un elemento cambia e la sua dimensione migliore diventa diversa. Se preferisci che un elemento della finestra mantenga le dimensioni con cui è iniziato, usa wxFIXED_MINSIZE.

source: Normally wxSizers don't allocate space for hidden windows or other items. This flag overrides this behaviour so that sufficient space is allocated for the window even if it isn't visible. This makes it possible to dynamically show and hide controls without resizing parent dialog, for example. (Available since 2.8.8.)
it: Normalmente i wxSizer non allocano spazio per finestre nascoste o altri elementi. Questo flag sovrascrive questo comportamento in modo che venga allocato spazio sufficiente per la finestra anche se non è visibile. Ciò rende possibile mostrare e nascondere dinamicamente i controlli senza ridimensionare la finestra di dialogo padre, ad esempio. (Disponibile dal 2.8.8.)

source: Align the item to the left of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'articolo a sinistra dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: Align the item to the top of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'articolo alla parte superiore dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: Align the item to the right of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'articolo a destra dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: Align the item to the bottom of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'articolo alla parte inferiore dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: Align the item to the center of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'articolo al centro dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: Align the item to the horizontal center of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'oggetto al centro orizzontale dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: Align the item to the vertical center of the space allotted to it by the sizer, adjusted for the border if any.
it: Allineare l'articolo al centro verticale dello spazio assegnatogli dal misuratore, regolato per il bordo se presente.

source: proportion
it: Proporzione

source: How much this control will stretch in proportion to the other controls in the same sizer. Set to 0 to prevent stretching.
it: Quanto questo controllo si allungherà in proporzione agli altri controlli nello stesso misuratore. Impostare su 0 per evitare l'allungamento.

source: row
it: Riga

source: Row for the item.
it: Riga per l'elemento.

source: column
it: Colonna

source: Column for the item.
it: Colonna per l'elemento.

source: rowspan
it: Intervallo Righe

source: The number of rows that the item spans.
it: Il numero di righe su cui si estende l'elemento.

source: colspan
it: Intervallo Colonne

source: The number of columns that the item spans.
it: Il numero di colonne su cui si estende l'elemento.

source: name
it: Nome

source: orient
it: Orientamento

source: Align items vertically
it: Allinea gli elementi verticalmente

source: Align items horizontally
it: Allinea gli elementi orizzontalmente

source: label
it: Etichetta

source: parent
it: Genitore

source: Use encapsulated wxStaticBox as a parent of managed children (recommended for wxWidgets 2.9.1 and later).
it: Usa wxStaticBox incapsulato come genitore di figli gestiti (consigliato per wxWidgets 2.9.1 e versioni successive).

source: Process a wxEVT_UPDATE_UI event.
it: Elabora un evento wxEVT_UPDATE_UI.

source: flags
it: Flag

source: The last item on each line will use any remaining space on that line
it: L'ultimo elemento su ogni riga utilizzerà lo spazio rimanente su quella riga

source: Removes any spacer elements from the beginning of a row
it: Rimuove qualsiasi elemento distanziatore dall'inizio di una riga

source: A combination of wxEXTEND_LAST_ON_EACH_LINE and wxREMOVE_LEADING_SPACES
it: Una combinazione di wxEXTEND_LAST_ON_EACH_LINE e wxREMOVE_LEADING_SPACES

source: rows
it: Righe

source: Number of Rows. '0' tells wxWidgets to calculate the number of rows required to hold the supplied items. If you choose to fix the row number, set the 'cols' figure to zero instead.
it: Numero di righe. '0' indica a wxWidgets di calcolare il numero di righe richieste per contenere gli elementi forniti. Se scegli di correggere il numero di riga, imposta invece la cifra 'cols' su zero.

source: cols
it: Colonne

source: Number of Columns
it: Numero di colonne

source: vgap
it: Divario Verticale

source: The vertical gap (in pixels) between the cells in the sizer.
it: Lo spazio verticale (in pixel) tra le celle nel sizer.

source: hgap
it: Divario Orizzontale

source: The horizontal gap (in pixels) between cells in the sizer.
it: Lo spazio orizzontale (in pixel) tra le celle nel sizer.

source: growablerows
it: Righe Allargabili

source: Comma separated list of row indices (starting from zero, optional proportion appended after a colon) that should be grown if there is extra space available to the sizer.
it: Elenco separato da virgole di indici di riga (a partire da zero, proporzione facoltativa aggiunta dopo i due punti) che dovrebbe essere ampliato se c'è spazio extra disponibile per il misuratore.

source: growablecols
it: Colonne Allargabili

source: Comma separated list of column indices (starting from zero, optional proportion appended after a colon) that should be grown if there is extra space available to the sizer.
it: Elenco separato da virgole di indici di colonna (a partire da zero, proporzione facoltativa aggiunta dopo i due punti) che dovrebbe essere ampliato se c'è spazio extra disponibile per il dimensionatore.

source: flexible_direction
it: Direzione Flessibile

source: Since wxWidgets 2.5.0, wxFlexGridSizer can size items equally in one direction but unequally ('flexibly') in the other
it: Da wxWidgets 2.5.0, wxFlexGridSizer può ridimensionare gli elementi in modo uguale in una direzione ma in modo diseguale ("flessibile") nell'altra

source: Rows are flexibly sized.
it: Le righe sono dimensionate in modo flessibile.

source: Columns are flexibly sized.
it: Le colonne sono dimensionate in modo flessibile.

source: Both rows and columns are flexibly sized (this is the default value).
it: Sia le righe che le colonne hanno dimensioni flessibili (questo è il valore predefinito).

source: non_flexible_grow_mode
it: Modalità Allargamento Non Flessibile

source: If the sizer is only flexible in one direction (this can be changed using 'flexible_direction'), it needs to be decided how the sizer should grow in the other ('non flexible') direction in order to fill the available space.
it: Se il sizer è flessibile solo in una direzione (questo può essere cambiato usando 'flexible_direction'), è necessario decidere come il sizer dovrebbe crescere nell'altra direzione ('non flessibile') per riempire lo spazio disponibile.

source: Sizer doesn't grow in the non flexible direction.
it: Sizer non cresce nella direzione non flessibile.

source: Sizer honors growable columns/rows set with AddGrowableCol and AddGrowableRow. In this case equal sizing applies to minimum sizes of columns or rows (this is the default value).
it: Sizer rispetta colonne/righe espandibili impostate con AddGrowableCol e AddGrowableRow. In questo caso le dimensioni uguali si applicano alle dimensioni minime di colonne o righe (questo è il valore predefinito).

source: Sizer equally stretches all columns or rows in the non flexible direction, whether they are growable or not in the flexible direction.
it: Sizer estende equamente tutte le colonne o righe nella direzione non flessibile, indipendentemente dal fatto che siano espandibili o meno nella direzione flessibile.

source: empty_cell_size
it: Dimensioni Cella Vuota

source: The size used for cells in the grid with no item.
it: La dimensione utilizzata per le celle nella griglia senza elementi.

source: Include the 'OK' button
it: Includere il pulsante "OK"

source: Yes
it: Sì

source: Include the 'Yes' button
it: Includi il pulsante "Sì"

source: Save
it: Salva

source: Include the 'Save' button
it: Includere il pulsante "Salva"

source: Apply
it: Applica

source: Include the 'Apply' button
it: Includi il pulsante "Applica"

source: Include the 'No' button
it: Includere il pulsante "No"

source: Cancel
it: Annulla

source: Include the 'Cancel' button
it: Includere il pulsante "Annulla"

source: Help
it: Guida

source: Include the 'Help' button
it: Includi il pulsante "Aiuto"

source: ContextHelp
it: Guida Contestuale

source: Include the 'ContextHelp' button
it: Includi il pulsante "ContextHelp"

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_OK, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_OK, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_YES, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_YES, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_SAVE, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_SAVE, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_APPLY, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_APPLY, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_NO, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_NO, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_CANCEL, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_CANCEL, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_HELP, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_HELP, quando si fa clic sul pulsante

source: Process a wxEVT_COMMAND_BUTTON_CLICKED event, for the ID wxID_CONTEXT_HELP, when the button is clicked
it: Elabora un evento wxEVT_COMMAND_BUTTON_CLICKED, per l'ID wxID_CONTEXT_HELP, quando si fa clic sul pulsante

source: width
it: Larghezza

source: The width of the spacer
it: La larghezza del distanziatore

source: height
it: Altezza

source: The height of the spacer
it: L'altezza del distanziatore
