Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/wxweaver.po
Languages: it

source: to a file so that you can distribute the headers among the "precompiled_header"
it: in un file in modo da poter distribuire gli header fra le proprietà "precompiled_header"

source: and "subclass" properties?
it: e "subclass"?

source: The "user_headers" property has been removed
it: La proprietà "user_headers" è stata rimossa

source: Save "user_headers"
it: Salva "user_headers"

source: All files
it: Tutti i file

source: Please select a form and try again.
it: Per favore, scegli un form e riprova.

source: XRC Preview
it: Anteprima XRC

source: About...
it: Informazioni...

source: &Yes
it: &Sì

source: Don't annoy me again!
it: Non chiedermelo più!

source: Instructions
it: Istruzioni

source: 1. Check the forms you would like to create the inherited class for. 2. You can edit individual class details by clicking on their names in the list and then: 2a. Edit the 'Class Name:' as required. 2b. Edit the 'File Names: (.h/.cpp)' as required. 3. Click 'OK'.
it: 1. Seleziona i form per i quali desideri creare le classi eredi. 2. Puoi modificare le proprieta' di ciascuna classe selezionandole nella lista e poi: 2a. Cambia 'Nome Classe:' come richiesto. 2b. Cambia 'Nomi File: (.h/.cpp/.py)' come richiesto. 3. Clicca 'OK'.

source: Class Details
it: Dettagli Classe

source: Class Name:
it: Nome Classe:

source: File Names: (.cpp/.h)
it: Nomi File: (.cpp/.h)

source: Generate Inherited Class
it: Genera Classe Ereditata

source: Menu Editor
it: Editor dei Menu

source: Label
it: Etichetta

source: Shortcut
it: Collegamento

source: Name
it: Nome

source: Help String
it: Stringa Aiuto

source: Kind
it: Tipo

source: Menu item
it: Oggetto Menu

source: &Add
it: &Aggiungi

source: &Modify
it: &Modifica

source: &Remove
it: &Elimina

source: Add &Separator
it: Aggiungi &Separatore

source: &Up
it: &Su

source: &Down
it: &Giù

source: The children of the selected item will be eliminated too. Are you sure you want to continue?
it: Gli oggetti figlio della voce selezionata verranno eliminati anch'essi. Sicuro di voler continuare?

source: Font
it: Carattere

source: Invisible
it: Invisibile

source: Always
it: Sempre

source: After Indent
it: Dopo Indentazione

source: Only In Indent
it: Solo In Indentazione

source: Display
it: Visualizza

source: View Whitespace:
it: Visualizza spazi bianchi:

source: View EOL
it: Visualizza Fine Linea

source: Indentation
it: Indentazione

source: Use Tabs
it: Usa Tabulazioni

source: Tabs Indents
it: Tab Indenta

source: Show Indentation Guides
it: Visualizza Guide Indentazione

source: Indent Size:
it: Dimensione Rientro:

source: Tabs Width:
it: Larghezza Tab:

source: Misc
it: Varie

source: Caret Width:
it: Larghezza Cursore:

source: Locale
it: Lingua

source: Enable Localization
it: Abilita Traduzioni

source: System Default
it: Predefinito Di Sistema

source: English
it: Inglese

source: English (U.S.)
it: Inglese (US)

source: German
it: Tedesco

source: Italian
it: Italiano

source: Editor
it: Editore

source: WARNING - For XRC Developers ONLY!!
it: ATTENZIONE: SOLO Per Sviluppatori XRC!!

source: The XRC language is not as powerful as C++. It has limitations that will affect the GUI layout. This preview will ONLY show how the generated XRC will look, and it will probably be different from the Designer. If you are not using XRC, do NOT use the XRC preview, it will only confuse you.
it: Il linguaggio XRC non è potente quanto C++. Presenta delle limitazioni che possono incidere sul layout della GUI Questa anteprima potrà SOLO visualizzare come il codice XRC generato apparirà, probabilmente differente da quello del Designer. Se non usi XRC, NON usare l'anteprima XRC, potrà solo confonderti.

source: Save Project
it: Salva Progetto

source: wxWeaver Project File
it: File Progetto wxWeaver

source: The file already exists. Do you want to replace it?
it: File già esistente. Vuoi sovrascriverlo?

source: Overwrite the file
it: Sovrascrivi file

source: Open Project
it: Apri Progetto

source: The project file '%s' doesn't exist. Would you like to remove it from the recent files list?
it: Il file di progetto '%s' non esiste. Vuoi eliminarlo dalla lista dei file recenti?

source: Open recent project
it: Apri progetto recente

source: Import XRC file
it: Importa file XRC

source: Project Loaded!
it: Progetto Caricato!

source: Name: %s | Class: %s
it: Nome: %s | Classe: %s

source: Project Saved!
it: Progetto Salvato!

source: Object
it: Oggetto

source: Selected!
it: Selezionato!

source: Object '%s' of class '%s' created.
it: Oggetto '%s' della classe '%s' creato.

source: Object '%s' removed.
it: Oggetto '%s' rimosso.

source: Property Modified!
it: Proprietà Modificata!

source: Edit
it: Modifica

source: Designer
it: Editore

source: Class(es) generated to '%s'.
it: Classe(i) generata(e) in '%s'.

source: Current project file has been modified... Do you want to save the changes?
it: Il progetto corrente e' stato modificato. Vuoi salvare le modifiche?

source: Save project
it: Salva progetto

source: Find
it: Cerca

source: &New Project Ctrl+N
it: &Nuovo Progetto Ctrl+N

source: Create an empty project
it: Crea un progetto vuoto

source: &Open... Ctrl+O
it: &Apri Progetto (Ctrl+O)

source: Open a project
it: Apri un progetto

source: &Save Ctrl+S
it: &Salva Ctrl+S

source: Save current project
it: Salva progetto corrente

source: Save &As... Ctrl-Shift+S
it: Salva &Come... Ctrl-Shift+S

source: Save current project as...
it: Salva progetto corrente come...

source: &Import XRC...
it: &Importa XRC...

source: &Generate Code F8
it: &Genera Codice F8

source: Generate Code
it: Genera Codice

source: E&xit Alt-F4
it: Esci Alt+F4

source: Quit wxWeaver
it: Chiudi wxWeaver

source: &Undo Ctrl+Z
it: &Annulla Ctrl+Z

source: Undo changes
it: Annulla modifiche

source: &Redo Ctrl+Y
it: &Ripeti Ctrl+Y

source: Redo changes
it: Ripeti modifiche

source: &Copy Ctrl+C
it: &Copia Ctrl+C

source: Copy selected object
it: Copia oggetto selezionato

source: Cut Ctrl+X
it: Taglia Ctrl+X

source: Cut selected object
it: Taglia oggetto selezionato

source: &Paste Ctrl+V
it: &Incolla Ctrl+V

source: Paste on selected object
it: Incolla oggetto selezionato

source: &Delete Ctrl+D
it: &Elimina Ctrl+D

source: Delete selected object
it: Elimina oggetto selezionato

source: Copy Object To Clipboard Ctrl+Shift+C
it: Copia Oggetto Nella Clipboard Ctrl+Shift+C

source: Copy Object to Clipboard
it: Copia Oggetto Nella Clipboard

source: Paste Object From Clipboard Ctrl+Shift+V
it: Incolla Oggetto Dalla Clipboard Ctrl+Shift+V

source: Paste Object from Clipboard
it: Incolla Oggetto Dalla Clipboard

source: Toggle &Expand Alt+W
it: Scambia &Espandi Alt+W

source: Toggle wxEXPAND flag of sizeritem properties
it: Scambia la proprieta' wxEXPAND di un sizeritem

source: Toggle &Stretch Alt+S
it: Scambia Allunga Alt+S

source: Toggle option property of sizeritem properties
it: Scambia la proprieta' proportion di un sizeritem

source: Move Up Alt+Up
it: Sposta Su Alt+Up

source: Move Up selected object
it: Sposta l'oggetto selezionato verso l'alto

source: Move Down Alt+Down
it: Sposta Giù Alt+Down

source: Move Down selected object
it: Sposta l'oggetto selezionato verso il basso

source: Move Left Alt+Left
it: Sposta Sinistra Alt+Left

source: Move Left selected object
it: Sposta a sinistra l'oggetto selezionato

source: Move Right Alt+Right
it: Sposta Destra Alt+Right

source: Move Right selected object
it: Sposta a destra l'oggetto selezionato

source: &Find Ctrl+F
it: &Cerca Ctrl+F

source: Find text in the active code viewer
it: Ricerca nel testo dell'editor di codice corrente

source: Align &Left Alt+Shift+Left
it: Allinea &Sinistra Alt+Shift+Left

source: Align item to the left
it: Allinea l'oggetto a sinistra

source: Align Center &Horizontal Alt+Shift+H
it: Allinea Centrato &Orizzontalmente Alt+Shift+H

source: Align item to the center horizontally
it: Allinea l'oggetto al centro orizzontalmente

source: Align &Right Alt+Shift+Right
it: Allinea &Destra Alt+Shift+Right

source: Align item to the right
it: Allinea l'oggetto a destra

source: Align &Top Alt+Shift+Up
it: Allinea Sop&ra Alt+Shift+Up

source: Align item to the top
it: Allinea l'oggetto nel punto superiore

source: Align Center &Vertical Alt+Shift+V
it: Allinea Centrato &Verticalmente Alt+Shift+V

source: Align item to the center vertically
it: Allinea l'oggetto al centro verticalmente

source: Align &Bottom Alt+Shift+Down
it: Allinea So&tto Alt+Shift+Down

source: Align item to the bottom
it: Allinea l'oggetto nel punto inferiore

source: Preferences Alt+O
it: Preferenze Alt+O

source: &XRC Preview F5
it: Anteprima &XRC F5

source: Show a preview of the XRC window
it: Visualizza l'anteprima della finestra XRC

source: &Swap The Editor and Properties Window F12
it: &Scambia Pannelli Editor e Proprietà F12

source: Swap The Editor and Properties Window
it: Scambia i pannelli Editor e Proprietà

source: &Generate Inherited Class F6
it: &Genera Classe Ereditata F6

source: Creates the needed files and class for proper inheritance of your designed GUI
it: Crea i file delle classi eredi che verranno utilizzate nel tuo progetto GUI

source: &About... F1
it: Informazioni F1

source: Show about dialog
it: Mostra la finestra delle informazioni sul programma

source: &Edit
it: &Modifica

source: &View
it: &Visualizza

source: &Tools
it: &Strumenti

source: New Project
it: Nuovo Progetto

source: New Project (Ctrl+N)
it: Nuovo Progetto/t(Ctrl+N)

source: Start a new project.
it: Inizia un nuovo progetto.

source: Open Project (Ctrl+O)
it: Apri Progetto/t(Ctrl+N)

source: Open an existing project.
it: Apre un progetto esistente.

source: Save Project (Ctrl+S)
it: Salva Progetto/t(Ctrl+N)

source: Save the current project.
it: Salva il progetto corrente.

source: Undo
it: Annulla

source: Undo (Ctrl+Z)
it: Annulla Ctrl+Z

source: Undo the last action.
it: Annulla l'ultima operazione.

source: Redo
it: Ripeti

source: Redo (Ctrl+Y)
it: &Ripeti Ctrl+Y

source: Redo the last action that was undone.
it: Ripete l'ultima azione annullata.

source: Cut
it: Taglia

source: Cut (Ctrl+X)
it: Taglia (Ctrl+X)

source: Remove the selected object and place it on the clipboard.
it: Rimuove l'oggetto selezionato e lo copia negli appunti.

source: Copy
it: Copia

source: Copy (Ctrl+C)
it: Copia (Ctrl+C)

source: Copy the selected object to the clipboard.
it: Copia l'oggetto selezionato negli appunti.

source: Paste
it: Incolla

source: Paste (Ctrl+V)
it: Incolla (Ctrl+V)

source: Insert an object from the clipboard.
it: Inserisce l'oggetto dagli appunti.

source: Delete
it: Elimina

source: Delete (Ctrl+D)
it: Elimina (Ctrl+D)

source: Remove the selected object.
it: Elimina l'oggetto selezionato.

source: Generate Code (F8)
it: Genera Codice (F8)

source: Create code from the current project.
it: Crea il codice dal progetto corrente.

source: Align Left
it: Allinea Sinistra

source: The item will be aligned to the left of the space alotted to it by the sizer.
it: L'oggetto verra' allineato a sinistra nello spazio assegnato dal sizer.

source: Align Center Horizontally
it: Allinea Centrato Orizzontalmente

source: The item will be centered horizontally in the space alotted to it by the sizer.
it: L'oggetto verra' centrato orizzontalmente nello spazio assegnato dal sizer.

source: Align Right
it: Allinea Destra

source: The item will be aligned to the right of the space alotted to it by the sizer.
it: L'oggetto verra' allineato a destra nello spazio assegnato dal sizer.

source: Align Top
it: Allinea Sopra

source: The item will be aligned to the top of the space alotted to it by the sizer.
it: L'oggetto verra' allineato in alto nello spazio assegnato dal sizer.

source: Align Center Vertically
it: Allinea Centrato Verticalmente

source: The item will be centered vertically within space alotted to it by the sizer.
it: L'oggetto verra' centrato verticalmente nello spazio assegnato dal sizer.

source: Align Bottom
it: Allinea Sotto

source: The item will be aligned to the bottom of the space alotted to it by the sizer.
it: L'oggetto verra' allineato in basso nello spazio assegnato dal sizer.

source: Expand (Alt+W)
it: Espandi (Alt+W)

source: The item will be expanded to fill the space assigned to the item.
it: L'oggetto verra' espanso nel proprio spazio assegnato.

source: Stretch (Alt+S)
it: Allunga (Alt+S)

source: The item will grow and shrink with the sizer.
it: L'oggetto aumentera' e diminuira' la sua dimensione in base al sizer.

source: Left Border
it: Bordo Sinistro

source: A border will be added on the left side of the item.
it: Verra' aggiunto un bordo alla sinistra dell'oggetto.

source: Right Border
it: Bordo Destro

source: A border will be added on the right side of the item.
it: Verrà aggiunto un bordo alla destra dell'oggetto.

source: Top Border
it: Bordo Sopra

source: A border will be added on the top of the item.
it: Verrà aggiunto un bordo sul lato superiore dell'oggetto.

source: Bottom Border
it: Bordo Sotto

source: A border will be added on the bottom of the item.
it: Verrà aggiunto un bordo nel lato inferiore dell'oggetto.

source: Swap The Editor and Properties Window (F12)
it: Scambia Pannelli Editor e Proprietà (F12)

source: Swap the design window and properties window.
it: Scambia i pannelli Editor e Proprietà.

source: Project
it: Progetto

source: Widgets
it: Controlli

source: Properties
it: Proprietà

source: Logger
it: Registro

source: "%s" not found!
it: "%s" non trovato!

source: Not Found!
it: Non Trovato!

source: Code generated on '%s'.
it: Codice generato in '%s'.

source: Error:
it: Errore:

source: Warning:
it: Avviso:

source: Load From File: Load the image from a file on disk. Load From Embedded File: C++ Only. Embed the image file in the exe and load it. For other languages, behaves like "Load From File". Load From Resource: Windows Only. Load the image from a BITMAP resource in a .rc file Load From Icon Resource: Windows Only. Load the image from a ICON resource in a .rc file Load From XRC: Load the image from XRC resources. The XRC resources must be initialized by the application code. Load From Art Provider: Query registered providers for bitmap with given ID.
it: Carica Da File: Carica l'immagine da un file su disco. Carica Da File Incorporato: Solo per C++. Incorpora il file immagine all'interno dell'eseguibile caricandolo.n Per gli altri linguaggi si comporta come "Carica Da File". Carica Da Risorsa: Solo per Windows. Carica l'immagine da una risorsa BITMAP contenuta in un file .rc. Carica Da Risorsa Icona: Solo per Windows. Carica l'immagine da una risorsa ICON contenuta in un file .rc. Carica Da Art Provider: Interroga i provider registrati per un bitmap di un dato ID.

source: Path to the image file.
it: Percorso del file immagine.

source: Windows Only. Name of the resource in the .rc file.
it: Solo per Windows. Nome della risorsa contenuta in un file .rc.

source: The size of the icon to use from a ICON resource with multiple icons in it.
it: La grandezza dell'icona da usare da una risorsa ICON contenente multiple icone.

source: Name of the item in the XRC resources.
it: Nome dell'oggetto nelle risorse XRC.

source: Choose a wxArtID unique identifier of the bitmap or enter a wxArtID for your custom wxArtProvider. IDs with prefix 'gtk-' are available under wxGTK only.
it: Scegli un identificatore univoco wxArtID per l'immagine bitmap o inserisci un wxArtID per il tuo wxArtProvider personalizzato.

source: Choose a wxArtClient identifier of the client (i.e. who is asking for the bitmap) or enter a wxArtClient for your custom wxArtProvider.
it: Scegli un identificatore wxArtClient per il client, ovvero il contesto dove verrà usato per visualizzare l'immagine bitmap, o inseriscine uno per il tuo wxArtProvider personalizzato.

source: Point Size
it: Dimensione

source: Family
it: Famiglia

source: Face Name
it: Nome

source: Style
it: Stile

source: Weight
it: Peso

source: Underlined
it: Sottolineato

source: Events
it: Eventi

source: You have to remove all child widgets first.
it: Devi prima rimuovere tutti i controlli inseriti.

source: No title
it: Nessun titolo

source: Copy Ctrl+C
it: Copia Ctrl+C

source: Paste Ctrl+V
it: Incolla Ctrl+V

source: Delete Ctrl+D
it: Elimina Ctrl+D

source: Move into a new wxBoxSizer
it: Sposta in un nuovo wxBoxSizer

source: Menu Editor...
it: Editor dei Menu...

source: First Page
it: Prima Pagina

source: Sample Category
it: Categoria Di Prova

source: Initial Value
it: Valore Iniziale

source: A string property
it: Proprietà di stringa

source: Herbivore
it: Erbivoro

source: Carnivore
it: Carnivoro

source: Omnivore
it: Onnivoro

source: Low Priority Properties
it: Proprietà Bassa Priorità

source: This is much longer string than the
it: Questa è una stringa più lunga della

source: first one. Edit it by clicking the button.
it: prima. Modificala premendo il pulsante.

source: Message ...
it: Messaggio ...

source: Choose an Encoding
it: Scegli una Codifica

source: This xml file has no declaration.
it: Questo file XML non contiene una dichiarazione.

source: Would you like wxWeaver to backup the file and convert it to UTF-8?
it: Creo un file di backup e converto questo in UTF-8?

source: You will be prompted for an encoding.
it: Ti verra' richiesta una scelta di codifica.

source: Path:
it: Percorso:

source: Missing Declaration
it: Dichiarazione Mancante

source: Please choose the original encoding.
it: Per favore, scegli la codifica originaria.

source: This xml file has no encoding specified.
it: Questo file XML non ha una codifica specificata.

source: Unknown Encoding
it: Codifica Sconosciuta

source: The encoding of this xml file is not supported. File: %s Encoding: %s Supported Encodings: %s
it: La codifica di questo file XML non è supportata. File: %s Codifica: %s Codifiche supportate: %s

source: Unsupported Encoding: %s
it: Codifica non supportata: %s

source: This xml file has specified encoding %s. wxWeaver only works with UTF-8.
it: Questo file XML usa la codifica %s: wxWeaver supporta solamente UTF-8.

source: Would you like wxWeaver to backup the file and convert it to UTF-8?
it: Vuoi che esagua un backup del file e lo converta in UTF-8?

source: Not UTF-8
it: Non UTF-8

source: This xml file could not be loaded. This could be the result of an unsupported encoding.
it: Impossibile caricare questo file XML. Probabile codifica non supportata.

source: You will be prompted for the original encoding.
it: Ti verrà richiesta la codifica originale.

source: Unable to load file
it: Impossibile caricare il file

source: Before:
it: Prima:

source: After:
it: Dopo:
