Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/wxweaver.po
Languages: it

source: default
it: Predefinito

source: Default objects, do not edit this file
it: Oggetti predefiniti, non modificare questo file

source: name
it: Nome

source: path
it: Percorso

source: The path to generated files
it: Il percorso per i file generati

source: embedded_files_path
it: Percorso File Incorporati

source: The path to generated files for embedded files
it: Il percorso dei file generati per i file incorporati

source: The filenames for generated files
it: Nome per i file generati

source: relative_path
it: Percorso Relativo

source: Use relative paths for external files ( e.g. image files )
it: Usa percorsi relativi per i file esterni (es. file di immagine)

source: first_id
it: Primo ID

source: All GUI controls have an interger ID, this is the value for the first control, each additional control with increment by 1.
it: Tutti i controlli hanno un valore numerico intero ID, quello impostato sarà utilizzato per il primo controllo, i seguenti otterranno un valore incrementato di 1 unità.

source: code_generation
it: Generazione Codice

source: Generate C++ Code
it: Genera Codice C++

source: Generate Python Code
it: Genera Codice Python

source: Generate PHP Code
it: Genera Codice PHP

source: Generate XRC Code
it: Genera Codice XRC

source: Generate Lua Code
it: Genera Codice Lua

source: internationalize
it: Traduci

source: For C++ Only. Generate strings using _() macro for translation.
it: Solo per C++. Genera stringhe usando la macro _() per la traduzione.

source: C++ Properties
it: Proprietà C++

source: use_enum
it: Usa Enumerazioni

source: For C++ Only. Generate an enumeration for control IDs instead of a list of #defines
it: Solo per C++. Genera un'enumerazione per gli ID dei controlli invece di una lista di #define

source: use_array_enum
it: Usa Enumerazioni Array

source: For C++ Only. Generate an enumeration for the dimensions of arrays
it: Solo per C++. Genera un enumeratore per le dimensioni degli array

source: use_microsoft_bom
it: Usa Microsoft BOM

source: For C++ and WXMSW Only. Files are generated with UTF-8 encoding. Microsoft compiliers expect a specific byte sequence at the beginning of a file. GCC does NOT expect this. Only set this to true when using a Microsoft compiler.
it: Solo per C++ e wxMSW. I file vengono generati con la codifica UTF-8. I compilatori Microsoft prevedono una sequenza di byte specifica all'inizio di un file. GCC NON si aspetta questo. Impostalo su true solo quando usi un compilatore Microsoft.

source: precompiled_header
it: Intestazioni Precompilate

source: For C++ Only. The exact code to be generated at the top of the source file to support precompiled headers. For example, to include wxprec.h, the value of this property should be: #include &lt;wx/wxprec.h&gt;
it: Solo per C++. Il codice esatto da generare nella parte superiore del file sorgente per supportare le intestazioni precompilate. Ad esempio, per includere wxprec.h, il valore di questa proprietà dovrebbe essere: #include &lt;wx/wxprec.h&gt;

source: class_decoration
it: Decorazione Classe

source: For C++ Only. Used to decorate classes with DLL export macros.
it: Solo per C++. Utilizzato per decorare le classi con macro di esportazione DLL.

source: decoration
it: Decorazione

source: The name of the macro or the dll export decoration.
it: Il nome della macro o di esportazione DLL.

source: header
it: Intestazione

source: Optional header file where the export macro is defined.
it: File di intestazione facoltativo in cui è definita la macro di esportazione.

source: encoding
it: Codifica

source: For C++ Only. Namespaces to wrap class declarations in.
it: Solo per C++. Spazi dei nomi in cui racchiudere le dichiarazioni di classe.

source: event_generation
it: Generazione Eventi

source: For C++ Only. Type of event connection to generate.
it: Solo per C++. Tipo di connessione evento da generare.

source: Use the Connect() function to link event handlers to events.
it: Utilizza la funzione Connect() per collegare i gestori di eventi agli eventi.

source: table
it: Tabella

source: Use event macro tables to link event handlers to events.
it: Utilizza le tabelle delle macro di eventi per collegare i gestori di eventi agli eventi.

source: disconnect_events
it: Disconnetti Eventi

source: For event_generation=connect Only. Disconnect events in the destructor.
it: Solo per event_generation=connect. Disconnetti gli eventi nel distruttore.

source: help_provider
it: Fornitore Guida

source: For C++ Only. The class of help provider to use for context-sensitive help.
it: Solo per C++. La classe del provider della guida da utilizzare per la guida sensibile al contesto.

source: none
it: Nessuno

source: No support for context-sensitive help.
it: Nessun supporto per la guida sensibile al contesto.

source: Use wxSimpleHelpProvider to provide context-sensitive help.
it: Utilizza wxSimpleHelpProvider per fornire un aiuto sensibile al contesto.

source: Use wxHelpControllerHelpProvider to provide context-sensitive help.
it: Utilizza wxHelpControllerHelpProvider per fornire un aiuto sensibile al contesto.

source: Lua Properties
it: Proprietà Lua

source: skip_lua_events
it: Usa Skip() Per Eventi

source: For Lua Only. Call Skip() function in all generated event handlers.
it: Solo per Lua. Chiama la funzione Skip() in tutti i gestori di eventi generati.

source: ui_table
it: Tabella UI

source: For Lua Only. Define a table which will store- all UI stuff you'll create.
it: Solo per Lua. Definisci una tabella che memorizzerà tutte le cose dell'interfaccia utente che creerai.

source: Python Properties
it: Proprietà Python

source: skip_python_events
it: Usa Skip() Per Eventi

source: For Python Only. Call Skip() function in all generated event handlers.
it: Solo per Python. Chiama la funzione Skip() in tutti i gestori di eventi generati.

source: disconnect_python_events
it: Usa Disconnect() Per Eventi

source: For Python Only. Disconnect events in the destructor.
it: Solo per Python. Disconnetti gli eventi nel distruttore.

source: disconnect_mode
it: Modo Disconnessione

source: For Python Only. Choose which strategy will be used for disconnecting of events (due to different prototypes of Unbind() function in wxPython).
it: Solo per Python. Scegli quale strategia verrà utilizzata per la disconnessione degli eventi (a causa dei diversi prototipi della funzione Unbind() in wxPython).

source: source_name
it: Nome Sorgente

source: Pass source widget name to Unbind() function.
it: Passa il nome del widget sorgente alla funzione Unbind().

source: handler_name
it: Nome Gestore

source: Pass event handler name to Unbind() function.
it: Passa il nome del gestore eventi alla funzione Unbind().

source: For Python only. Use 4-spaces for indentation instead of tabs
it: Solo per Python. Usa 4 spazi per il rientro invece delle tabulazioni

source: image_path_wrapper_function_name
it: None Funz. Wrapper Perc. Immagine

source: For Python only. Wrap image paths into a function with this name. Useful for freezing the application.
it: Solo per Python. Avvolgi i percorsi dell'immagine in una funzione con questo nome. Utile per congelare l'applicazione.

source: PHP Properties
it: Proprietà PHP

source: skip_php_events
it: Usa Skip() Per Eventi

source: For PHP Only. Call Skip() function in all generated event handlers.
it: Solo per PHP. Chiama la funzione Skip() in tutti i gestori di eventi generati.

source: disconnect_php_events
it: Usa Disconnect() Per Eventi

source: For PHP Only. Disconnect events in the destructor.
it: Solo per PHP. Disconnetti gli eventi nel distruttore.

source: For PHP Only. Choose which strategy will be used for disconnecting of events (due to different prototypes of Unbind() function in wxPHP).
it: Solo per PHP. Scegli quale strategia verrà utilizzata per la disconnessione degli eventi (a causa dei diversi prototipi della funzione Unbind() in wxPHP).

source: permission
it: Permessi

source: public
it: Pubblico

source: protected
it: Protetto

source: private
it: Privato

source: enable_user_code
it: Abilita Codice Utente

source: user_cpp_code
it: Codice Utente

source: user_python_code
it: Codice Utente

source: user_lua_code
it: Codice Utente

source: pos
it: Posizione

source: Window position. The default is (-1, -1) which indicates that wxWidgets should generate a default position for the window.
it: Posizione della finestra. Il valore predefinito è (-1, -1) che indica che wxWidgets dovrebbe generare una posizione predefinita per la finestra.

source: size
it: Dimensione

source: Window size. The default is (-1, -1) which indicates that wxWidgets should generate a default size for the window.
it: Dimensione della finestra. Il valore predefinito è (-1, -1) che indica che wxWidgets dovrebbe generare una dimensione predefinita per la finestra.

source: minimum_size
it: Dimensione Minima

source: Sets the minimum size of the window, to indicate to the sizer layout mechanism that this is the minimum required size.
it: Imposta la dimensione minima della finestra, per indicare al meccanismo di layout del sizer che questa è la dimensione minima richiesta.

source: maximum_size
it: Dimensione Massima

source: Sets the maximum size of the window, to indicate to the sizer layout mechanism that this is the maximum allowable size.
it: Imposta la dimensione massima della finestra, per indicare al meccanismo di layout del sizer che questa è la dimensione massima consentita.

source: font
it: Carattere

source: Sets the font for this window. This should not be use for a parent window if you don't want its font to be inherited by its children
it: Imposta il carattere per questa finestra. Questo non dovrebbe essere usato per una finestra padre se non vuoi che il suo carattere venga ereditato dai suoi figli

source: fg
it: Colore Primo Piano

source: Sets the foreground colour of the window.
it: Imposta il colore di primo piano della finestra.

source: bg
it: Colore Sfondo

source: Sets the background colour of the window.
it: Imposta il colore di sfondo della finestra.

source: window_name
it: Nome

source: The name of the window. This parameter is used to associate a name with the item, allowing the application user to set Motif resource values for individual windows.
it: Il nome della finestra. Questo parametro viene utilizzato per associare un nome all'elemento, consentendo all'utente dell'applicazione di impostare i valori delle risorse Motif per le singole finestre.

source: window_style
it: Stile

source: The window class will decide the kind of border to show, if any.
it: La classe della finestra deciderà il tipo di bordo da mostrare, se presente.

source: Displays a thin border around the window. wxSIMPLE_BORDER is the old name for this style.
it: Visualizza un bordo sottile intorno alla finestra. wxSIMPLE_BORDER è il vecchio nome di questo stile.

source: Displays a sunken border. wxSUNKEN_BORDER is the old name for this style.
it: Visualizza un bordo incavato. wxSUNKEN_BORDER è il vecchio nome di questo stile.

source: Displays a raised border. wxRAISED_BORDER is the old name for this style.
it: Visualizza un bordo rialzato. wxRAISED_BORDER è il vecchio nome di questo stile.

source: Displays a border suitable for a static control. wxSTATIC_BORDER is the old name for this style. Windows only.
it: Solo per Windows. Visualizza un bordo adatto per un controllo statico. wxSTATIC_BORDER è il vecchio nome di questo stile.

source: Displays a native border suitable for a control, on the current platform. On Windows XP or Vista, this will be a themed border; on most other platforms a sunken border will be used. For more information for themed borders on Windows, please see Themed borders on Windows.
it: Visualizza un bordo nativo adatto per un controllo, sulla piattaforma corrente. Su Windows XP o Vista, questo sarà un bordo a tema; sulla maggior parte delle altre piattaforme verrà utilizzato un bordo sommerso. Per ulteriori informazioni sui bordi a tema su Windows, vedere Bordi a tema su Windows.

source: Displays no border, overriding the default border style for the window. wxNO_BORDER is the old name for this style.
it: Non visualizza alcun bordo, sovrascrivendo lo stile del bordo predefinito per la finestra. wxNO_BORDER è il vecchio nome di questo stile.

source: The window is transparent, that is, it will not receive paint events. Windows only.
it: La finestra è trasparente, cioè non riceverà eventi di disegno. Solo finestre.

source: Use this to enable tab traversal for non-dialog windows.
it: Usalo per abilitare l'attraversamento delle schede per le finestre non di dialogo.

source: Use this to indicate that the window wants to get all char/key events for all keys - even for keys like TAB or ENTER which are usually used for dialog navigation and which wouldn't be generated without this style. If you need to use this style in order to get the arrows or etc., but would still like to have normal keyboard navigation take place, you should call Navigate in response to the key events for Tab and Shift-Tab.
it: Usa questo per indicare che la finestra vuole ottenere tutti gli eventi char/key per tutte le chiavi, anche per chiavi come TAB o ENTER che vengono solitamente utilizzate per la navigazione nelle finestre di dialogo e che non verrebbero generate senza questo stile. Se è necessario utilizzare questo stile per ottenere le frecce o altro, ma si desidera comunque che avvenga la normale navigazione da tastiera, è necessario chiamare Navigate in risposta agli eventi chiave per Tab e Maiusc-Tab.

source: Use this style to enable a vertical scrollbar. Notice that this style cannot be used with native controls which don't support scrollbars nor with top-level windows in most ports.
it: Usa questo stile per abilitare una barra di scorrimento verticale. Nota che questo stile non può essere utilizzato con i controlli nativi che non supportano le barre di scorrimento né con le finestre di primo livello nella maggior parte delle porte.

source: Use this style to enable a horizontal scrollbar. The same limitations as for wxVSCROLL apply to this style.
it: Usa questo stile per abilitare una barra di scorrimento orizzontale. Le stesse limitazioni di wxVSCROLL si applicano a questo stile.

source: If a window has scrollbars, disable them instead of hiding them when they are not needed (i.e. when the size of the window is big enough to not require the scrollbars to navigate it). This style is currently implemented for wxMSW, wxGTK and wxUniversal and does nothing on the other platforms.
it: Se una finestra ha le barre di scorrimento, disabilitale invece di nasconderle quando non sono necessarie (cioè quando la dimensione della finestra è abbastanza grande da non richiedere le barre di scorrimento per navigare). Questo stile è attualmente implementato per wxMSW, wxGTK e wxUniversal e non fa nulla sulle altre piattaforme.

source: Use this style to eliminate flicker caused by the background being repainted, then children being painted over them. Windows only.
it: Solo per Windows. Usa questo stile per eliminare lo sfarfallio causato dallo sfondo che viene ridipinto, quindi i bambini vengono dipinti su di esso.

source: Use this style to force a complete redraw of the window whenever it is resized instead of redrawing just the part of the window affected by resizing. Note that this was the behaviour by default before 2.5.1 release and that if you experience redraw problems with code which previously used to work you may want to try this. Currently this style applies on GTK+ 2 and Windows only, and full repainting is always done on other platforms.
it: Usa questo stile per forzare un ridisegno completo della finestra ogni volta che viene ridimensionata invece di ridisegnare solo la parte della finestra interessata dal ridimensionamento. Nota che questo era il comportamento predefinito prima del rilascio 2.5.1 e che se riscontri problemi di ridisegno con il codice che in precedenza funzionava potresti provare questo. Attualmente questo stile si applica solo su wxGTK e Windows, il ridisegno completo viene sempre eseguita su altre piattaforme.

source: On Windows, this style used to disable repainting the window completely when its size is changed. Since this behaviour is now the default, the style is now obsolete and no longer has an effect.
it: Su Windows, questo stile era utilizzato per disabilitare completamente il ridisegno della finestra quando le sue dimensioni venivano modificate. Poiché questo comportamento è ora l'impostazione predefinita, lo stile è ora obsoleto e non ha più effetto.

source: window_extra_style
it: Stile Extra

source: By default, Validate/TransferDataTo/FromWindow() only work on direct children of the window (compatible behaviour). Set this flag to make them recursively descend into all subwindows.
it: Per impostazione predefinita, Validate/TransferDataTo/FromWindow() funziona solo sui controlli diretti discendenti della finestra (comportamento compatibile). Imposta questo flag per propagarlo ricorsivamente a tutte le sottofinestre.

source: wxCommandEvents and the objects of the derived classes are forwarded to the parent window and so on recursively by default. Using this flag for the given window allows to block this propagation at this window, i.e. prevent the events from being propagated further upwards. Dialogs have this flag on by default.
it: wxCommandEvents e gli oggetti delle classi derivate vengono inoltrati alla finestra genitore e così via in modo ricorsivo per impostazione predefinita. L'utilizzo di questo flag per la data finestra consente di bloccare questa propagazione in questa finestra, ovvero impedire che gli eventi si propaghino ulteriormente verso l'alto. Le finestre di dialogo hanno questo flag attivo per impostazione predefinita.

source: Don't use this window as an implicit parent for the other windows: this must be used with transient windows as otherwise there is the risk of creating a dialog/frame with this window as a parent which would lead to a crash if the parent is destroyed before the child.
it: Non usare questa finestra come genitore implicito per le altre finestre: deve essere usato con finestre transitorie altrimenti c'è il rischio di creare una finestra di dialogo/frame con questa finestra come genitore che porterebbe ad un crash se il widget genitore viene distrutto prima.

source: Under Windows, puts a query button on the caption. When pressed, Windows will go into a context-sensitive help mode and wxWidgets will send a wxEVT_HELP event if the user clicked on an application window. This style cannot be used (because of the underlying native behaviour) together with wxMAXIMIZE_BOX or wxMINIMIZE_BOX, so these two styles are automatically turned off if this one is used.
it: In Windows, inserisce un pulsante di query sulla didascalia. Quando viene premuto, Windows entrerà in una modalità di aiuto sensibile al contesto e wxWidgets invierà un evento wxEVT_HELP se l'utente ha fatto clic su una finestra dell'applicazione. Questo stile non può essere utilizzato (a causa del comportamento nativo sottostante) insieme a wxMAXIMIZE_BOX o wxMINIMIZE_BOX, quindi questi due stili vengono automaticamente disattivati ​​se viene utilizzato questo.

source: This window should always process idle events, even if the mode set by wxIdleEvent::SetMode is wxIDLE_PROCESS_SPECIFIED.
it: Questa finestra dovrebbe sempre elaborare gli eventi inattivi, anche se la modalità impostata da wxIdleEvent::SetMode è wxIDLE_PROCESS_SPECIFIED.

source: This window should always process UI update events, even if the mode set by wxUpdateUIEvent::SetMode is wxUPDATE_UI_PROCESS_SPECIFIED.
it: Questa finestra dovrebbe sempre elaborare gli eventi di aggiornamento dell'interfaccia utente, anche se la modalità impostata da wxUpdateUIEvent::SetMode è wxUPDATE_UI_PROCESS_SPECIFIED.

source: tooltip
it: Suggerimento

source: Attach a tooltip to the window.
it: Allega un tooltip alla finestra.

source: context_menu
it: Menu Contestuale

source: Generates event handler for displaying of menu assigned to this widgets as a context menu.
it: Genera un gestore di eventi per la visualizzazione del menu assegnato a questo widget come menu contestuale.

source: context_help
it: Guida Contestuale

source: Attach context-sensitive help to the window. Note: The Project's &quot;help_provider&quot; property must be set for context-sensitive help to work.
it: Allega la guida sensibile al contesto alla finestra. Nota: l' &quot;help_provider&quot; del progetto La proprietà deve essere impostata affinché la guida sensibile al contesto funzioni.

source: enabled
it: Abilitato

source: Enable or disable the window for user input. Note that when a parent window is disabled, all of its children are disabled as well and they are reenabled again when the parent is.
it: Abilita o disabilita la finestra per l'input dell'utente. Nota che quando una finestra padre è disabilitata, anche tutti i suoi figli sono disabilitati e vengono riabilitati di nuovo quando lo è il genitore.

source: hidden
it: Nascosto

source: Shows or hides the window.
it: Mostra o nasconde la finestra.

source: subclass
it: Sottoclasse

source: For easy use of custom widgets which are simple variations from standard ones, without requiring a new plugin for wxWeaver or a full xrc handler for wxWidgets. For C++, this replaces the name of the class. For XRC, this sets the subclass value on the object tag.
it: Per un facile utilizzo di widget personalizzati che sono semplici variazioni da quelli standard, senza richiedere un nuovo plugin per wxWeaver o un gestore xrc completo per wxWidgets. Per C++, sostituisce il nome della classe. Per XRC, imposta il valore della sottoclasse sul tag dell'oggetto.

source: The name of the subclass.
it: Il nome della sottoclasse.

source: For C++ Only. The header to be included for the subclass.
it: Solo per C++. File di intestazione da includere per la sottoclasse.

source: forward_declare
it: Dichiarazione Anticipata

source: For C++ Only. Forward declare the subclass, otherwise include the header.
it: Solo per C++. Se dichiarare anticipatamente la sottoclasse o includerne il file di intestazione.

source: Process a wxEVT_CHAR event.
it: Elabora un evento wxEVT_CHAR.
