Repository: wxweaver/wxWeaver
Catalog: resources/i18n/locale/*/wxweaver.po
Languages: it

source: Process a wxEVT_CHAR_HOOK event. Unlike all the other key events, this event is propagated upwards the window hierarchy which allows intercepting it in the parent window of the focused window to which it is sent initially (if there is no focused window, this event is sent to the wxApp global object). It is also generated before any other key events and so gives the parent window an opportunity to modify the keyboard handling of its children, e.g. it is used internally by wxWidgets in some ports to intercept pressing Esc key in any child of a dialog to close the dialog itself when it's pressed. By default, if this event is handled, i.e. the handler doesn't call wxEvent::Skip(), neither wxEVT_KEY_DOWN nor wxEVT_CHAR events will be generated (although wxEVT_KEY_UP still will be), i.e. it replaces the normal key events. However by calling the special DoAllowNextEvent() method you can handle wxEVT_CHAR_HOOK and still allow normal events generation. This is something that is rarely useful but can be required if you need to prevent a parent wxEVT_CHAR_HOOK handler from running without suppressing the normal key events. Finally notice that this event is not generated when the mouse is captured as it is considered that the window which has the capture should receive all the keyboard events too without allowing its parent wxTopLevelWindow to interfere with their processing.
it: Elabora un evento wxEVT_CHAR_HOOK. A differenza di tutti gli altri eventi chiave, questo evento viene propagato verso l'alto nella gerarchia della finestra che permette di intercettarlo nella finestra madre della finestra focalizzata a cui viene inviato inizialmente (se non esiste una finestra focalizzata, questo evento viene inviato all'oggetto globale wxApp ). Viene anche generato prima di qualsiasi altro evento chiave e quindi offre alla finestra padre l'opportunità di modificare la gestione della tastiera dei suoi figli, ad es. è usato internamente da wxWidgets in alcune porte per intercettare la pressione del tasto Esc in qualsiasi figlio di una finestra di dialogo per chiudere la finestra stessa quando viene premuto. Per impostazione predefinita, se questo evento viene gestito, ovvero il gestore non chiama wxEvent::Skip(), non verranno generati né gli eventi wxEVT_KEY_DOWN né wxEVT_CHAR (sebbene wxEVT_KEY_UP lo sarà ancora), cioè sostituisce i normali eventi chiave. Tuttavia, chiamando il metodo speciale DoAllowNextEvent() è possibile gestire wxEVT_CHAR_HOOK e consentire comunque la normale generazione di eventi. Questo è qualcosa che è raramente utile ma può essere richiesto se è necessario impedire l'esecuzione di un gestore padre wxEVT_CHAR_HOOK senza sopprimere i normali eventi chiave. Si noti infine che questo evento non viene generato quando il mouse viene catturato in quanto si considera che la finestra che ha la cattura dovrebbe ricevere anche tutti gli eventi della tastiera senza consentire al suo genitore wxTopLevelWindow di interferire con la loro elaborazione.

source: Process a wxEVT_KEY_DOWN event (any key has been pressed). If this event is handled and not skipped, wxEVT_CHAR will not be generated at all for this key press (but wxEVT_KEY_UP will be).
it: Elabora un evento wxEVT_KEY_DOWN (è stato premuto un tasto qualsiasi). Se questo evento viene gestito e non saltato, wxEVT_CHAR non verrà generato affatto per questa pressione del tasto (ma lo sarà wxEVT_KEY_UP).

source: Process a wxEVT_KEY_UP event (any key has been released).
it: Elabora un evento wxEVT_KEY_UP (un qualsiasi tasto è stato rilasciato).

source: Process a wxEVT_ENTER_WINDOW event.
it: Elabora un evento wxEVT_ENTER_WINDOW.

source: Process a wxEVT_LEAVE_WINDOW event.
it: Elabora un evento wxEVT_LEAVE_WINDOW.

source: Process a wxEVT_LEFT_DCLICK event.
it: Elabora un evento wxEVT_LEFT_DCLICK.

source: Process a wxEVT_LEFT_DOWN event.
it: Elabora un evento wxEVT_LEFT_DOWN.

source: Process a wxEVT_LEFT_UP event.
it: Elabora un evento wxEVT_LEFT_UP.

source: Process a wxEVT_MIDDLE_DCLICK event.
it: Elabora un evento wxEVT_MIDDLE_DCLICK.

source: Process a wxEVT_MIDDLE_DOWN event.
it: Elabora un evento wxEVT_MIDDLE_DOWN.

source: Process a wxEVT_MIDDLE_UP event.
it: Elabora un evento wxEVT_MIDDLE_UP.

source: Process a wxEVT_RIGHT_DCLICK event.
it: Elabora un evento wxEVT_RIGHT_DCLICK.

source: Process a wxEVT_RIGHT_DOWN event.
it: Elabora un evento wxEVT_RIGHT_DOWN.

source: Process a wxEVT_RIGHT_UP event.
it: Elabora un evento wxEVT_RIGHT_UP.

source: Process a wxEVT_AUX1_DCLICK event.
it: Elabora un evento wxEVT_AUX1_DCLICK.

source: Process a wxEVT_AUX1_DOWN event.
it: Elabora un evento wxEVT_AUX1_DOWN.

source: Process a wxEVT_AUX1_UP event.
it: Elabora un evento wxEVT_AUX1_UP.

source: Process a wxEVT_AUX2_DCLICK event.
it: Elabora un evento wxEVT_AUX2_DCLICK.

source: Process a wxEVT_AUX2_DOWN event.
it: Elabora un evento wxEVT_AUX2_DOWN.

source: Process a wxEVT_AUX2_UP event.
it: Elabora un evento wxEVT_AUX2_UP.

source: Process a wxEVT_MOTION event.
it: Elabora un evento wxEVT_MOTION.

source: Process a wxEVT_MOUSEWHEEL event.
it: Elabora un evento wxEVT_MOUSEWHEEL.

source: Process all mouse events.
it: Elabora tutti gli eventi del mouse.

source: Process a wxEVT_KILL_FOCUS event.
it: Elabora un evento wxEVT_KILL_FOCUS.

source: Process a wxEVT_SET_FOCUS event.
it: Elabora un evento wxEVT_SET_FOCUS.

source: Other Events
it: Altri Eventi

source: Process a wxEVT_ERASE_BACKGROUND event.
it: Elabora un evento wxEVT_ERASE_BACKGROUND.

source: Process a wxEVT_PAINT event.
it: Elabora un evento wxEVT_PAINT.

source: Process a wxEVT_SIZE event.
it: Elabora un evento wxEVT_SIZE.

source: Process a wxEVT_MOVE event, which is generated when a window is moved. Not generated in wxGTK
it: Elabora un evento wxEVT_MOVE, che viene generato quando una finestra viene spostata. Non generato in wxGTK

source: Process a wxEVT_UPDATE_UI event.
it: Elabora un evento wxEVT_UPDATE_UI.

source: Begin dragging with the left mouse button.
it: Inizia a trascinare con il tasto sinistro del mouse.

source: Begin dragging with the right mouse button.
it: Inizia a trascinare con il tasto destro del mouse.

source: End dragging with the left or right mouse button.
it: Termina il trascinamento con il tasto sinistro o destro del mouse.

source: Begin editing a label. This can be prevented by calling Veto().
it: Inizia a modificare un'etichetta. Questo può essere evitato chiamando Veto().

source: Finish editing a label. This can be prevented by calling Veto().
it: Termina la modifica di un'etichetta. Questo può essere evitato chiamando Veto().

source: Delete an item.
it: Elimina un elemento.

source: The item has been activated, i.e. chosen by double clicking it with mouse or from keyboard.
it: L'oggetto è stato attivato, cioè scelto facendo doppio click con il mouse o da tastiera.

source: The item has been collapsed.
it: L'elemento è stato compresso.

source: The item is being collapsed. This can be prevented by calling Veto().
it: L'elemento viene compresso. Questo può essere evitato chiamando Veto().

source: The item has been expanded.
it: L'elemento è stato ampliato.

source: The item is being expanded. This can be prevented by calling Veto().
it: L'elemento è in fase di espansione. Questo può essere evitato chiamando Veto().

source: The user has clicked the item with the right mouse button
it: L'utente ha cliccato sull'elemento con il tasto destro del mouse

source: The user has clicked the item with the middle mouse button.
it: L'utente ha fatto clic sull'elemento con il pulsante centrale del mouse.

source: Selection has changed.
it: La selezione è cambiata.

source: Selection is changing. This can be prevented by calling Veto().
it: La selezione sta cambiando. Questo può essere evitato chiamando Veto().

source: A key has been pressed.
it: È stato premuto un tasto.

source: The context menu for the selected item has been requested, either by a right click or by using the menu key.
it: Il menu contestuale per l'elemento selezionato è stato richiesto, con un clic destro o utilizzando il tasto menu.

source: label
it: Etichetta

source: Simple markup can be used to apply different fonts or colours to different parts of the control label when supported. If markup is not supported by the control or platform, it is simply stripped and SetLabel() is used with the resulting string. Since 2.9.2.
it: Il markup semplice può essere utilizzato per applicare caratteri o colori diversi a parti diverse dell'etichetta di controllo, se supportato. Se il markup non è supportato dal controllo o dalla piattaforma, viene semplicemente rimosso e viene utilizzato SetLabel() con la stringa risultante. Dalla versione 2.9.2.

source: This is the bitmap shown in the default state, it must be always valid while all the other bitmaps are optional and don't have to be set.
it: Questa è la bitmap mostrata nello stato di default, deve essere sempre valida mentre tutte le altre bitmap sono facoltative e non devono essere impostate.

source: disabled
it: Disabilitato

source: Bitmap shown when the button is disabled.
it: Bitmap mostrato quando il pulsante è disabilitato.

source: pressed
it: Premuto

source: Bitmap shown when the button is pushed (e.g. while the user keeps the mouse button pressed on it).
it: Bitmap mostrata quando il pulsante viene premuto (ad esempio mentre l'utente tiene premuto il pulsante del mouse su di esso).

source: focus
it: A Fuoco

source: Bitmap shown when the button has keyboard focus but is not pressed.
it: Bitmap mostrato quando il pulsante ha lo stato attivo della tastiera ma non è premuto.

source: current
it: Attuale

source: Bitmap shown when the mouse is over the button (but it is not pressed). Notice that if hover bitmap is not specified but the current platform UI uses hover images for the buttons (such as Windows XP or GTK+), then the focus bitmap is used for hover state as well. This makes it possible to set focus bitmap only to get reasonably good behaviour on all platforms.
it: Bitmap mostrato quando il mouse è sopra il pulsante (ma non è premuto). Notare che se la bitmap al passaggio del mouse non è specificata ma l'interfaccia utente della piattaforma corrente utilizza immagini al passaggio del mouse per i pulsanti (come Windows XP o GTK), la bitmap di attivazione viene utilizzata anche per lo stato al passaggio del mouse. Ciò rende possibile impostare la bitmap di messa a fuoco solo per ottenere un comportamento ragionevolmente buono su tutte le piattaforme.

source: position
it: Posizione

source: Positions the bitmap at the left
it: Posiziona la bitmap a sinistra

source: Positions the bitmap at the right
it: Posiziona la bitmap a destra

source: Positions the bitmap at the top
it: Posiziona la bitmap in alto

source: Positions the bitmap at the bottom
it: Posiziona la bitmap in basso

source: margins
it: Margini

source: The margins between the bitmap and the text of the button. This is currently only implemented under MSW. If it is not specified, default margin is used around the bitmap.
it: I margini tra la bitmap e il testo del pulsante. Questo è attualmente implementato solo sotto MSW. Se non è specificato, viene utilizzato il margine predefinito attorno alla bitmap.

source: basename
it: Nome Base

source: gen_file
it: Genera File

source: type
it: Tipo

source: aui_name
it: Nome

source: Sets the internal name of the pane.
it: Imposta il nome interno del riquadro.

source: caption_visible
it: Titolo Visibile

source: Indicates that a pane caption should be visible.
it: Indica che una didascalia del riquadro dovrebbe essere visibile.

source: caption
it: Titolo

source: Sets the caption of the pane.
it: Imposta la didascalia del riquadro.

source: close_button
it: Pulsante Chiusura

source: Indicates that a close button should be drawn for the pane.
it: Indica che deve essere disegnato un pulsante di chiusura per il riquadro.

source: maximize_button
it: Pulsante Ingrandimento

source: Indicates that a maximize button should be drawn for the pane.
it: Indica che deve essere disegnato un pulsante di ingrandimento per il riquadro.

source: minimize_button
it: Pulsante Riduzione Icona

source: Indicates that a minimize button should be drawn for the pane.
it: Indica che deve essere disegnato un pulsante di riduzione a icona per il riquadro.

source: pin_button
it: Appuntare

source: Indicates that a pin button should be drawn for the pane.
it: Indica che deve essere disegnato un pulsante a forma di puntina per il riquadro.

source: pane_border
it: Bordo Riquadro

source: Indicates that a border should be drawn for the pane.
it: Indica che deve essere disegnato un bordo per il riquadro.

source: show
it: Visibile

source: Indicates that a pane should be shown.
it: Indica che deve essere visualizzato un riquadro.

source: gripper
it: Pinza

source: Indicates that a gripper should be drawn for the pane.
it: Indica che deve essere disegnata una pinza per il riquadro.

source: center_pane
it: Riquadro Centrale

source: Specifies that the pane should adopt the default center pane settings. Centre panes usually do not have caption bars. This function provides an easy way of preparing a pane to be displayed in the center dock position.
it: Specifica che il riquadro deve adottare le impostazioni predefinite del riquadro centrale. I riquadri centrali di solito non hanno barre del titolo. Questa funzione fornisce un modo semplice per preparare un riquadro da visualizzare nella posizione di ancoraggio centrale.

source: default_pane
it: Riquadro Predefinito

source: Specifies that the pane should adopt the default pane settings.
it: Specifica che il riquadro deve adottare le impostazioni del riquadro predefinite.

source: toolbar_pane
it: Riquadro Barra Strumenti

source: Specifies that the pane should adopt the default toolbar pane settings.
it: Specifica che il riquadro deve adottare le impostazioni predefinite del riquadro della barra degli strumenti.

source: moveable
it: Mobile

source: Indicates whether a frame can be moved.
it: Indica se un frame può essere spostato.

source: resize
it: Ridimensionabile

source: Resizable
it: Ridimensionabile

source: Allows a pane to be resized if the parameter is true, and forces it to be a fixed size if the parameter is false.
it: Consente il ridimensionamento di un riquadro se il parametro è vero e ne impone una dimensione fissa se il parametro è falso.

source: Fixed
it: Fisso

source: Forces a pane to be fixed size so that it cannot be resized.
it: Impone la dimensione fissa di un riquadro in modo che non possa essere ridimensionato.

source: pane_size
it: Dimensione Riquadro

source: Sets the size of the floating pane.
it: Imposta la dimensione del riquadro mobile.

source: best_size
it: Dimensione Migliore

source: Sets the ideal size for the pane.
it: Imposta la dimensione ideale per il riquadro.

source: min_size
it: Dimensione Minima

source: Sets the minimum size of the pane.
it: Imposta la dimensione minima del riquadro.

source: max_size
it: Dimensione Massima

source: Sets the maximum size of the pane.
it: Imposta la dimensione massima del riquadro.

source: dock
it: Agganciabile

source: Dock
it: Agganciato

source: Indicates that a pane should be docked.
it: Indica che un riquadro deve essere ancorato.

source: Float
it: Fluttuante

source: Indicates that a pane should be floated.
it: Indica che un riquadro deve essere flottato.

source: dock_fixed
it: Fisso

source: Causes the containing dock to have no resize sash. This is useful for creating panes that span the entire width or height of a dock, but should not be resizable in the other direction.
it: Fa in modo che il dock contenitore non abbia un'anta di ridimensionamento. Questo è utile per creare riquadri che coprono l'intera larghezza o altezza di un dock, ma non dovrebbero essere ridimensionabili nell'altra direzione.

source: floatable
it: Fluttuante

source: Sets whether the user will be able to undock a pane and turn it into a floating window.
it: Imposta se l'utente sarà in grado di sganciare un riquadro e trasformarlo in una finestra mobile.

source: BottomDockable
it: Aggancia In Basso

source: Indicates whether a pane can be docked at the bottom of the frame.
it: Indica se un riquadro può essere ancorato nella parte inferiore della cornice.

source: TopDockable
it: Aggancia In Alto

source: Indicates whether a pane can be docked at the top of the frame.
it: Indica se un riquadro può essere ancorato nella parte superiore della cornice.

source: LeftDockable
it: Aggancia A Sinistra

source: Indicates whether a pane can be docked on the left of the frame.
it: Indica se un riquadro può essere ancorato a sinistra della cornice.

source: RightDockable
it: Aggancia A Destra

source: Indicates whether a pane can be docked on the right of the frame.
it: Indica se un riquadro può essere ancorato a destra della cornice.

source: docking
it: Attracco

source: Determines the direction of the docked pane.
it: Determina la direzione del riquadro ancorato.

source: Top
it: Sopra

source: Bottom
it: Sotto

source: Left
it: Sinistra

source: Center
it: Centrale

source: Right
it: Destra

source: pane_position
it: Posizione Riquadro

source: Sets the position of the floating pane.
it: Imposta la posizione del riquadro mobile.

source: aui_position
it: Posizione

source: Determines the position of the docked pane.
it: Determina la posizione del riquadro ancorato.

source: aui_row
it: Linea

source: Determines the row of the docked pane.
it: Determina la riga del riquadro ancorato.

source: aui_layer
it: Livello

source: Determines the layer of the docked pane. The dock layer is similar to an onion, the inner-most layer being layer 0. Each shell moving in the outward direction has a higher layer number. This allows for more complex docking layout formation.
it: Determina il livello del riquadro ancorato. Il livello dock è simile a una cipolla, il livello più interno è il livello 0. Ogni shell che si muove verso l'esterno ha un numero di livello più alto. Ciò consente una formazione del layout di attracco più complessa.

source: validator_type
it: Tipo Validatore

source: For C++ Only. Type of a validator assigned to the window
it: Solo per C++. Tipo di validatore assegnato alla finestra

source: Default validator (does nothing)
it: Validatore predefinito (non fa nulla)

source: Generic validator. Transfers data from/to window .
it: Validatore generico. Trasferisce dati da/a finestra.

source: Text validator. Transfer data from/to window and allows basic data filtering.
it: Validatore di testo. Trasferisce dati da/a finestra e consente il filtraggio dei dati di base.

source: validator_style
it: Stile Validatore

source: For C++ Only. Data filtering style for wxTextValidator.
it: Solo per C++. Stile di filtraggio dei dati per wxTextValidator.

source: No filtering takes place.
it: Non avviene alcun filtraggio.

source: Non-ASCII characters are filtered out.
it: I caratteri non ASCII vengono filtrati.

source: Non-alpha characters are filtered out.
it: I caratteri non alfabetici vengono filtrati.

source: Non-alphanumeric characters are filtered out.
it: I caratteri non alfanumerici vengono filtrati.

source: Non-numeric characters are filtered out.
it: I caratteri non numerici vengono filtrati.

source: Use an include list. The validator checks if the user input is on the list, complaining if not. See wxTextValidator::SetIncludes.
it: Utilizzare un elenco di inclusione. Il validatore controlla se l'input dell'utente è nell'elenco, lamentandosi in caso contrario. Vedere wxTextValidator::SetIncludes.

source: Use an exclude list. The validator checks if the user input is on the list, complaining if it is. See wxTextValidator::SetExcludes.
it: Usa un elenco di esclusione. Il validatore controlla se l'input dell'utente è nell'elenco, lamentandosi se lo è. Vedere wxTextValidator::SetExcludes.

source: Use an include list. The validator checks if each input character is in the list (one character per list element), complaining if not. See wxTextValidator::SetIncludes.
it: Utilizzare un elenco di inclusione. Il validatore controlla se ogni carattere di input è nell'elenco (un carattere per elemento dell'elenco), lamentandosi in caso contrario. Vedi wxTextValid ator::SetIncludes.

source: Use an include list. The validator checks if each input character is in the list (one character per list element), complaining if it is. See wxTextValidator::SetExcludes.
it: Utilizzare un elenco di inclusione. Il validatore controlla se ogni carattere di input è nella lista (un carattere per elemento della lista), lamentandosi se lo è. Vedere wxTextValidator::SetExcludes.

source: validator_variable
it: Variabile Validatore

source: For C++ Only. Name of a member variable associated with the validator
it: Solo per C++. Nome di una variabile membro associata al validatore

source: validator_data_type
it: Tipo Dati Validatore

source: For C++ Only. Data type of the member variable
it: Solo per C++. Genera stringhe usando la macro _() per la traduzione

source: Undefined data type.
it: Tipo di dati non definito.

source: Logical value. This should be used for wxCheckBox and wxRadioButton.
it: Valore logico. Questo dovrebbe essere usato per wxCheckBox e wxRadioButton.

source: Signed integer value. This should be used for wxGauge, wxScrollBar, wxRadioBox, wxSpinButton, wxChoice.
it: Valore intero con segno. Questo dovrebbe essere usato per wxGauge, wxScrollBar, wxRadioBox, wxSpinButton, wxChoice.

source: String value. This should be used for wxButton, wxComboBox, wxStaticText, wxTextCtrl.
it: Valore stringa. Questo dovrebbe essere usato per wxButton, wxComboBox, wxStaticText, wxTextCtrl.

source: Array of integers. This should be used for wxListBox, wxCheckListBox.
it: Matrice di interi. Questo dovrebbe essere usato per wxListBox, wxCheckListBox.

source: &Cancel
it: A&nnulla

source: &Help
it: &Aiuto

source: &Next >
it: &Successivo >

source: < &Back
it: < &Indietro

source: &Finish
it: &Fine

source: You cannot save over a file that is currently open in another instance. Would you like to switch to that instance?
it: Non puoi sovrascrivere un file aperto da un'altra istanza. Vuoi visualizzare tale istanza?

source: Open in Another Instance
it: Apri in un'altra istanza

source: This project file is newer than this version of wxWeaver. It cannot be opened. Please download an updated version from https://wxweaver.github.io
it: Il file di progetto appartiene a una versione aggiornata di wxWeaver. Non puo' essere aperto. Per favore scarica una versione più aggiornata da https://wxweaver.github.io

source: New Version
it: Nuova Versione

source: This project file is using an older file format, it will be updated during loading. WARNING: Saving the project will update the format of the project file on disk!
it: Questo progetto utilizza un formato di file di una versione precedente e verrà aggiornato durante il caricamento. ATTENZIONE: Salvando il progetto verrà sovrascritto con il nuovo formato!

source: Older file format
it: Formato di file di una versione precedente

source: The "user_headers" property has been removed.
it: La proprietà "user_headers" è stata rimossa.

source: Its purpose was to provide a place to include precompiled headers or
it: Il suo scopo è di provvedere l'inclusione di header precompilati o

source: headers for subclasses.
it: header per sottoclassi.

source: There is now a "precompiled_header" property and a "header" subitem
it: Ora è presente una proprietà "precompiled_header" e una sottovoce "header"

source: on the subclass property.
it: alla voce di proprietà subclass

source: Would you like the current value of the "user_headers" property to be saved
it: Vuoi salvare i valori della proprietà "user_headers"
